{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.1.2",
    "title": "Access Control Facts",
    "content_type": "text",
    "filename": "4.1.2_Access_Control_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.1.2_Access_Control_Facts_[text].txt",
    "word_count": 2008,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Information security Cybersecurity framework Gap analysis Access control Zero Trust security concepts Control and data planes in Zero Trust models Information Security Information security (infosec) refers to the protection of data resources from unauthorized access, attack, theft, or damage. Data may be vulnerable because of the way it is stored, transferred, or processed. The systems used to store, transmit, and process data must demonstrate the properties of security. Secure information has three properties, often referred to as the CIA Triad : Confidentiality means that information can only be read by people who have been explicitly authorized to access it. Integrity means that the data is stored and transferred as intended and that any modification is authorized. Availability means that information is readily accessible to those authorized to view or modify it. The triad can also be referred to as \"AIC\" to avoid confusion with the Central Intelligence Agency. Some security models and researchers identify other properties of secure systems. The most important of these is non-repudiation.  Non-repudiation means that a person cannot deny doing something, such as creating, modifying, or sending a resource. For example, a legal document, such as a will, must usually be witnessed when it is signed. If there is a dispute about whether the document was correctly executed, the witness can provide evidence that it was. Cybersecurity Framework Within the goal of ensuring information security, cybersecurity refers specifically to provisioning secure processing hardware and software. Information security and cybersecurity tasks can be classified into five functions, following the framework developed by the National Institute of Standards and Technology (NIST) (nist.gov/cyberframework/online-learning/five-functions): Identify — develop security policies and capabilities. Evaluate risks, threats, and vulnerabilities and recommend security controls to mitigate them. Protect — procure/develop, install, operate, and decommission IT hardware and software assets with security as an embedded requirement of every stage of this operation's lifecycle. Detect — perform ongoing, proactive monitoring to ensure that controls are effective and capable of protecting against new types of threats. Respond — identify, analyze, contain, and eradicate threats to systems and data security. Recover — implement cybersecurity resilience to restore systems and data if other controls are unable to prevent attacks. Core cybersecurity tasks Description NIST's framework is just one example. There are many other cybersecurity frameworks (CSF). Gap Analysis Each security function is associated with a number of goals or outcomes. For example, one outcome of the Identify Function is an inventory of the assets owned and operated by the company. Outcomes are achieved by implementing one or more security controls. Numerous categories and types of security controls cover a huge range of functions. This makes the selection of appropriate and effective controls difficult. A cybersecurity framework guides the selection and configuration of controls. Frameworks are important because they save an organization from building its security program in a vacuum or building it on a foundation that fails to account for important security concepts. The use of a framework allows an organization to make an objective statement of its current cybersecurity capabilities, identify a target level of capability, and prioritize investments to achieve that target. This gives a structure to internal risk management procedures and provides an externally verifiable statement of regulatory compliance. Gap analysis is a process that identifies how an organization's security systems deviate from those required or recommended by a framework. This will be performed when first adopting a framework or when meeting a new industry or legal compliance requirement. The analysis might be repeated every few years to meet compliance requirements or to validate any changes that have been made to the framework. For each section of the framework, a gap analysis report will provide an overall score, a detailed list of missing or poorly configured controls associated with that section, and recommendations for remediation. Summary of gap analysis findings Description While some or all work involved in gap analysis could be performed by the internal security team, a gap analysis is likely to involve third-party consultants. Frameworks and compliance requirements from regulations and legislation can be complex enough to require a specialist. Advice and feedback from an external party can alert the internal security team to oversights, new trends, and changes in best practices. Access Control An access control system ensures that an information system meets the goals of the CIA triad. Access control governs how subjects/principals may interact with objects. Subjects are people, devices, software processes, or any other system that can request and be granted access to a resource. Objects are the resources. An object could be a network, server, database, app, or file. Subjects are assigned rights or permissions on resources. Modern access control is typically implemented as an identity and access management (IAM) system. IAM comprises four main processes: Identification — creating an account or ID that uniquely represents the user, device, or process on the network. Authentication — proving that a subject is who or what it claims to be when it attempts to access the resource. An authentication factor determines what sort of credential the subject can use. For example, people might be authenticated by providing a password; a computer system could be authenticated using a token such as a digital certificate. Authorization — determining what rights subjects should have on each resource and enforcing those rights. An authorization model determines how these rights are granted. For example, in a discretionary model, the object owner can allocate rights. In a mandatory model, rights are predetermined by system-enforced rules and cannot be changed by any user within the system. Accounting — tracking authorized usage of a resource or use of rights by a subject and alerting when unauthorized use is detected or attempted. Differences among identification, authentication, authorization, and accounting Images © 123RF.com Description The servers and protocols that implement these functions can also be referred to as authentication, authorization, and accounting (AAA). The use of IAM to describe enterprise security workflows is becoming more prevalent as the importance of the identification process is better acknowledged. For example, if you are setting up an e-commerce site and want to enroll users, you need to select the appropriate controls to perform each function: Identification — ensure that customers are legitimate. For example, you might need to ensure that billing and delivery addresses match and that they are not trying to use fraudulent payment methods. Authentication — ensure that customers have unique accounts and that only they can manage their orders and billing information. Authorization — rules to ensure customers can place orders only when they have valid payment mechanisms in place. You might operate loyalty schemes or promotions that authorize certain customers to view unique offers or content. Accounting — the system must record the actions a customer takes (to ensure that they cannot deny placing an order, for instance). Remember that these processes apply both to people and to systems. For example, you need to ensure that your e-commerce server can authenticate its identity when customers connect to it using a web browser. Zero Trust Security Concepts Zero Trust is a security model that assumes that all devices, users, and services are not inherently trusted, regardless of whether inside or outside a network's perimeter. Instead, the Zero Trust model requires all users and devices to be authenticated and authorized before accessing network resources. The Zero Trust model includes several fundamental concepts that provide a comprehensive security solution. Adaptive identity recognizes that user identities are not static and that identity verification must be continuous and based on a user's current context and the resources they are attempting to access. Threat scope reduction means that access to network resources is granted on a need-to-know basis, and access is limited to only those resources required to complete a specific task. This concept reduces the network's attack surface and limits the damage a successful attack can cause. Policy-driven access control describes how access control policies are used to enforce access restrictions based on user identity, device posture, and network context. Device posture refers to the security status of a device, including its security configurations, software versions, and patch levels. In a security context, device posture assessment involves evaluating the security status of a device to determine whether it meets certain security requirements or poses a risk to the network. Control and Data Planes in Zero Trust Models In a Zero Trust architecture, the control and data planes are implemented separately and have different functions. Components in NIST's Zero Trust architecture framework Description The control plane manages policies that dictate how users and devices are authorized to access network resources. It is implemented through a centralized policy decision point. The policy decision point is responsible for defining policies that limit access to resources on a need-to-know basis, monitoring network activity for suspicious behavior, and updating policies to reflect changing network conditions and security threats. The policy decision point is comprised of two subsystems: The policy engine is configured with subject and host identities and credentials, access control policies, up-to-date threat intelligence, behavioral analytics, and other results of host and network security scanning and monitoring. This comprehensive state data allows it to define an algorithm and metrics for making dynamic authentication and authorization decisions on a per-request basis. The policy administrator is responsible for managing the process of issuing access tokens and establishing or tearing down sessions based on the decisions made by the policy engine. The policy administrator implements an interface between the control and the data plane. Where systems in the control plane define policies and make decisions, systems in the data plane establish sessions for secure information transfers. In the data plane, a subject (user or service) uses a system (such as a client host PC, laptop, or smartphone) to make requests for a given resource. A resource is typically an enterprise app running on a server or cloud. Each request is mediated by a policy enforcement point. The enforcement point might be implemented as a software agent running on the client host that communicates with an app gateway. The policy enforcement point interfaces with the policy administrator to set up a secure data pathway if access is approved or tear down a session if access is denied or revoked. The processes implementing the policy enforcement point are the only ones permitted to interface with the policy administrator. It is critical to establish a root of trust for these processes so that policy decisions cannot be tampered with. The data pathway established between the policy enforcement point and the resource is referred to as an implicit trust zone. For example, the outcome of a successful access request might be an IPsec tunnel established between a digitally signed agent process running on the client, a trusted web application gateway, and the resource server. Because the data is protected by IPsec transport encryption, no tampering by anyone with access to the underlying network infrastructure (switches, access points, routers, and firewalls) is possible. The goal of Zero Trust design is to make this implicit trust zone as small as possible and as transient as possible. Trusted sessions might only be established for individual transactions. This granular or microsegmented approach is in contrast with perimeter-based models, where trust is assumed once a user has authenticated and joined the network. In Zero Trust, place in the network is not a sufficient reason to trust a subject request. Similarly, even if a user is nominally authenticated, behavioral analytics might cause a request to be blocked or a session to be terminated. Separating the control and data plane is significant because it allows for a more flexible and scalable network architecture. The centralized control plane ensures consistency for access request handling across both the managed enterprise network and unmanaged internet or third-party networks, regardless of the devices being used or the user's location. This makes managing access control policies and monitoring network activity for suspicious behavior easier. Continuous monitoring via the independent control plane means that sessions can be terminated if anomalous behavior is detected.",
  "chunks": [
    {
      "chunk_id": "4.1.2_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Access control is a fundamental security mechanism that regulates who can access resources and what actions they can perform within a system or network. It encompasses authentication (verifying identity), authorization (granting permissions), and accounting (tracking user activities) to enforce the principle of least privilege. Effective access control implementation requires proper identity management, role-based permissions, and continuous monitoring to prevent unauthorized access and maintain system security.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.1.2",
        "title": "Access Control Facts",
        "content_type": "text",
        "filename": "4.1.2_Access_Control_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.1.2_Access_Control_Facts_[text].txt",
        "word_count": 2008,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.1.2_chunk_2",
      "content": "This lesson covers the following topics: Information security Cybersecurity framework Gap analysis Access control Zero Trust security concepts Control and data planes in Zero Trust models Information Security Information security (infosec) refers to the protection of data resources from unauthorized access, attack, theft, or damage. Data may be vulnerable because of the way it is stored, transferred, or processed. The systems used to store, transmit, and process data must demonstrate the properties of security. Secure information has three properties, often referred to as the CIA Triad : Confidentiality means that information can only be read by people who have been explicitly authorized to access it. Integrity means that the data is stored and transferred as intended and that any modification is authorized. Availability means that information is readily accessible to those authorized to view or modify it. The triad can also be referred to as \"AIC\" to avoid confusion with the Central Intelligence Agency. Some security models and researchers identify other properties of secure systems. The most important of these is non-repudiation.  Non-repudiation means that a person cannot deny doing something, such as creating, modifying, or sending a resource. For example, a legal document, such as a will, must usually be witnessed when it is signed. If there is a dispute about whether the document was correctly executed, the witness can provide evidence that it was. Cybersecurity Framework Within the goal of ensuring information security, cybersecurity refers specifically to provisioning secure processing hardware and software. Information security and cybersecurity tasks can be classified into five functions, following the framework developed by the National Institute of Standards and Technology (NIST) (nist.gov/cyberframework/online-learning/five-functions): Identify — develop security policies and capabilities. Evaluate risks, threats, and vulnerabilities and recommend security controls to mitigate them. Protect — procure/develop, install, operate, and decommission IT hardware and software assets with security as an embedded requirement of every stage of this operation's lifecycle. Detect — perform ongoing, proactive monitoring to ensure that controls are effective and capable of protecting against new types of threats. Respond — identify, analyze, contain, and eradicate threats to systems and data security. Recover — implement cybersecurity resilience to restore systems and data if other controls are unable to prevent attacks. Core cybersecurity tasks Description NIST's framework is just one example. There are many other cybersecurity frameworks (CSF). Gap Analysis Each security function is associated with a number of goals or outcomes. For example, one outcome of the Identify Function is an inventory of the assets owned and operated by the company. Outcomes are achieved by implementing one or more security controls. Numerous categories and types of security controls cover a huge range of functions. This makes the selection of appropriate and effective controls difficult. A cybersecurity framework guides the selection and configuration of controls. Frameworks are important because they save an organization from building its security program in a vacuum or building it on a foundation that fails to account for important security concepts. The use of a framework allows an organization to make an objective statement of its current cybersecurity capabilities, identify a target level of capability, and prioritize investments to achieve that target. This gives a structure to internal risk management procedures and provides an externally verifiable statement of regulatory compliance. Gap analysis is a process that identifies how an organization's security systems deviate from those required or recommended by a framework. This will be performed when first adopting a framework or when meeting a new industry or legal compliance requirement. The analysis might be repeated every few years to meet compliance requirements or to validate any changes that have been made to the framework. For each section of the framework, a gap analysis report will provide an overall score, a detailed list of missing or poorly configured controls associated with that section, and recommendations for remediation. Summary of gap analysis findings Description While some or all work involved in gap analysis could be performed by the internal security team, a gap analysis is likely to involve third-party consultants. Frameworks and compliance requirements from regulations and legislation can be complex enough to require a specialist. Advice and feedback from an external party can alert the internal security team to oversights, new trends, and changes in best practices. Access Control An access control system ensures that an information system meets the goals of the CIA triad. Access control governs how subjects/principals may interact with objects. Subjects are people, devices, software processes, or any other system that can request and be granted access to a resource. Objects are the resources. An object could be a network, server, database, app, or file. Subjects are assigned rights or permissions on resources. Modern access control is typically implemented as an identity and access management (IAM) system. IAM comprises four main processes: Identification — creating an account or ID that uniquely represents the user, device, or process on the network. Authentication — proving that a subject is who or what it claims to be when it attempts to access the resource. An authentication factor determines what sort of credential the subject can use. For example, people might be authenticated by providing a password; a computer system could be authenticated using a token such as a digital certificate. Authorization — determining what rights subjects should have on each resource and enforcing those rights. An authorization model determines how these rights are granted. For example, in a discretionary model, the object owner can allocate rights. In a mandatory model, rights are predetermined by system-enforced rules and cannot be changed by any user within the system. Accounting — tracking authorized usage of a resource or use of rights by a subject and alerting when unauthorized use is detected or attempted. Differences among identification, authentication, authorization, and accounting Images © 123RF.com Description The servers and protocols that implement these functions can also be referred to as authentication, authorization, and accounting (AAA). The use of IAM to describe enterprise security workflows is becoming more prevalent as the importance of the identification process is better acknowledged. For example, if you are setting up an e-commerce site and want to enroll users, you need to select the appropriate controls to perform each function: Identification — ensure that customers are legitimate. For example, you might need to ensure that billing and delivery addresses match and that they are not trying to use fraudulent payment methods. Authentication — ensure that customers have unique accounts and that only they can manage their orders and billing information. Authorization — rules to ensure customers can place orders only when they have valid payment mechanisms in place. You might operate loyalty schemes or promotions that authorize certain customers to view unique offers or content. Accounting — the system must record the actions a customer takes (to ensure that they cannot deny placing an order, for instance). Remember that these processes apply both to people and to systems. For example, you need to ensure that your e-commerce server can authenticate its identity when customers connect to it using a web browser. Zero Trust Security Concepts Zero Trust is a security model that assumes that all devices, users, and services are not inherently trusted, regardless of whether inside or outside a network's perimeter. Instead, the Zero Trust model requires all users and devices to be authenticated and authorized before accessing network resources. The Zero Trust model includes several fundamental concepts that provide a comprehensive security solution. Adaptive identity recognizes that user identities are not static and that identity verification must be continuous and based on a user's current context and the resources they are attempting to access. Threat scope reduction means that access to network resources is granted on a need-to-know basis, and access is limited to only those resources required to complete a specific task. This concept reduces the network's attack surface and limits the damage a successful attack can cause. Policy-driven access control describes how access control policies are used to enforce access restrictions based on user identity, device posture, and network context. Device posture refers to the security status of a device, including its security configurations, software versions, and patch levels. In a security context, device posture assessment involves evaluating the security status of a device to determine whether it meets certain security requirements or poses a risk to the network. Control and Data Planes in Zero Trust Models In a Zero Trust architecture, the control and data planes are implemented separately and have different functions. Components in NIST's Zero Trust architecture framework Description The control plane manages policies that dictate how users and devices are authorized to access network resources. It is implemented through a centralized policy decision point. The policy decision point is responsible for defining policies that limit access to resources on a need-to-know basis, monitoring network activity for suspicious behavior, and updating policies to reflect changing network conditions and security threats. The policy decision point is comprised of two subsystems: The policy engine is configured with subject and host identities and credentials, access control policies, up-to-date threat intelligence, behavioral analytics, and other results of host and network security scanning and monitoring. This comprehensive state data allows it to define an algorithm and metrics for making dynamic authentication and authorization decisions on a per-request basis. The policy administrator is responsible for managing the process of issuing access tokens and establishing or tearing down sessions based on the decisions made by the policy engine. The policy administrator implements an interface between the control and the data plane. Where systems in the control plane define policies and make decisions, systems in the data plane establish sessions for secure information transfers. In the data plane, a subject (user or service) uses a system (such as a client host PC, laptop, or smartphone) to make requests for a given resource. A resource is typically an enterprise app running on a server or cloud. Each request is mediated by a policy enforcement point. The enforcement point might be implemented as a software agent running on the client host that communicates with an app gateway. The policy enforcement point interfaces with the policy administrator to set up a secure data pathway if access is approved or tear down a session if access is denied or revoked. The processes implementing the policy enforcement point are the only ones permitted to interface with the policy administrator. It is critical to establish a root of trust for these processes so that policy decisions cannot be tampered with. The data pathway established between the policy enforcement point and the resource is referred to as an implicit trust zone. For example, the outcome of a successful access request might be an IPsec tunnel established between a digitally signed agent process running on the client, a trusted web application gateway, and the resource server. Because the data is protected by IPsec transport encryption, no tampering by anyone with access to the underlying network infrastructure (switches, access points, routers, and firewalls) is possible. The goal of Zero Trust design is to make this implicit trust zone as small as possible and as transient as possible. Trusted sessions might only be established for individual transactions. This granular or microsegmented approach is in contrast with perimeter-based models, where trust is assumed once a user has authenticated and joined the network. In Zero Trust, place in the network is not a sufficient reason to trust a subject request. Similarly, even if a user is nominally authenticated, behavioral analytics might cause a request to be blocked or a session to be terminated. Separating the control and data plane is significant because it allows for a more flexible and scalable network architecture. The centralized control plane ensures consistency for access request handling across both the managed enterprise network and unmanaged internet or third-party networks, regardless of the devices being used or the user's location. This makes managing access control policies and monitoring network activity for suspicious behavior easier. Continuous monitoring via the independent control plane means that sessions can be terminated if anomalous behavior is detected.",
      "summary": "This lesson covers fundamental information security concepts including the CIA Triad (Confidentiality, Integrity, Availability), the NIST Cybersecurity Framework's five functions (Identify, Protect, Detect, Respond, Recover), and Identity and Access Management (IAM) processes of identification, authentication, authorization, and accounting. Zero Trust security models require continuous verification of all users and devices through adaptive identity controls, threat scope reduction, and policy-driven access management implemented via separate control planes (policy decisions) and data planes (secure sessions). Gap analysis processes help organizations identify security control deficiencies against established frameworks and compliance requirements to prioritize remediation efforts.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.1.2",
        "title": "Access Control Facts",
        "content_type": "text",
        "filename": "4.1.2_Access_Control_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.1.2_Access_Control_Facts_[text].txt",
        "word_count": 2008,
        "has_content": true
      },
      "section_header": "4.1.2 Access Control Facts",
      "timestamp_range": null
    }
  ],
  "num_chunks": 2,
  "document_summary": "Access Control Facts (text): 0 This lesson covers the following topics: Information security Cybersecurity framework Gap analysis Access control Zero Trust security concepts Control and data planes in Zero Trust models Information Security Information security (infosec) refers to the protection of data resources from unauthorized access, attack, theft, or damage. Recover — implement cybersecurity resilience to restore systems and data if other controls are unable to prevent attacks. The policy decision point is comprised of two subsystems: The policy engine is configured with subject and host identities and credentials, access control policies, up-to-date threat intelligence, behavioral analytics, and other results of host and network security scanning and monitoring."
}