{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.2.8",
    "title": "Biometrics and Authentication Technologies Facts",
    "content_type": "text",
    "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
    "word_count": 1033,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Biometric authentication is based on a unique physical attribute or characteristic. This type of authentication requires capturing and storing a unique physical attribute with a biometric system. Biometric parameters Biometric authentication Common collection methods Biometric parameters For biometric authentication to be a viable security mechanism, it is important to consider the following parameters: Parameter\tDescription Universal\tDoes each person have the physical attribute being measured? Unique\tIs the physical attribute distinctive enough that it can be used to distinguish between individuals? Permanent\tHow well does the specified attribute hold up to aging? Collectible\tHow easy is it to acquire this measurable attribute? Circumvention\tCan the attribute be easily circumvented? Accuracy\tAre the results accurate? Accuracy is extremely critical in a biometric system. Biometric Authentication A sensor module acquires the biometric sample from the target. A feature extraction module creates a template. The template is a mathematical representation of the parts of the sample that uniquely identify the target. When the user wants to access a resource, they are re-scanned, and the scan is compared to the template. If they match to within a defined degree of tolerance, access is granted. Biometric authentication can be challenging to implement. The efficacy rate of biometric pattern acquisition and matching and suitability as an authentication mechanism can be evaluated using the following metrics and factors: False rejection rate (FRR) — is where a legitimate user is not recognized. This is also referred to as a Type I error or false non-match rate (FNMR). FRR is measured as a percentage. False acceptance rate (FAR) — is where an interloper is accepted (Type II error or false match rate [FMR]). FAR is measured as a percentage. False rejection causes inconvenience to users, but false acceptance can lead to security breaches, which is usually considered the most important metric. Crossover Error Rate (CER) — the point at which FRR and FAR meet. The lower the CER, the more efficient and reliable the technology. Errors are reduced over time by tuning the system. This is typically accomplished by adjusting the sensitivity of the system until CER is reached. Throughput (speed) — the time required to create a template for each user and the time required to authenticate. This is a major consideration for high-traffic access points, such as airports or railway stations. Failure to Enroll Rate (FER) — are incidents in which a template cannot be created and matched for a user during enrollment. Cost/Implementation — some scanner types are more expensive, whereas others are not easy to incorporate on mobile devices. Users can find it intrusive and threatening to privacy. The technology can be discriminatory or inaccessible to those with disabilities. Fingerprint recognition is the most widely implemented biometric authentication method. The technology required for scanning and recording fingerprints is relatively inexpensive, and the process is quite straightforward. A fingerprint sensor is usually implemented as a small capacitive cell or optical camera that can detect the unique pattern of ridges making up the pattern. The technology is also nonintrusive and relatively simple to use, although moisture or dirt can prevent readings. Configuring fingerprint recognition on an Android™ smartphone Android is a trademark of Google LLC Description Facial recognition records multiple indicators about the size and shape of the face, like the distance between the eyes or the width and length of the nose. The scan usually uses optical and infrared cameras or sensors to defeat spoofing attempts that substitute a photo for a real face. Common Collection Methods Method\tDescription Fingerprints\tFingerprints are made up of patterns of ridges and valleys. Fingerprint scanners analyze these patterns and convert them into a numerical format that can be stored for future comparison. Retina\tThe retina is the back portion of the eye sensitive to light. Numerous capillaries move blood to the retina, and these capillaries create a unique pattern. A retinal scanner shines infrared light into an eye and measures the amount of reflection. The vessels in the retina absorb infrared light so that the reflection pattern can be stored for future identification. Iris\tThe iris is the colorful portion of the eye around the pupil. Infrared light lights up the iris, and the scanner captures images of its unique patterns. Facial\tFacial scanning creates a map of 80 points on an individual’s face. The distances measured on this map can be used to identify the person in the future. Measurements could include the distance between the eyes, the nose's shape, the cheekbones' size, etc. Voice\tVoice recognition systems analyze a person’s voice for pitch, intensity, and cadence. These systems can be text-dependent or text-independent. Text-dependent authentication requires a specific phrase to be spoken. This could be a pre-determined phrase, or it could be randomly generated. Text-independent authentication uses any speech content. Vein Vein recognition scanners use infrared light to determine the vein pattern in your palm. Like a fingerprint, this pattern differs from person to person and does not change. The scanner converts the collected data into a code that is encrypted and assigned to you. The benefits of vein biometrics are: Veins are internal, so they cannot be altered or covered as easily as hands or a face could be. More data points can be collected because a palm is larger than an eye or a finger. This provides a higher rate of accuracy. Internal veins are harder to replicate and can only be captured in proximity. Gait Gait recognition analyzes the way that people walk. Each person has a unique way of walking. Several factors determine your gait, including: Height, weight, and body. Age. Health (diseases or disorders). Personality and emotions. Stride. Step. Speed. Hip and foot angle. Cadence. Data is gathered using sensors, cameras, or wearable devices. The gait recognition system creates a digital signature that can be stored or compared to existing data. As with most biometric systems, gait recognition systems are still relatively new and should not be used as a stand-alone identification method.",
  "chunks": [
    {
      "chunk_id": "4.2.8_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.2.8_chunk_2",
      "content": "Biometric authentication is based on a unique physical attribute or characteristic. This type of authentication requires capturing and storing a unique physical attribute with a biometric system.",
      "summary": "Biometric authentication is based on a unique physical attribute or characteristic. This type of authentication requires capturing and storing a unique physical attribute with a biometric system.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "4.2.8 Biometrics and Authentication Technologies Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.2.8_chunk_3",
      "content": "Biometric parameters Biometric authentication Common collection methods Biometric parameters For biometric authentication to be a viable security mechanism, it is important to consider the following parameters: Parameter\tDescription Universal\tDoes each person have the physical attribute being measured? Unique\tIs the physical attribute distinctive enough that it can be used to distinguish between individuals? Permanent\tHow well does the specified attribute hold up to aging? Collectible\tHow easy is it to acquire this measurable attribute? Circumvention\tCan the attribute be easily circumvented? Accuracy\tAre the results accurate? Accuracy is extremely critical in a biometric system. Biometric Authentication",
      "summary": "This lesson covers the following topics:: Biometric parameters Biometric authentication Common collection methods Biometric parameters For biometric authentication to be a viable security mechanism, it is important to consider the following parameters: Parameter\tDescription Universal\tDoes each person have the physical attribute being measured. Unique\tIs the physical attribute distinctive enough that it can be used to distinguish between individuals.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.2.8_chunk_4",
      "content": "A sensor module acquires the biometric sample from the target. A feature extraction module creates a template. The template is a mathematical representation of the parts of the sample that uniquely identify the target. When the user wants to access a resource, they are re-scanned, and the scan is compared to the template. If they match to within a defined degree of tolerance, access is granted. Biometric authentication can be challenging to implement. The efficacy rate of biometric pattern acquisition and matching and suitability as an authentication mechanism can be evaluated using the following metrics and factors: False rejection rate (FRR) — is where a legitimate user is not recognized. This is also referred to as a Type I error or false non-match rate (FNMR). FRR is measured as a percentage. False acceptance rate (FAR) — is where an interloper is accepted (Type II error or false match rate [FMR]). FAR is measured as a percentage. False rejection causes inconvenience to users, but false acceptance can lead to security breaches, which is usually considered the most important metric. Crossover Error Rate (CER) — the point at which FRR and FAR meet. The lower the CER, the more efficient and reliable the technology. Errors are reduced over time by tuning the system. This is typically accomplished by adjusting the sensitivity of the system until CER is reached. Throughput (speed) — the time required to create a template for each user and the time required to authenticate. This is a major consideration for high-traffic access points, such as airports or railway stations. Failure to Enroll Rate (FER) — are incidents in which a template cannot be created and matched for a user during enrollment. Cost/Implementation — some scanner types are more expensive, whereas others are not easy to incorporate on mobile devices. Users can find it intrusive and threatening to privacy. The technology can be discriminatory or inaccessible to those with disabilities. Fingerprint recognition is the most widely implemented biometric authentication method. The technology required for scanning and recording fingerprints is relatively inexpensive, and the process is quite straightforward. A fingerprint sensor is usually implemented as a small capacitive cell or optical camera that can detect the unique pattern of ridges making up the pattern. The technology is also nonintrusive and relatively simple to use, although moisture or dirt can prevent readings. Configuring fingerprint recognition on an Android™ smartphone Android is a trademark of Google LLC Description Facial recognition records multiple indicators about the size and shape of the face, like the distance between the eyes or the width and length of the nose. The scan usually uses optical and infrared cameras or sensors to defeat spoofing attempts that substitute a photo for a real face. Common Collection Methods",
      "summary": "The first step in setting up biometric authentication is enrollment:: When the user wants to access a resource, they are re-scanned, and the scan is compared to the template. False rejection causes inconvenience to users, but false acceptance can lead to security breaches, which is usually considered the most important metric.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "The first step in setting up biometric authentication is enrollment:",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.2.8_chunk_5",
      "content": "Method\tDescription Fingerprints\tFingerprints are made up of patterns of ridges and valleys. Fingerprint scanners analyze these patterns and convert them into a numerical format that can be stored for future comparison. Retina\tThe retina is the back portion of the eye sensitive to light. Numerous capillaries move blood to the retina, and these capillaries create a unique pattern. A retinal scanner shines infrared light into an eye and measures the amount of reflection. The vessels in the retina absorb infrared light so that the reflection pattern can be stored for future identification. Iris\tThe iris is the colorful portion of the eye around the pupil. Infrared light lights up the iris, and the scanner captures images of its unique patterns. Facial\tFacial scanning creates a map of 80 points on an individual’s face. The distances measured on this map can be used to identify the person in the future. Measurements could include the distance between the eyes, the nose's shape, the cheekbones' size, etc. Voice\tVoice recognition systems analyze a person’s voice for pitch, intensity, and cadence. These systems can be text-dependent or text-independent. Text-dependent authentication requires a specific phrase to be spoken. This could be a pre-determined phrase, or it could be randomly generated. Text-independent authentication uses any speech content. Vein Vein recognition scanners use infrared light to determine the vein pattern in your palm. Like a fingerprint, this pattern differs from person to person and does not change. The scanner converts the collected data into a code that is encrypted and assigned to you. The benefits of vein biometrics are: Veins are internal, so they cannot be altered or covered as easily as hands or a face could be. More data points can be collected because a palm is larger than an eye or a finger. This provides a higher rate of accuracy. Internal veins are harder to replicate and can only be captured in proximity. Gait Gait recognition analyzes the way that people walk. Each person has a unique way of walking. Several factors determine your gait, including: Height, weight, and body. Age. Health (diseases or disorders). Personality and emotions.",
      "summary": "Biometric information can be collected for each of the following:: The scanner converts the collected data into a code that is encrypted and assigned to you. More data points can be collected because a palm is larger than an eye or a finger.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "Biometric information can be collected for each of the following:",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.2.8_chunk_6",
      "content": "Stride. Step. Speed. Hip and foot angle. Cadence. Data is gathered using sensors, cameras, or wearable devices. The gait recognition system creates a digital signature that can be stored or compared to existing data. As with most biometric systems, gait recognition systems are still relatively new and should not be used as a stand-alone identification method.",
      "summary": "When analyzing gait, the following are measured:: Data is gathered using sensors, cameras, or wearable devices. The gait recognition system creates a digital signature that can be stored or compared to existing data.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.8",
        "title": "Biometrics and Authentication Technologies Facts",
        "content_type": "text",
        "filename": "4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.8_Biometrics_and_Authentication_Technologies_Facts_[text].txt",
        "word_count": 1033,
        "has_content": true
      },
      "section_header": "When analyzing gait, the following are measured:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 6,
  "document_summary": "Biometrics and Authentication Technologies Facts (text): 0 Biometric authentication is based on a unique physical attribute or characteristic. This type of authentication requires capturing and storing a unique physical attribute with a biometric system. False rejection causes inconvenience to users, but false acceptance can lead to security breaches, which is usually considered the most important metric."
}