{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.4.4",
    "title": "Active Directory Facts",
    "content_type": "text",
    "filename": "4.4.4_Active_Directory_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.4_Active_Directory_Facts_[text].txt",
    "word_count": 790,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Directory services Active Directory Active Directory components Directory Services A directory service stores information about users, computers, security groups/roles, and services. Each object in the directory has a number of attributes. The directory schema describes the types of attributes, what information they contain, and whether they are required or optional. In order for products from different vendors to be interoperable, most directory services are based on the Lightweight Directory Access Protocol (LDAP), which was developed from a standard called X.500. Within an X.500-like directory, a distinguished name (DN) is a collection of attributes that define a unique identifier for any given resource. A distinguished name is made up of attribute-value pairs separated by commas. The most specific attribute is listed first, and successive attributes become progressively broader. This most specific attribute is the relative distinguished name, as it uniquely identifies the object within the context of successive (parent) attribute values. A network directory lists the subjects (principally users, computers, and services), objects (such as directories and files) available on the network, and the permissions that subjects have over objects. A directory facilitates authentication and authorization, and it is critical that it be maintained as a highly secure service. Active Directory Active Directory is Microsoft's proprietary directory service. It is a centralized database that contains user accounts and security information. In a workgroup, security and management are decentralized. They occur on each computer, containing information about users and resources. With Active Directory, all computers share the same central database on a remote computer called a domain controller. Active Directory is a hierarchical database. Hierarchical directory databases have the following advantages over a flat-file database structure: Advantage Description Organization\tHierarchical databases let you sort and organize user accounts by location, function, and department. Replication\tThe Active Directory database can be replicated to other systems. This eliminates the need to manually recreate user accounts on every system a user may need to access. Delegation\tDelegation allows you to assign users to manage portions of the Active Directory database without giving all users rights to the entire database. For example, you can assign an administrator to manage the sales department in North America and enable this administrator to create user accounts, remove user accounts, and change passwords. However, this sales administrator won't be allowed to access the accounting or development departments. As another example, you can enable an administrator to manage all departments in Europe but none in North America or Asia. Scalability\tA hierarchical database lets you grow the Active Directory to meet the needs of your environment. Active Directory Components Active Directory organizes network resources and simplifies management using the following components: Component\tDescription Domain\tA domain is an administratively defined collection of network resources that share a common directory database and security policies. The domain is the basic administrative unit of an Active Directory structure. Depending on the network structure and requirements, the entire network might be represented by a single domain with millions of objects, or the network might require multiple domains. Trees and forests A tree is a group of related domains that share the same contiguous DNS namespaces. A forest is the highest level of the organization hierarchy and is a collection of related domain trees. The forest establishes the relationship between trees that have different DNS namespaces. Organizational unit (OU) An organizational unit is like a folder subdividing and organizing network resources within a domain. An organizational unit: Is a container object. Can hold other organizational units. Can hold objects such as users and computers. Can be used logically to organize network resources. Simplifies security administration. Generic container Like OUs, generic containers organize Active Directory objects. Generic container objects: Are created by default. Cannot be moved, renamed, or deleted. Have very few properties you can edit. Object Within Active Directory, each resource is identified as an object. Common objects include: Users. Groups. Computers. Shared folders. Each object contains additional information about the shared resource that can be used for locating and securing resources. Groups are composed of other directory objects with a common access level. The schema identifies the object classes (the type of objects) in the tree and the attributes (properties) of the objects. In Active Directory, each user is assigned a Security Account Manager (SAM) account name; therefore, each username must be unique. Domain controller\tA domain controller is a server that holds a copy of the Active Directory database that can be written to. Replication is copying changes to Active Directory between the domain controllers. In contrast, member servers are servers in the domain that do not have the Active Directory database.",
  "chunks": [
    {
      "chunk_id": "4.4.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.4",
        "title": "Active Directory Facts",
        "content_type": "text",
        "filename": "4.4.4_Active_Directory_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.4_Active_Directory_Facts_[text].txt",
        "word_count": 790,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.4.4_chunk_2",
      "content": "This lesson covers the following topics: Directory services Active Directory Active Directory components Directory Services A directory service stores information about users, computers, security groups/roles, and services. Each object in the directory has a number of attributes. The directory schema describes the types of attributes, what information they contain, and whether they are required or optional. In order for products from different vendors to be interoperable, most directory services are based on the Lightweight Directory Access Protocol (LDAP), which was developed from a standard called X.500. Within an X.500-like directory, a distinguished name (DN) is a collection of attributes that define a unique identifier for any given resource. A distinguished name is made up of attribute-value pairs separated by commas. The most specific attribute is listed first, and successive attributes become progressively broader. This most specific attribute is the relative distinguished name, as it uniquely identifies the object within the context of successive (parent) attribute values. A network directory lists the subjects (principally users, computers, and services), objects (such as directories and files) available on the network, and the permissions that subjects have over objects. A directory facilitates authentication and authorization, and it is critical that it be maintained as a highly secure service. Active Directory Active Directory is Microsoft's proprietary directory service. It is a centralized database that contains user accounts and security information. In a workgroup, security and management are decentralized. They occur on each computer, containing information about users and resources. With Active Directory, all computers share the same central database on a remote computer called a domain controller. Active Directory is a hierarchical database. Hierarchical directory databases have the following advantages over a flat-file database structure: Advantage Description Organization\tHierarchical databases let you sort and organize user accounts by location, function, and department. Replication\tThe Active Directory database can be replicated to other systems. This eliminates the need to manually recreate user accounts on every system a user may need to access. Delegation\tDelegation allows you to assign users to manage portions of the Active Directory database without giving all users rights to the entire database. For example, you can assign an administrator to manage the sales department in North America and enable this administrator to create user accounts, remove user accounts, and change passwords. However, this sales administrator won't be allowed to access the accounting or development departments. As another example, you can enable an administrator to manage all departments in Europe but none in North America or Asia. Scalability\tA hierarchical database lets you grow the Active Directory to meet the needs of your environment. Active Directory Components Active Directory organizes network resources and simplifies management using the following components: Component\tDescription Domain\tA domain is an administratively defined collection of network resources that share a common directory database and security policies. The domain is the basic administrative unit of an Active Directory structure. Depending on the network structure and requirements, the entire network might be represented by a single domain with millions of objects, or the network might require multiple domains. Trees and forests",
      "summary": "4.4.4 Active Directory Facts: A directory facilitates authentication and authorization, and it is critical that it be maintained as a highly secure service. Active Directory Components Active Directory organizes network resources and simplifies management using the following components: Component\tDescription Domain\tA domain is an administratively defined collection of network resources that share a common directory database and security policies.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.4",
        "title": "Active Directory Facts",
        "content_type": "text",
        "filename": "4.4.4_Active_Directory_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.4_Active_Directory_Facts_[text].txt",
        "word_count": 790,
        "has_content": true
      },
      "section_header": "4.4.4 Active Directory Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.4.4_chunk_3",
      "content": "A tree is a group of related domains that share the same contiguous DNS namespaces. A forest is the highest level of the organization hierarchy and is a collection of related domain trees. The forest establishes the relationship between trees that have different DNS namespaces. Organizational unit (OU) An organizational unit is like a folder subdividing and organizing network resources within a domain. An organizational unit: Is a container object. Can hold other organizational units. Can hold objects such as users and computers. Can be used logically to organize network resources. Simplifies security administration. Generic container Like OUs, generic containers organize Active Directory objects. Generic container objects: Are created by default. Cannot be moved, renamed, or deleted. Have very few properties you can edit. Object Within Active Directory, each resource is identified as an object. Common objects include: Users. Groups. Computers. Shared folders. Each object contains additional information about the shared resource that can be used for locating and securing resources. Groups are composed of other directory objects with a common access level. The schema identifies the object classes (the type of objects) in the tree and the attributes (properties) of the objects. In Active Directory, each user is assigned a Security Account Manager (SAM) account name; therefore, each username must be unique. Domain controller\tA domain controller is a server that holds a copy of the Active Directory database that can be written to. Replication is copying changes to Active Directory between the domain controllers. In contrast, member servers are servers in the domain that do not have the Active Directory database.",
      "summary": "Multiple domains are grouped together in the following relationship:: Organizational unit (OU) An organizational unit is like a folder subdividing and organizing network resources within a domain. Domain controller\tA domain controller is a server that holds a copy of the Active Directory database that can be written to.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.4",
        "title": "Active Directory Facts",
        "content_type": "text",
        "filename": "4.4.4_Active_Directory_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.4_Active_Directory_Facts_[text].txt",
        "word_count": 790,
        "has_content": true
      },
      "section_header": "Multiple domains are grouped together in the following relationship:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 3,
  "document_summary": "Active Directory Facts (text): A directory facilitates authentication and authorization, and it is critical that it be maintained as a highly secure service. It is a centralized database that contains user accounts and security information. Active Directory Components Active Directory organizes network resources and simplifies management using the following components: Component\tDescription Domain\tA domain is an administratively defined collection of network resources that share a common directory database and security policies."
}