{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.6.13",
    "title": "Linux User Security and Restriction Facts",
    "content_type": "text",
    "filename": "4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
    "word_count": 304,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: User security User security commands User Security Users should be trained to use secure passwords. Secure passwords use numbers and letters and are more than seven characters in length. Passwords should expire periodically but not too often. Administrators can limit the resources that the user can access. User Security Commands The following table describes Linux commands used to promote user security and restrictions: Command Description chage -M sets the maximum number of days before the password expires. -W sets the number of days before the password expires that a warning message displays. -m sets the minimum number of days that must pass after a password has been changed before a user can change the password again. ulimit Limits computer resources used for applications launched from the shell. Limits can be hard or soft limits. Soft limits can be temporarily exceeded up to the hard limit setting. Users can modify soft limits, but only the root user can modify hard limits. Options include: -c limits the size of a core dump file. The value is in blocks. -f limits the file size of files created using the shell session. The value is in blocks. -n limits the maximum number of files that can be open. -t limits the amount of CPU time a process can use. This is set in seconds. -u limits the number of concurrent processes a user can run. -d limits the maximum amount of memory a process can use. The value is in kilobytes. -H sets a hard resource limit. -S sets a soft resource limit. -a displays current limits. The default shows soft limits.",
  "chunks": [
    {
      "chunk_id": "4.6.13_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.6.13",
        "title": "Linux User Security and Restriction Facts",
        "content_type": "text",
        "filename": "4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "word_count": 304,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.6.13_chunk_2",
      "content": "This lesson covers the following topics: User security User security commands User Security",
      "summary": "This lesson covers the following topics: User security User security commands User Security",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.6.13",
        "title": "Linux User Security and Restriction Facts",
        "content_type": "text",
        "filename": "4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "word_count": 304,
        "has_content": true
      },
      "section_header": "4.6.13 Linux User Security and Restriction Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.6.13_chunk_3",
      "content": "Users should be trained to use secure passwords. Secure passwords use numbers and letters and are more than seven characters in length. Passwords should expire periodically but not too often. Administrators can limit the resources that the user can access. User Security Commands The following table describes Linux commands used to promote user security and restrictions: Command Description chage",
      "summary": "When considering user security, keep the following in mind:: Administrators can limit the resources that the user can access. User Security Commands The following table describes Linux commands used to promote user security and restrictions: Command Description chage.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.6.13",
        "title": "Linux User Security and Restriction Facts",
        "content_type": "text",
        "filename": "4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "word_count": 304,
        "has_content": true
      },
      "section_header": "When considering user security, keep the following in mind:",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.6.13_chunk_4",
      "content": "-M sets the maximum number of days before the password expires. -W sets the number of days before the password expires that a warning message displays. -m sets the minimum number of days that must pass after a password has been changed before a user can change the password again. ulimit Limits computer resources used for applications launched from the shell. Limits can be hard or soft limits. Soft limits can be temporarily exceeded up to the hard limit setting. Users can modify soft limits, but only the root user can modify hard limits. Options include: -c limits the size of a core dump file. The value is in blocks. -f limits the file size of files created using the shell session. The value is in blocks. -n limits the maximum number of files that can be open. -t limits the amount of CPU time a process can use. This is set in seconds. -u limits the number of concurrent processes a user can run. -d limits the maximum amount of memory a process can use. The value is in kilobytes. -H sets a hard resource limit. -S sets a soft resource limit. -a displays current limits. The default shows soft limits.",
      "summary": "Set user passwords to expire. Be aware of the following options:: -M sets the maximum number of days before the password expires. -W sets the number of days before the password expires that a warning message displays.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.6.13",
        "title": "Linux User Security and Restriction Facts",
        "content_type": "text",
        "filename": "4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.6.13_Linux_User_Security_and_Restriction_Facts_[text].txt",
        "word_count": 304,
        "has_content": true
      },
      "section_header": "Set user passwords to expire. Be aware of the following options:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 4,
  "document_summary": "Linux User Security and Restriction Facts (text): 0 This lesson covers the following topics: User security User security commands User Security Users should be trained to use secure passwords. Administrators can limit the resources that the user can access. User Security Commands The following table describes Linux commands used to promote user security and restrictions: Command Description chage -M sets the maximum number of days before the password expires."
}