{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.1.7",
    "title": "Use Windows Sandbox",
    "content_type": "video",
    "filename": "10.1.7_Use_Windows_Sandbox_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.1.7_Use_Windows_Sandbox_[video].txt",
    "word_count": 639,
    "has_content": true
  },
  "full_content": "Transcript close interactive script As an IT administrator, you'll often be asked to install new software on the Windows systems running in your office. Before installing any new software you're unfamiliar with, it's always important to first test the software to see how it will function. This can be done using Hyper -V virtual machines, but that requires the extra steps of installing the operating system and getting things ready. It also requires additional space on your disk to store the virtual machine. To make testing software easier, Microsoft offers a lightweight desktop environment known as Windows Sandbox, where you can safely run applications in an isolated environment. The beauty of using Windows Sandbox is that once Windows Sandbox is closed, all the software and files that were added when the application was installed are deleted. This means you get a brand-new instance of the sandbox every time you open the application. To use Windows Sandbox, you must add this feature to your system. To do this, first, open the Settings app. Next, select Apps. Now, from the right, select Optional features. From this page, scroll down and select More Windows features. It's from here that you can add or remove features. From this dialog, scroll down and select Windows Sandbox and click OK. If the Windows Sandbox option is unavailable, your computer doesn't meet the requirements to run Windows Sandbox. As you can see, after the feature has been installed, you'll be required to restart your system, so I'll click Restart now. With the computer restarted, you can now use Windows Sandbox to install and test a new application. To do this, let's click on Start and select All apps. I'll then go down and run Windows Sandbox. Notice that the Windows Sandbox window is opened, which looks like another Windows machine. For this demo, I'm going to install the Audacity program. To save time, I've already downloaded the install file for this program and saved it to my Downloads folder on the host computer. Let's copy and paste this to the desktop of our sandbox. Now, let's maximize the sandbox window for easier viewing. From this point, you simply install the application as you would in a normal Windows environment. So, let's double-click on the install file and follow the remaining prompts to install Audacity. Once the application has been installed, I can test it to verify it didn't have any ill effects on my system and functioned the way I wanted it to. When you're done testing your application, all you need to do is close Windows Sandbox. Notice that when you do, you're warned that all your changes will be permanently lost. That's fine, so I'll click OK. Just to verify that everything was deleted, let's open Windows Sandbox again. This time let's use the Search feature to find and open this tool. Notice that the installation file for Audacity is gone, as well as the shortcut to run the program. And when I access All apps, you can see that Audacity isn't available. That's it for this demonstration. In this demo, we showed you how to install the Windows Sandbox feature. We then showed you how to use Windows Sandbox to install and test applications.",
  "chunks": [
    {
      "chunk_id": "10.1.7_chunk_1",
      "content": "As an IT administrator, you'll often be asked to install new software on the Windows systems running in your office. Before installing any new software you're unfamiliar with, it's always important to first test the software to see how it will function. This can be done using Hyper -V virtual machines, but that requires the extra steps of installing the operating system and getting things ready. It also requires additional space on your disk to store the virtual machine. To make testing software easier, Microsoft offers a lightweight desktop environment known as Windows Sandbox, where you can safely run applications in an isolated environment. The beauty of using Windows Sandbox is that once Windows Sandbox is closed, all the software and files that were added when the application was installed are deleted. This means you get a brand-new instance of the sandbox every time you open the application.",
      "summary": "Windows Sandbox is a lightweight, isolated desktop environment provided by Microsoft that allows IT administrators to safely test unfamiliar software without the overhead of setting up a full virtual machine. It automatically deletes all files and applications upon closing, ensuring a clean slate for each session. This practical tool enhances security by minimizing the risk of malware or system conflicts during software installation.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.1.7",
        "title": "Use Windows Sandbox",
        "content_type": "video",
        "filename": "10.1.7_Use_Windows_Sandbox_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.1.7_Use_Windows_Sandbox_[video].txt",
        "word_count": 639,
        "has_content": true
      },
      "section_header": "Use Windows Sandbox",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.1.7_chunk_2",
      "content": "To use Windows Sandbox, you must add this feature to your system. To do this, first, open the Settings app. Next, select Apps. Now, from the right, select Optional features. From this page, scroll down and select More Windows features. It's from here that you can add or remove features. From this dialog, scroll down and select Windows Sandbox and click OK. If the Windows Sandbox option is unavailable, your computer doesn't meet the requirements to run Windows Sandbox. As you can see, after the feature has been installed, you'll be required to restart your system, so I'll click Restart now.",
      "summary": "To install Windows Sandbox, navigate to the Settings app, select Apps, and then access Optional features to add Windows Sandbox from the More Windows features section. If the option is unavailable, it indicates that your system does not meet the necessary requirements. After installation, a system restart is required to complete the setup.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.1.7",
        "title": "Use Windows Sandbox",
        "content_type": "video",
        "filename": "10.1.7_Use_Windows_Sandbox_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.1.7_Use_Windows_Sandbox_[video].txt",
        "word_count": 639,
        "has_content": true
      },
      "section_header": "Windows Sandbox Installation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.1.7_chunk_3",
      "content": "With the computer restarted, you can now use Windows Sandbox to install and test a new application. To do this, let's click on Start and select All apps. I'll then go down and run Windows Sandbox. Notice that the Windows Sandbox window is opened, which looks like another Windows machine. For this demo, I'm going to install the Audacity program. To save time, I've already downloaded the install file for this program and saved it to my Downloads folder on the host computer. Let's copy and paste this to the desktop of our sandbox. Now, let's maximize the sandbox window for easier viewing. From this point, you simply install the application as you would in a normal Windows environment. So, let's double-click on the install file and follow the remaining prompts to install Audacity. Once the application has been installed, I can test it to verify it didn't have any ill effects on my system and functioned the way I wanted it to. When you're done testing your application, all you need to do is close Windows Sandbox. Notice that when you do, you're warned that all your changes will be permanently lost. That's fine, so I'll click OK. Just to verify that everything was deleted, let's open Windows Sandbox again. This time let's use the Search feature to find and open this tool. Notice that the installation file for Audacity is gone, as well as the shortcut to run the program. And when I access All apps, you can see that Audacity isn't available.",
      "summary": "The Windows Sandbox feature allows users to safely install and test applications in an isolated environment without affecting the host system. In this demonstration, the user installs Audacity within the sandbox, verifying its functionality and ensuring no adverse effects on the main system. Upon closing the sandbox, all changes, including the installed application, are permanently discarded, highlighting the tool's utility for secure testing of software.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.1.7",
        "title": "Use Windows Sandbox",
        "content_type": "video",
        "filename": "10.1.7_Use_Windows_Sandbox_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.1.7_Use_Windows_Sandbox_[video].txt",
        "word_count": 639,
        "has_content": true
      },
      "section_header": "Run Windows Sandbox",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.1.7_chunk_4",
      "content": "That's it for this demonstration. In this demo, we showed you how to install the Windows Sandbox feature. We then showed you how to use Windows Sandbox to install and test applications.",
      "summary": "The demonstration covered the installation and utilization of the Windows Sandbox feature, which allows users to create a secure environment for testing applications. This practical application enhances security by isolating potentially harmful software, ensuring that it does not affect the main operating system. Overall, it emphasizes the importance of safe application testing in cybersecurity practices.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.1.7",
        "title": "Use Windows Sandbox",
        "content_type": "video",
        "filename": "10.1.7_Use_Windows_Sandbox_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.1.7_Use_Windows_Sandbox_[video].txt",
        "word_count": 639,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 4
}