{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.4.1",
    "title": "Cloud Services Introduction",
    "content_type": "video",
    "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
    "word_count": 1806,
    "has_content": true
  },
  "full_content": "Transcript close interactive script More and more networks are shifting to a decentralized resource approach by utilizing various cloud services. Because of this, it's important that you have a solid understanding of cloud concepts and how cloud services impact a network. Chances are you've heard about the cloud. It's used in almost every conversation about networking or the internet. But what exactly is the cloud? Well, it's actually a lot of different things and a lot of them have been around for a while. Let's say we have an enterprise network here. And within this network, we have several switches, routers, some servers, workstations, and a connection to the internet. Traditionally, each of these workstations would have all the necessary applications and hardware components in order to carry out daily tasks, and these servers would each have a single OS installed and provide a specific function, such as a file server or DHCP server. However, the cloud changes how a traditional network model works. For example, let's say these workstations need to perform a lot of calculations. In a traditional networking model, each of these workstations would need the necessary software and hardware to match to carry out these tasks. That can get expensive. What the cloud does is outsource these tasks to other machines, which are either located on the same network or provided by a third party via the Internet. In essence, the cloud is computing resources that are offered or delivered as a service over a network. These computing resources include performing calculations or computations, the ability to store data, or the ability to network resources together. The cloud name itself comes from the cloud-shaped symbol used to denote a complex infrastructure in system and network diagrams. In order for a service to be considered a true cloud service, it needs to have five characteristics, which have been determined by the National Institute of Standards and Technology. First, it needs to be an on-demand self-service, meaning users must be able to dynamically obtain resources. Second, it needs to be provided over a network, typically the Internet, and be available on multiple platforms, such as mobile phones, tablets, laptops, and workstations. This is called broad network access. Third, it needs to have resource pooling. This means multiple users can use the same resources. These resources can be physical or virtual, but they need to be able to scale dynamically according to demand. For example, if a server suddenly gets a thousand connections, it needs the ability to provision additional computing power or offload clients to different VMs or servers. Fourth, the service needs to have rapid elasticity. This means the services can seamlessly provision resources and scale resource usage back depending on demand. And finally, the fifth characteristic is what's known as a measured service--that is, resources can be controlled and optimized automatically. In addition, this also means that the service provider can collect information about the service. Now, cloud services can be categorized based on the way they are deployed, and there are a few different cloud deployment models you should know about. The first is a public cloud. A public cloud is made available to the public by a service provider. These services are sometimes free, but often use a pay-as-you-go model. With a private cloud, the service consists of an infrastructure provisioned and operated solely for a single organization. Private clouds are typically hosted at the organization. However, there are some private cloud providers that provide remote hosting. Sometimes several organizations share infrastructure for a specific community with common concerns. This is called a community cloud. And the final cloud deployment model is a hybrid cloud. Hybrid clouds are becoming increasingly common. Hybrid clouds are a combination of private, community, or public clouds for different aspects of the services that are provided. For instance, a hybrid cloud service can provide special load balancing between different cloud types if there is a spike in resource usage. Hybrid clouds also use both on-site and off-site resource hosting. Now that you have an understanding of some of the basic concepts of the cloud service model, let's take a look at the different types of cloud services that are available to organizations. The first cloud service we'll look at is called Infrastructure as a Service (IaaS). I want to point out that all cloud services end with as a service. This is a quick way for you to identify a cloud service. They almost all use this initialism model, too. Now, Infrastructure as a Service provides an organization with infrastructure components that is, computer hardware components as a service. And these hardware components can be anything from networking devices to storage and data processing resources. For example, instead of having to install multiple file servers with redundant hard drives in your server room, you can pay a company for storage space on their servers. This eliminates the need to maintain and secure local file servers. And let's say you need to process large amounts of data or compile and test applications. Instead of needing the hardware infrastructure on site, you can outsource this to an IaaS company, such as AWS. Another nice thing about IaaS is that it can scale as needed. For example, let's say you need to add more computing resources. Without IaaS, you would have to go out and buy all that hardware, set it up, configure it, et cetera. However, if you are using IaaS, you just tell the cloud company that you need more resources, and they are immediately provided. One thing to know about using IaaS is that it only provides the hardware resources. It's still your job to handle all the configuration and setup and interface with the cloud infrastructure. The next cloud service is Platform as a Service (PaaS). Platform as a Service provides all the underlying resources that IaaS provides; however, it goes a step further. In addition to the hardware resources, PaaS also provides the configuration, setup, and management of the cloud platform. For example, it handles installing operating systems, connecting virtual networks, and creating an entire environment that is ready for you to use immediately. One common example of PaaS is for software developers. A lot of companies that offer PaaS have packages that are specifically designed for developing, testing, and deploying software programs. Some PaaS cloud service providers also provide additional features, such software design systems, software development resources, testing, and deployment resources. Like IaaS, PaaS provides scalability and flexibility; it can grow or shrink with your organization's needs. Next is Software as a Service (SaaS). Software as a Service is designed for your average end user. It provides end users with the applications that they need to perform their day-to-day work. Instead of installing the applications locally, they use a web browser to access programs. Some SaaS providers charge a monthly or annual fee. But often, with SaaS, you pay for only the applications that you need. For example, if a user needs a word processing application for nine hours a day, that is how much you pay for. If another user needs the same application for only three hours a month, you pay much less. SaaS also allows you to try new software before committing to it. You can try it out, paying only for the time you use it. If you really like it, you can pay for more use. If you don't like it, you can look for something else without losing much money. SaaS comes in two forms, simple multi-tenancy and fine-grained multi-tenancy. With simple multi-tenancy, each cloud service customer has their own dedicated resources segregated from other customers' resources. Fine-grained multi-tenancy offers the same level of segregation as simple multi-tenancy, but all of the resources used by all customers are pooled together and shared. Your data is segregated, so other customers can't access it. However, your computing resources, applications, and other cloud resources are shared with other customers. The last cloud service model we'll look at is Security as a Service (SECaaS). Now, you might be thinking, wait a second, I'm a security professional--why would I want to outsource my security services to the cloud? This isn't what SECaaS does. In one way, SECaaS is similar to SaaS it provides a subscription model for applications and software. However, instead of being used for productivity on workstations, the applications and software are specific to organizational security. For example, you might subscribe to a SECaaS system that provides a high-level anti-virus detection service that includes continuous anti-virus updates. Other services provided by SECaaS include DDoS protection, intrusion detection, and authentication services. One of the most common SECaaS providers is CloudFlare. SECaaS can sometimes be much more cost effective for an organization than having to purchase all the necessary hardware equipment and personnel to properly protect a network from viruses, malware, and instruction. However, it is still a necessity to have an on-site security professional. The cloud is an extremely useful service that more and more organizations implement. Because of this, it's important that you understand the underlying structure of the cloud and what it means to your organization's systems and infrastructure. In addition, by better understanding the cloud deployment models, you can better protect your organization.",
  "chunks": [
    {
      "chunk_id": "10.4.1_chunk_1",
      "content": "More and more networks are shifting to a decentralized resource approach by utilizing various cloud services. Because of this, it's important that you have a solid understanding of cloud concepts and how cloud services impact a network. Chances are you've heard about the cloud. It's used in almost every conversation about networking or the internet. But what exactly is the cloud? Well, it's actually a lot of different things and a lot of them have been around for a while. Let's say we have an enterprise network here. And within this network, we have several switches, routers, some servers, workstations, and a connection to the internet.",
      "summary": "The Cloud Services Introduction section emphasizes the growing trend of decentralized resource management through various cloud services and their significant impact on network architecture. It highlights the importance of understanding cloud concepts as they relate to enterprise networks, which typically include components like switches, routers, servers, and workstations. This foundational knowledge is essential for navigating modern networking discussions and implementations.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Cloud Services Introduction",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_2",
      "content": "Traditionally, each of these workstations would have all the necessary applications and hardware components in order to carry out daily tasks, and these servers would each have a single OS installed and provide a specific function, such as a file server or DHCP server. However, the cloud changes how a traditional network model works. For example, let's say these workstations need to perform a lot of calculations. In a traditional networking model, each of these workstations would need the necessary software and hardware to match to carry out these tasks. That can get expensive. What the cloud does is outsource these tasks to other machines, which are either located on the same network or provided by a third party via the Internet.",
      "summary": "The traditional network model involves individual workstations equipped with specific applications and hardware to perform designated tasks, relying on dedicated servers for functions like file storage and DHCP. However, cloud computing transforms this model by outsourcing computational tasks to remote servers, reducing the need for extensive local resources and lowering costs. This shift enables more efficient resource management and scalability in network operations.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Traditional Network Model",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_3",
      "content": "In essence, the cloud is computing resources that are offered or delivered as a service over a network. These computing resources include performing calculations or computations, the ability to store data, or the ability to network resources together. The cloud name itself comes from the cloud-shaped symbol used to denote a complex infrastructure in system and network diagrams. In order for a service to be considered a true cloud service, it needs to have five characteristics, which have been determined by the National Institute of Standards and Technology. First, it needs to be an on-demand self-service, meaning users must be able to dynamically obtain resources. Second, it needs to be provided over a network, typically the Internet, and be available on multiple platforms, such as mobile phones, tablets, laptops, and workstations. This is called broad network access. Third, it needs to have resource pooling. This means multiple users can use the same resources. These resources can be physical or virtual, but they need to be able to scale dynamically according to demand. For example, if a server suddenly gets a thousand connections, it needs the ability to provision additional computing power or offload clients to different VMs or servers. Fourth, the service needs to have rapid elasticity. This means the services can seamlessly provision resources and scale resource usage back depending on demand. And finally, the fifth characteristic is what's known as a measured service--that is, resources can be controlled and optimized automatically. In addition, this also means that the service provider can collect information about the service.",
      "summary": "The cloud refers to computing resources delivered as a service over a network, encompassing data storage, processing, and networking capabilities. For a service to qualify as a true cloud service, it must exhibit five key characteristics: on-demand self-service, broad network access, resource pooling, rapid elasticity, and measured service. These principles ensure that cloud services are scalable, efficient, and accessible across various platforms, allowing users to dynamically manage their resource needs.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "What is the Cloud?",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_4",
      "content": "Now, cloud services can be categorized based on the way they are deployed, and there are a few different cloud deployment models you should know about. The first is a public cloud. A public cloud is made available to the public by a service provider. These services are sometimes free, but often use a pay-as-you-go model. With a private cloud, the service consists of an infrastructure provisioned and operated solely for a single organization. Private clouds are typically hosted at the organization. However, there are some private cloud providers that provide remote hosting. Sometimes several organizations share infrastructure for a specific community with common concerns. This is called a community cloud. And the final cloud deployment model is a hybrid cloud. Hybrid clouds are becoming increasingly common. Hybrid clouds are a combination of private, community, or public clouds for different aspects of the services that are provided. For instance, a hybrid cloud service can provide special load balancing between different cloud types if there is a spike in resource usage. Hybrid clouds also use both on-site and off-site resource hosting. Now that you have an understanding of some of the basic concepts of the cloud service model, let's take a look at the different types of cloud services that are available to organizations.",
      "summary": "Cloud deployment models categorize services based on their accessibility and management. The main types include public clouds, which are available to everyone and often use a pay-as-you-go model; private clouds, dedicated to a single organization; community clouds, shared among organizations with common interests; and hybrid clouds, which combine elements of public, private, and community clouds for flexible resource management. Understanding these models is essential for organizations to effectively leverage cloud services according to their specific needs and security requirements.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Cloud Deployment Models",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_5",
      "content": "The first cloud service we'll look at is called Infrastructure as a Service (IaaS). I want to point out that all cloud services end with as a service. This is a quick way for you to identify a cloud service. They almost all use this initialism model, too. Now, Infrastructure as a Service provides an organization with infrastructure components that is, computer hardware components as a service. And these hardware components can be anything from networking devices to storage and data processing resources. For example, instead of having to install multiple file servers with redundant hard drives in your server room, you can pay a company for storage space on their servers. This eliminates the need to maintain and secure local file servers. And let's say you need to process large amounts of data or compile and test applications. Instead of needing the hardware infrastructure on site, you can outsource this to an IaaS company, such as AWS. Another nice thing about IaaS is that it can scale as needed. For example, let's say you need to add more computing resources. Without IaaS, you would have to go out and buy all that hardware, set it up, configure it, et cetera. However, if you are using IaaS, you just tell the cloud company that you need more resources, and they are immediately provided. One thing to know about using IaaS is that it only provides the hardware resources. It's still your job to handle all the configuration and setup and interface with the cloud infrastructure.",
      "summary": "Infrastructure as a Service (IaaS) is a cloud service model that provides organizations with essential hardware components, such as networking devices and storage, on a pay-as-you-go basis. This eliminates the need for local servers, allowing businesses to scale their computing resources quickly and efficiently by outsourcing infrastructure needs to providers like AWS. While IaaS simplifies resource management, users remain responsible for configuring and managing their cloud infrastructure.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Infrastructure as a Service (IaaS)",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_6",
      "content": "The next cloud service is Platform as a Service (PaaS). Platform as a Service provides all the underlying resources that IaaS provides; however, it goes a step further. In addition to the hardware resources, PaaS also provides the configuration, setup, and management of the cloud platform. For example, it handles installing operating systems, connecting virtual networks, and creating an entire environment that is ready for you to use immediately. One common example of PaaS is for software developers. A lot of companies that offer PaaS have packages that are specifically designed for developing, testing, and deploying software programs. Some PaaS cloud service providers also provide additional features, such software design systems, software development resources, testing, and deployment resources. Like IaaS, PaaS provides scalability and flexibility; it can grow or shrink with your organization's needs.",
      "summary": "Platform as a Service (PaaS) offers a comprehensive cloud computing solution by providing not only the hardware resources found in Infrastructure as a Service (IaaS) but also the configuration, setup, and management of the cloud environment. It is particularly beneficial for software developers, as it includes tools for developing, testing, and deploying applications, along with scalability and flexibility to adapt to organizational needs. PaaS streamlines the development process by delivering a ready-to-use platform that enhances productivity and efficiency.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Platform as a Service (PaaS)",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_7",
      "content": "Next is Software as a Service (SaaS). Software as a Service is designed for your average end user. It provides end users with the applications that they need to perform their day-to-day work. Instead of installing the applications locally, they use a web browser to access programs. Some SaaS providers charge a monthly or annual fee. But often, with SaaS, you pay for only the applications that you need. For example, if a user needs a word processing application for nine hours a day, that is how much you pay for. If another user needs the same application for only three hours a month, you pay much less. SaaS also allows you to try new software before committing to it. You can try it out, paying only for the time you use it. If you really like it, you can pay for more use. If you don't like it, you can look for something else without losing much money. SaaS comes in two forms, simple multi-tenancy and fine-grained multi-tenancy. With simple multi-tenancy, each cloud service customer has their own dedicated resources segregated from other customers' resources. Fine-grained multi-tenancy offers the same level of segregation as simple multi-tenancy, but all of the resources used by all customers are pooled together and shared. Your data is segregated, so other customers can't access it. However, your computing resources, applications, and other cloud resources are shared with other customers.",
      "summary": "Software as a Service (SaaS) provides users with web-based applications for daily tasks without the need for local installation, allowing for flexible payment options based on usage. Users can try software before committing, paying only for the time they utilize it, which minimizes financial risk. SaaS operates in two forms: simple multi-tenancy, where customers have dedicated resources, and fine-grained multi-tenancy, where resources are shared but data remains segregated for security.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Software as a Service (SaaS)",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_8",
      "content": "The last cloud service model we'll look at is Security as a Service (SECaaS). Now, you might be thinking, wait a second, I'm a security professional--why would I want to outsource my security services to the cloud? This isn't what SECaaS does. In one way, SECaaS is similar to SaaS it provides a subscription model for applications and software. However, instead of being used for productivity on workstations, the applications and software are specific to organizational security. For example, you might subscribe to a SECaaS system that provides a high-level anti-virus detection service that includes continuous anti-virus updates. Other services provided by SECaaS include DDoS protection, intrusion detection, and authentication services. One of the most common SECaaS providers is CloudFlare. SECaaS can sometimes be much more cost effective for an organization than having to purchase all the necessary hardware equipment and personnel to properly protect a network from viruses, malware, and instruction. However, it is still a necessity to have an on-site security professional.",
      "summary": "Security as a Service (SECaaS) is a cloud-based model that offers subscription-based security solutions tailored for organizational needs, such as anti-virus detection, DDoS protection, and intrusion detection. By outsourcing these services, organizations can reduce costs associated with hardware and personnel while still maintaining necessary security measures. However, having an on-site security professional remains essential for effective network protection.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Security as a Service (SECaaS)",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.4.1_chunk_9",
      "content": "The cloud is an extremely useful service that more and more organizations implement. Because of this, it's important that you understand the underlying structure of the cloud and what it means to your organization's systems and infrastructure. In addition, by better understanding the cloud deployment models, you can better protect your organization.",
      "summary": "The CompTIA Security+ course emphasizes the significance of understanding cloud infrastructure and its implications for organizational systems. It covers various cloud deployment models, equipping learners with the knowledge to enhance security measures and protect their organizations effectively. This foundational knowledge is crucial as more organizations adopt cloud services.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.4.1",
        "title": "Cloud Services Introduction",
        "content_type": "video",
        "filename": "10.4.1_Cloud_Services_Introduction_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.4.1_Cloud_Services_Introduction_[video].txt",
        "word_count": 1806,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 9
}