{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.6.4",
    "title": "Mobile Application Management",
    "content_type": "video",
    "filename": "10.6.4_Mobile_Application_Management_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
    "word_count": 802,
    "has_content": true
  },
  "full_content": "Transcript close interactive script All organizations have mobile apps that they like to use. Due to the different types of device platforms as well at data security and ownership these apps can be a challenge to manage. Mobile Application Management, or MAM, allows the organization to overcome these issues. Intune is Microsoft's MAM solution. MAM in Intune refers to the assortment of management features that lets the system administrator publish, push, configure, secure, monitor, and update mobile apps. Each app in Intune goes through a life cycle. This cycle is Add, Deploy, Configure, Protect, and Retire. Intune provides a full range of tools to help you manage apps during the life cycle. Intune allows the organization to develop its own app catalog, create its own self-service portal, and remotely manage apps. There are a lot of apps available to perform different tasks. But it's important that you only use approved apps that your organization has licenses for and has tested to work with their systems. An app catalog allows the organization to define which apps a user can and can't use. To put together the catalog, the system administrator often shortened to system admin adds the apps to Intune. Once added, security policies are applied to the apps themselves. But security isn't ensured if you use unapproved apps to access organizational data and resources. When adding apps to the catalog, the system admin can assign them to specific users or groups. For example, tech support usually doesn't need to use the finance app that the accounting department uses. So that app wouldn't show up in their catalog. One cool feature that was added to Intune is the ability to blacklist an app. These are apps that absolutely shouldn't be installed on a device that's accessing organizational resources. If the user has one of these apps installed, they'll receive an error message that they're unable to access company resources. In a large organization, it's just not feasible for the network administrator often shortened to network admin to manually push apps out to all the different groups of devices. But a company can create a self-service portal using Intune that makes the distribution of apps easier for everyone. Users can access the portal by using a web link. The most efficient way, though, is to have them install the Intune company portal app. When the user installs the app, they log in using their work credentials. The app then allows the user to access their company's portal. When an organization adds an app to Intune, the system admin decides if it's mandatory to install or not. Intune pushes out mandatory app installs to devices within 24 hours. Using the portal makes managing apps much easier for the system admins. So, there's a lot that goes into managing the apps for an organization. That's why Intune is so valuable for its ease and simplicity. With users spread all over the world, knowing that you can remotely manage app installs and usage is a great benefit. All app types except for the line-of-business apps automatically update as needed. Remember that line-of-business apps are those that someone created internally. So, those updates are pushed out manually through the company portal. Once you load updates to Intune, they should update themselves within 24 hours. When an employee leaves the organization, the system admin needs to ensure that he or she takes away all access to company resources and removes any company data on the user's devices. Intune allows the admin to remotely remove apps and clear all data from the device without affecting the device itself. That's it for now. In this lesson, we covered the basics of Mobile Application Management and how you can use Intune to facilitate this. We looked at how you can create a catalog of the apps that users need. Then we covered what a self-service portal is and how you can use it to make the management of apps easier. Finally, we reviewed how you can use Intune to remotely manage apps and even remove apps from user's devices.",
  "chunks": [
    {
      "chunk_id": "10.6.4_chunk_1",
      "content": "All organizations have mobile apps that they like to use. Due to the different types of device platforms as well at data security and ownership these apps can be a challenge to manage. Mobile Application Management, or MAM, allows the organization to overcome these issues. Intune is Microsoft's MAM solution. MAM in Intune refers to the assortment of management features that lets the system administrator publish, push, configure, secure, monitor, and update mobile apps. Each app in Intune goes through a life cycle. This cycle is Add, Deploy, Configure, Protect, and Retire. Intune provides a full range of tools to help you manage apps during the life cycle. Intune allows the organization to develop its own app catalog, create its own self-service portal, and remotely manage apps.",
      "summary": "Intune Mobile Application Management (MAM) is a solution that enables organizations to effectively manage mobile apps across various device platforms while ensuring data security and ownership. It encompasses a comprehensive life cycle for apps—Add, Deploy, Configure, Protect, and Retire—allowing system administrators to publish, secure, and monitor applications. Additionally, Intune facilitates the creation of custom app catalogs and self-service portals for efficient remote app management.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.6.4",
        "title": "Mobile Application Management",
        "content_type": "video",
        "filename": "10.6.4_Mobile_Application_Management_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
        "word_count": 802,
        "has_content": true
      },
      "section_header": "Intune Mobile Application Management",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.6.4_chunk_2",
      "content": "There are a lot of apps available to perform different tasks. But it's important that you only use approved apps that your organization has licenses for and has tested to work with their systems. An app catalog allows the organization to define which apps a user can and can't use. To put together the catalog, the system administrator often shortened to system admin adds the apps to Intune. Once added, security policies are applied to the apps themselves. But security isn't ensured if you use unapproved apps to access organizational data and resources. When adding apps to the catalog, the system admin can assign them to specific users or groups. For example, tech support usually doesn't need to use the finance app that the accounting department uses. So that app wouldn't show up in their catalog. One cool feature that was added to Intune is the ability to blacklist an app. These are apps that absolutely shouldn't be installed on a device that's accessing organizational resources. If the user has one of these apps installed, they'll receive an error message that they're unable to access company resources.",
      "summary": "Creating an app catalog is essential for organizations to manage and control the applications that users can access, ensuring only approved and tested apps are utilized. System administrators can add apps to Intune, apply security policies, and tailor app visibility to specific user groups, enhancing security and efficiency. Additionally, Intune offers a blacklist feature to prevent the installation of unauthorized apps, further safeguarding organizational data and resources.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.6.4",
        "title": "Mobile Application Management",
        "content_type": "video",
        "filename": "10.6.4_Mobile_Application_Management_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
        "word_count": 802,
        "has_content": true
      },
      "section_header": "Creating an App Catalog",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.6.4_chunk_3",
      "content": "In a large organization, it's just not feasible for the network administrator often shortened to network admin to manually push apps out to all the different groups of devices. But a company can create a self-service portal using Intune that makes the distribution of apps easier for everyone. Users can access the portal by using a web link. The most efficient way, though, is to have them install the Intune company portal app. When the user installs the app, they log in using their work credentials. The app then allows the user to access their company's portal. When an organization adds an app to Intune, the system admin decides if it's mandatory to install or not. Intune pushes out mandatory app installs to devices within 24 hours. Using the portal makes managing apps much easier for the system admins.",
      "summary": "The Self-Service Portal section of the CompTIA Security+ course highlights the use of Intune to streamline app distribution in large organizations, allowing users to access applications via a web link or the Intune company portal app. System administrators can designate apps as mandatory, ensuring they are automatically installed on user devices within 24 hours, thereby simplifying app management and reducing the workload on network administrators. This approach enhances efficiency and user experience in managing organizational applications.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.6.4",
        "title": "Mobile Application Management",
        "content_type": "video",
        "filename": "10.6.4_Mobile_Application_Management_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
        "word_count": 802,
        "has_content": true
      },
      "section_header": "Self-Service Portal",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.6.4_chunk_4",
      "content": "So, there's a lot that goes into managing the apps for an organization. That's why Intune is so valuable for its ease and simplicity. With users spread all over the world, knowing that you can remotely manage app installs and usage is a great benefit. All app types except for the line-of-business apps automatically update as needed. Remember that line-of-business apps are those that someone created internally. So, those updates are pushed out manually through the company portal. Once you load updates to Intune, they should update themselves within 24 hours. When an employee leaves the organization, the system admin needs to ensure that he or she takes away all access to company resources and removes any company data on the user's devices. Intune allows the admin to remotely remove apps and clear all data from the device without affecting the device itself.",
      "summary": "The CompTIA Security+ course highlights the importance of Intune for remotely managing applications within an organization, particularly for a global workforce. It facilitates automatic updates for most app types, while line-of-business apps require manual updates through the company portal. Additionally, Intune enables system administrators to revoke access and erase company data from devices when employees leave, ensuring security without compromising the personal data on the device.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.6.4",
        "title": "Mobile Application Management",
        "content_type": "video",
        "filename": "10.6.4_Mobile_Application_Management_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
        "word_count": 802,
        "has_content": true
      },
      "section_header": "Remotely Manage Apps",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.6.4_chunk_5",
      "content": "That's it for now. In this lesson, we covered the basics of Mobile Application Management and how you can use Intune to facilitate this. We looked at how you can create a catalog of the apps that users need. Then we covered what a self-service portal is and how you can use it to make the management of apps easier. Finally, we reviewed how you can use Intune to remotely manage apps and even remove apps from user's devices.",
      "summary": "This lesson focused on Mobile Application Management (MAM) using Intune, highlighting the creation of an app catalog for user accessibility. It explained the functionality of a self-service portal to streamline app management and demonstrated how Intune can be utilized for remote app management, including the ability to uninstall apps from users' devices. These concepts are essential for enhancing mobile security and user experience in organizational settings.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.6.4",
        "title": "Mobile Application Management",
        "content_type": "video",
        "filename": "10.6.4_Mobile_Application_Management_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.6.4_Mobile_Application_Management_[video].txt",
        "word_count": 802,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 5
}