{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.7.1",
    "title": "BYOD Security Issues",
    "content_type": "video",
    "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
    "word_count": 2129,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Let's spend a few minutes talking about managing mobile devices. When managing a modern computer network, you need to take into account all of mobile devices that will be connected to that network from both a management perspective and from a security perspective. Most users today have more than one mobile device that they will use to complete their day to day work, including smart phones and tablets. These devices may be purchased by your organization, or they may be personal devices brought from home. This practice is sometimes referred to as bring your own device, or BYOD. While these devices allow employees to be more productive, they also create management issues and open up security holes in your network. Because these devices are so well liked, it really isn't feasible for you to try to prevent their usage. Instead, you need to formulate plans to address them in your overall management strategy. A key issue to remember is the fact that these devices probably contain some type of sensitive information. The degree of sensitivity depends on your organization, the person's role, and the information downloaded to these devices. It is possible that sensitive information can leak out of your organization through one of these mobile devices. You need to define processes for managing these devices. Let's take a look at a few things you need to consider. First, you should define a process for provisioning users with mobile devices. Remember, whenever you give an employee one of these devices, it can open up a security risk. You need to carefully control who gets these devices and what they put on them. Begin by defining a procedure for provisioning users with mobile devices. This ensures that you know exactly who has a mobile device and what they will use it for. Next, you should define acceptable uses for these devices. There are several key aspects related to acceptable use; one is personal use, and the other is after normal hours use. Employment terms play a factor. If an hourly employee is issued a mobile device, and that employee uses the device after normal work hours for company purposes, such as answering emails or responding to requests, then that individual could be eligible for overtime pay. This issue also relates to personal use of the device. If an employee uses a company owned mobile device after hours for anything that's irresponsible, illegal, embarrassing, or even malicious, your organization may have a degree of liability. The liability would stem from the fact that the organization issued the device to the employee and didn't specify acceptable personal use guidelines. Therefore, you should include provisions in your AUP that explicitly defines what constitutes acceptable personal use and which activities are prohibited. If your organization allows personally owned devices, then you must address the question of who owns company data if it gets copied to a user's device. Does the organization still own it, or does the user own it because it's on their personal device? To deal with this problem, your AUP should define the kind of data that is allowed on mobile devices, especially if the device is personally owned. It should also define the kind of data prohibited on mobile devices. You can implement information classification labels to make it clear to the user into which category a particular piece of data is sorted. In addition, your AUP needs to address the threat of insider attacks. A malicious internal user could use a mobile device to conduct an insider attack. For example, the user could use the built-in camera to take pictures of sensitive internal information. They could copy sensitive data to the device's storage. They could use the built-in microphone to record conversations. They could use the built-in video function to record proprietary processes, and so on. They could then transmit this stolen information outside your organization without going through your organization's network security mechanism using the device's mobile broadband connection. This would bypass your intrusion protection systems, your firewall, and any other network security mechanisms you may have implemented. Essentially, data could be stolen and you will have no idea that it's been leaked or how it got out. Because these devices have Wi-Fi or mobile broadband networking built-in to them, it is very difficult to prevent data leakage. If the user can download or capture sensitive information to the device, there is no technological means to prevent data from being transmitted. Accordingly, your acceptable use policy should specify where and when employees can possess mobile devices and how they can use them. For example, you could prohibit mobile devices in the high-security areas of your organization. You could specify in the AUP that any personally owned devices brought on site are subject to random searches. Once your AUP has been defined, you need to develop a management plan for managing the mobile devices in your network, both company owned and personally owned. For example, one issue you need to be concerned with is malware propagation. If a user's tablet or phone is infected with malware, the infection can easily spread to your organization's network when they connect their device to your organization's internal network. One solution is to implement Network Access Control (NAC) so that devices can be remediated before allowing them on your network. The NAC can install the latest antimalware software updates to a device and then run a scan to ensure the device is clean before allowing it on your network. Alternatively, you could implement a guest wireless network that's isolated from your organization's production network. In this configuration, a BYOD device connects to the guest network to gain Internet access, but is quarantined from the rest of your organization's production network. Using a guest wireless network prevents malware on a BYOD device from infecting your production systems. You also need to consider policies and procedures for protecting data that is legitimately copied to mobile devices within the guidelines set in your AUP. Organizations spend a lot of time, effort, and money building internal security controls to protect their data. However, if a user copies that information to a mobile device, that data is at risk. For example, if the user loses the device, the data on that device may be compromised. All the firewalls, content filters, and intrusion detection systems that you setup on your internal network are completely ineffective at preventing this. If that device doesn't have the appropriate security settings, anyone who picks up that device will be able view the sensitive data. To circumvent this risk, consider using a mobile device management (MDM) infrastructure, such as the Windows Intune service. You can require all mobile devices, even personally owned devices, to be enrolled in your MDM infrastructure. You can use this infrastructure to enforce mobile device security policies. For example, using an MDM, you can require enrolled devices to use some form of authentication, such as a PIN or (better yet) a password. You don't want just anyone to be able to pick up a mobile device and begin using it without having to authenticate in some way. Without a password or a PIN code, anyone who finds a lost mobile device could immediately access the information that has been saved on it. Also consider implementing some type of device lockout with your MDM infrastructure. If a device is left on, but there has been no activity for a period time, the lockout feature should lock the device and require authentication to re-access it. For example, suppose I'm at the airport using my Smartphone. I set my phone down to get my luggage and I forget and leave it in the terminal. After a few minutes of inactivity, the lockout feature automatically locks the device and requires some type of authentication to get back in. You can also use the MDM infrastructure to enable device encryption. Even if I require authentication and lockouts on enrolled mobile devices, there is still a risk that someone could physically open a lost or stolen device, remove its storage, and try to read its contents from a different system. To prevent this, you can enable device encryption. Without the correct encryption key, the contents of the device's storage are undecipherable. Again, this can help protect data on a device if it gets lost. You can also use the MDM infrastructure to remotely wipe mobile devices. This feature sends out a command over the Internet to a lost or stolen mobile device that causes the contents of the device to be wiped. The ability to perform a remote wipe is essential if you allow sensitive company information to be copied to mobile devices. If the user loses a device, you need to be able to perform a remote wipe as quickly as possible. You can even use the MDM infrastructure to automatically wipe data from a device after a certain number of failed authentication attempts have occurred. If someone finds or steals a device and then repeatedly tries to guess its pin or password, all the data will be removed from the device. Finally, you should implement some type of reporting process for your mobile devices. Identifying a lost or stolen device as quickly as possible is probably one of the most important components in your overall mobile device management strategy. If a user loses a device, or if it's stolen, the loss needs to be reported immediately. Remember, users will be either hesitant or embarrassed to let you know that the device that the organization paid for and issued to them is now gone. They may fear some type of retribution. In spite of this, you need to make sure they understand that getting the missing device wiped clean of sensitive data is the organization's primary concern. Make sure users understand that timing is critical. The longer a missing device goes unreported, the more time an attacker has to defeat its security mechanisms and the more likely the sensitive data it contains will be exposed. So, in this lesson we talked about some things you can do to increase the overall security of the mobile devices used by your organization. We talked about implementing a procedure for provisioning mobile devices, defining an acceptable use statement, and using an MDM infrastructure. Then we looked at some general provisions you can use to protect the data on the device, such as using authentication, implementing a lockout, using remote wipe after failed authentication attempts, encrypting the device, and instructing users to report immediately if a device is lost or stolen.",
  "chunks": [
    {
      "chunk_id": "10.7.1_chunk_1",
      "content": "Let's spend a few minutes talking about managing mobile devices. When managing a modern computer network, you need to take into account all of mobile devices that will be connected to that network from both a management perspective and from a security perspective. Most users today have more than one mobile device that they will use to complete their day to day work, including smart phones and tablets. These devices may be purchased by your organization, or they may be personal devices brought from home. This practice is sometimes referred to as bring your own device, or BYOD. While these devices allow employees to be more productive, they also create management issues and open up security holes in your network. Because these devices are so well liked, it really isn't feasible for you to try to prevent their usage. Instead, you need to formulate plans to address them in your overall management strategy. A key issue to remember is the fact that these devices probably contain some type of sensitive information. The degree of sensitivity depends on your organization, the person's role, and the information downloaded to these devices. It is possible that sensitive information can leak out of your organization through one of these mobile devices. You need to define processes for managing these devices. Let's take a look at a few things you need to consider.",
      "summary": "Mobile Device Management (MDM) is crucial for securing and managing the diverse range of mobile devices, such as smartphones and tablets, that connect to modern computer networks, especially in a Bring Your Own Device (BYOD) environment. While these devices enhance employee productivity, they also introduce significant security risks and management challenges due to the sensitive information they may store. Organizations must develop comprehensive strategies to manage these devices effectively, ensuring that security protocols are in place to protect against potential data leaks.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Mobile Device Management",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_2",
      "content": "First, you should define a process for provisioning users with mobile devices. Remember, whenever you give an employee one of these devices, it can open up a security risk. You need to carefully control who gets these devices and what they put on them. Begin by defining a procedure for provisioning users with mobile devices. This ensures that you know exactly who has a mobile device and what they will use it for.",
      "summary": "The \"Provisioning Mobile Devices\" section emphasizes the importance of establishing a structured process for assigning mobile devices to users, as these devices can introduce security vulnerabilities. It highlights the need for careful control over device allocation and usage, ensuring that organizations maintain awareness of who possesses mobile devices and their intended applications. By implementing a clear provisioning procedure, organizations can mitigate risks associated with mobile device security.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Provisioning Mobile Devices",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_3",
      "content": "Next, you should define acceptable uses for these devices. There are several key aspects related to acceptable use; one is personal use, and the other is after normal hours use. Employment terms play a factor. If an hourly employee is issued a mobile device, and that employee uses the device after normal work hours for company purposes, such as answering emails or responding to requests, then that individual could be eligible for overtime pay. This issue also relates to personal use of the device. If an employee uses a company owned mobile device after hours for anything that's irresponsible, illegal, embarrassing, or even malicious, your organization may have a degree of liability. The liability would stem from the fact that the organization issued the device to the employee and didn't specify acceptable personal use guidelines. Therefore, you should include provisions in your AUP that explicitly defines what constitutes acceptable personal use and which activities are prohibited. If your organization allows personally owned devices, then you must address the question of who owns company data if it gets copied to a user's device. Does the organization still own it, or does the user own it because it's on their personal device? To deal with this problem, your AUP should define the kind of data that is allowed on mobile devices, especially if the device is personally owned. It should also define the kind of data prohibited on mobile devices. You can implement information classification labels to make it clear to the user into which category a particular piece of data is sorted. In addition, your AUP needs to address the threat of insider attacks. A malicious internal user could use a mobile device to conduct an insider attack. For example, the user could use the built-in camera to take pictures of sensitive internal information. They could copy sensitive data to the device's storage. They could use the built-in microphone to record conversations. They could use the built-in video function to record proprietary processes, and so on. They could then transmit this stolen information outside your organization without going through your organization's network security mechanism using the device's mobile broadband connection. This would bypass your intrusion protection systems, your firewall, and any other network security mechanisms you may have implemented. Essentially, data could be stolen and you will have no idea that it's been leaked or how it got out. Because these devices have Wi-Fi or mobile broadband networking built-in to them, it is very difficult to prevent data leakage. If the user can download or capture sensitive information to the device, there is no technological means to prevent data from being transmitted. Accordingly, your acceptable use policy should specify where and when employees can possess mobile devices and how they can use them. For example, you could prohibit mobile devices in the high-security areas of your organization. You could specify in the AUP that any personally owned devices brought on site are subject to random searches. Once your AUP has been defined, you need to develop a management plan for managing the mobile devices in your network, both company owned and personally owned. For example, one issue you need to be concerned with is malware propagation. If a user's tablet or phone is infected with malware, the infection can easily spread to your organization's network when they connect their device to your organization's internal network. One solution is to implement Network Access Control (NAC) so that devices can be remediated before allowing them on your network. The NAC can install the latest antimalware software updates to a device and then run a scan to ensure the device is clean before allowing it on your network. Alternatively, you could implement a guest wireless network that's isolated from your organization's production network. In this configuration, a BYOD device connects to the guest network to gain Internet access, but is quarantined from the rest of your organization's production network. Using a guest wireless network prevents malware on a BYOD device from infecting your production systems. You also need to consider policies and procedures for protecting data that is legitimately copied to mobile devices within the guidelines set in your AUP. Organizations spend a lot of time, effort, and money building internal security controls to protect their data. However, if a user copies that information to a mobile device, that data is at risk. For example, if the user loses the device, the data on that device may be compromised. All the firewalls, content filters, and intrusion detection systems that you setup on your internal network are completely ineffective at preventing this. If that device doesn't have the appropriate security settings, anyone who picks up that device will be able view the sensitive data.",
      "summary": "The Acceptable Use Policy (AUP) is crucial for defining the permissible use of company-issued and personal mobile devices, addressing issues such as personal use, liability, and data ownership. It should outline acceptable behaviors, prohibit irresponsible activities, and mitigate risks of insider threats and data leakage. Additionally, implementing management strategies like Network Access Control (NAC) and guest networks can help safeguard organizational data from malware and unauthorized access when devices connect to the network.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "AUP",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_4",
      "content": "To circumvent this risk, consider using a mobile device management (MDM) infrastructure, such as the Windows Intune service. You can require all mobile devices, even personally owned devices, to be enrolled in your MDM infrastructure. You can use this infrastructure to enforce mobile device security policies.",
      "summary": "The MDM Infrastructure section emphasizes the importance of implementing a Mobile Device Management (MDM) system, like Windows Intune, to enhance security for mobile devices, including personal ones. By enrolling all devices in the MDM, organizations can enforce security policies effectively, mitigating risks associated with mobile device usage. This approach ensures consistent security management across all devices accessing organizational resources.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "MDM Infrastructure",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_5",
      "content": "For example, using an MDM, you can require enrolled devices to use some form of authentication, such as a PIN or (better yet) a password. You don't want just anyone to be able to pick up a mobile device and begin using it without having to authenticate in some way. Without a password or a PIN code, anyone who finds a lost mobile device could immediately access the information that has been saved on it.",
      "summary": "The Authentication section emphasizes the importance of requiring authentication methods, such as PINs or passwords, for enrolled devices managed by Mobile Device Management (MDM) systems. This practice is crucial to prevent unauthorized access to sensitive information on lost or stolen mobile devices. Implementing robust authentication measures helps safeguard data and enhances overall security.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Authentication",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_6",
      "content": "Also consider implementing some type of device lockout with your MDM infrastructure. If a device is left on, but there has been no activity for a period time, the lockout feature should lock the device and require authentication to re-access it. For example, suppose I'm at the airport using my Smartphone. I set my phone down to get my luggage and I forget and leave it in the terminal. After a few minutes of inactivity, the lockout feature automatically locks the device and requires some type of authentication to get back in.",
      "summary": "The Lockout section emphasizes the importance of implementing device lockout features within Mobile Device Management (MDM) systems to enhance security. This feature automatically locks devices after a specified period of inactivity, requiring authentication for re-access, which helps protect sensitive information in scenarios where devices may be left unattended, such as in public places. Practical applications include safeguarding smartphones and tablets from unauthorized access in case they are misplaced.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Lockout",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_7",
      "content": "You can also use the MDM infrastructure to enable device encryption. Even if I require authentication and lockouts on enrolled mobile devices, there is still a risk that someone could physically open a lost or stolen device, remove its storage, and try to read its contents from a different system. To prevent this, you can enable device encryption. Without the correct encryption key, the contents of the device's storage are undecipherable. Again, this can help protect data on a device if it gets lost.",
      "summary": "Device encryption is a critical security measure that protects the data on mobile devices by rendering it unreadable without the correct encryption key. Even with authentication and lockout protocols in place, encryption safeguards against unauthorized access to data if a device is lost or stolen. Implementing encryption through Mobile Device Management (MDM) infrastructure enhances overall data security and mitigates risks associated with physical device theft.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Encryption",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_8",
      "content": "You can also use the MDM infrastructure to remotely wipe mobile devices. This feature sends out a command over the Internet to a lost or stolen mobile device that causes the contents of the device to be wiped. The ability to perform a remote wipe is essential if you allow sensitive company information to be copied to mobile devices. If the user loses a device, you need to be able to perform a remote wipe as quickly as possible. You can even use the MDM infrastructure to automatically wipe data from a device after a certain number of failed authentication attempts have occurred. If someone finds or steals a device and then repeatedly tries to guess its pin or password, all the data will be removed from the device.",
      "summary": "The Remote Wipe feature within Mobile Device Management (MDM) allows organizations to erase data from lost or stolen mobile devices, ensuring sensitive information remains secure. This capability is crucial for protecting company data, as it can be triggered remotely or automatically after a set number of failed authentication attempts. Implementing remote wipe policies helps mitigate risks associated with mobile device security breaches.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Remote Wipe",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_9",
      "content": "Finally, you should implement some type of reporting process for your mobile devices. Identifying a lost or stolen device as quickly as possible is probably one of the most important components in your overall mobile device management strategy. If a user loses a device, or if it's stolen, the loss needs to be reported immediately. Remember, users will be either hesitant or embarrassed to let you know that the device that the organization paid for and issued to them is now gone. They may fear some type of retribution. In spite of this, you need to make sure they understand that getting the missing device wiped clean of sensitive data is the organization's primary concern. Make sure users understand that timing is critical. The longer a missing device goes unreported, the more time an attacker has to defeat its security mechanisms and the more likely the sensitive data it contains will be exposed.",
      "summary": "Implementing a robust reporting process for lost or stolen mobile devices is crucial for effective mobile device management. Users must be encouraged to report incidents immediately, despite potential hesitations, as timely reporting allows for swift action to wipe sensitive data and mitigate security risks. Emphasizing the importance of quick reporting helps protect organizational data from potential exposure by attackers.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Employee Reporting Device Lost/Stolen",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.7.1_chunk_10",
      "content": "So, in this lesson we talked about some things you can do to increase the overall security of the mobile devices used by your organization. We talked about implementing a procedure for provisioning mobile devices, defining an acceptable use statement, and using an MDM infrastructure. Then we looked at some general provisions you can use to protect the data on the device, such as using authentication, implementing a lockout, using remote wipe after failed authentication attempts, encrypting the device, and instructing users to report immediately if a device is lost or stolen.",
      "summary": "This lesson emphasizes enhancing mobile device security within an organization through effective provisioning procedures and an acceptable use policy, supported by a Mobile Device Management (MDM) infrastructure. Key protective measures include implementing authentication, lockout protocols, remote wipe capabilities, and device encryption, alongside encouraging users to promptly report lost or stolen devices to safeguard sensitive data.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.7.1",
        "title": "BYOD Security Issues",
        "content_type": "video",
        "filename": "10.7.1_BYOD_Security_Issues_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.7.1_BYOD_Security_Issues_[video].txt",
        "word_count": 2129,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 10
}