{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.8.1",
    "title": "Embedded and Specialized Systems",
    "content_type": "video",
    "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
    "word_count": 1410,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Today's smart technology is being embedded into devices like TVs, kitchen appliances, environmental controls, and even industrial equipment. And it's becoming increasingly common. These devices are sometimes referred to as static environments because they weren't designed to be customized or modified in any way by you, the network administrator. Smart tech history is connected with supervisory control and data acquisition systems. We just call them SCADA. This infrastructure manages automated factory equipment that relies on the smart technology embedded in modern devices. As its name suggests, SCADA systems provide two general functions: supervisory control and data acquisition. The first controls remote equipment over a network connection. The second gathers information from those remote devices, allowing you to monitor their status. Using network connectivity, SCADA systems can manage industrial equipment a long distance away from a control center. This is sometimes called a distributed control system, or DCS. To make this work, SCADA systems have several different components. First, there's a central supervisory computer that communicates with and sends control commands out to connected SCADA devices. The devices have remote terminal units, or RTUs. The RTUs connect the equipment to the network, which enables them to receive commands from the supervisory system and then send status information back. Alternatively, SCADA equipment might have programmable logic controllers, or PLCs, installed. PLCs connect the SCADA equipment to the network just like RTUs. The difference is that they're usually less expensive. Another important component is the type of network link used to connect the supervisory computer to the RTUs or PLCs. Some of the most common options include a standard internet connection, a satellite link, a private WAN link, or even a simple modem connection over a telephone line. When talking about smart technology and SCADA, we can't forget the Internet of Things, or IoT. IoT is a natural extension of SCADA. Its evolution is such that late-generation SCADA systems developed into first-generation IoT systems. An IoT ecosystem is made up of web-enabled smart devices that use embedded processors, sensors, and communication hardware to collect, send, and act on data they gather from their environments. One important aspect of newer IoT devices is the operating system they use because these offer connectivity, usability, and interoperability. One of these operating systems is called RIOT OS. It requires few resources and is very energy efficient. It's used on embedded systems, actuator boards, and sensors. Another is ARM Mbed OS. This OS is primarily used with low-power technology such as wearable devices. In other words, any mobile device that's meant to be worn somewhere on the body. These devices can be as simple as a step-tracking wristband or as complex as a virtual reality headset. Most wearable devices are designed to interface with another device. For example, a smartwatch by itself has a limited set of functions. But when you connect it to a smartphone through Bluetooth, you get added functionality like text messaging or being able to answer phone calls. Back to the operating systems now. RealSense OS X is used in Intel's depth-sensing technology for cameras and sensors. Then there's Nucleus and Integrity RTOS, which are both used for aerospace, industrial, automotive, and medical devices. When it comes to drones and robots, Ubuntu Core or Snappy are usually preferred. Whether it's a tablet, smartphone, or an e-reader, all mobile devices share some characteristics. The most common is the power source. The power source is typically a lithium ion battery rated in milliamp hours. The larger the number, the greater the battery capacity. For example, the average smartphone battery is about 2,000 milliamp hours while a notebook battery is about 6,000 milliamp hours. Another characteristic is a mobile device's storage. To extend battery life, mobile devices use some sort of non-volatile flash memory to store information. Because no moving parts need to be powered, flash memory is a more energy-efficient storage medium. In addition, a lot of mobile devices have expandable storage in the form of micro-SD cards. This allows mobile devices to increase their storage to upwards of 200 gigabytes. Mobile devices need connectivity to the internet and to other mobile devices. To do this, they use a variety of wireless connection mediums. For example, the typical smartphone utilizes 802.11, Bluetooth, and cellular wireless technologies. Mobile devices also have internal sensors that collect environmental data, usually with a GPS chip. They use these chips to calculate the device's location information, which you can use for navigation and for finding your device if you happen to lose it. Another internal sensor is called an accelerometer. This is a sensor that detects movement on a single plane, typically the horizontal plane. It detects when a mobile device is turned sideways and tells the device to change the screen's orientation. A third sensor is a gyroscope. It also detects movement, but instead of detecting movement on a single plane, it detects horizontal and vertical movements. If you've ever played a game on a smartphone or tablet that requires you to tilt the device, you've used a gyroscope. A key issue with smart technology is that there's little to no ability to modify the technology within. As a result, it's very difficult to manage security. For example, you can't install anti-malware software on a smart refrigerator or on an HVAC system even though there are significant security risks associated with them. For example, in early 2014 the first documented IoT attack occurred. This attack leveraged smart devices to conduct a rather pervasive, malicious email-phishing exploit. The trouble is that because smart devices are becoming more commonplace, we tend to forget about them. In addition, smart device vendors are slow to protect their products proactively because of cost constraints. For this reason, it's even more important for you as an administrator to secure your network against any possible smart device attacks. It's also good to keep physical security in mind. When an attacker discovers a rogue access point, they're able to run various types of vulnerability scanners from outside the company. But if they gain physical access, they can hide a physical rogue access point as well. This is often done by configuring an extremely compact and powerful hardware device called a Raspberry Pi. Just like smart device attacks, a rogue access point attack happens simply because a network administrator didn't properly configure the legitimate access points. Maybe he or she didn't implemented proper security measures in the beginning and eventually just forgot about them altogether. This is known as access point misconfiguration. To defend against these attacks, there are a few things you can do. First, have a solid firewall design in place. Second, have intrusion detection. Or better yet, install intrusion-protection devices. Third, have very strong organizational security policies in place so that you're not caught off guard. That's it for this lesson. In this video, we looked at security risks associated with embedded and specialized systems. We talked about SCADA, IoT, smart devices, and mobile devices. We talked about the security risks associated with these devices as well as with Raspberry Pi. We ended this lesson by talking about how you can defend yourself from distributed attacks leveled against these smart devices.",
  "chunks": [
    {
      "chunk_id": "10.8.1_chunk_1",
      "content": "Today's smart technology is being embedded into devices like TVs, kitchen appliances, environmental controls, and even industrial equipment. And it's becoming increasingly common. These devices are sometimes referred to as static environments because they weren't designed to be customized or modified in any way by you, the network administrator.",
      "summary": "The Embedded and Specialized Systems section of the CompTIA Security+ course highlights the integration of smart technology into everyday devices, such as TVs and kitchen appliances, as well as industrial equipment. These devices, often termed static environments, are typically not designed for customization or modification by network administrators, posing unique security challenges. Understanding the security implications of these embedded systems is crucial for protecting networks and ensuring the integrity of connected devices.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Embedded and Specialized Systems",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_2",
      "content": "Smart tech history is connected with supervisory control and data acquisition systems. We just call them SCADA. This infrastructure manages automated factory equipment that relies on the smart technology embedded in modern devices. As its name suggests, SCADA systems provide two general functions: supervisory control and data acquisition. The first controls remote equipment over a network connection. The second gathers information from those remote devices, allowing you to monitor their status. Using network connectivity, SCADA systems can manage industrial equipment a long distance away from a control center. This is sometimes called a distributed control system, or DCS. To make this work, SCADA systems have several different components. First, there's a central supervisory computer that communicates with and sends control commands out to connected SCADA devices. The devices have remote terminal units, or RTUs. The RTUs connect the equipment to the network, which enables them to receive commands from the supervisory system and then send status information back. Alternatively, SCADA equipment might have programmable logic controllers, or PLCs, installed. PLCs connect the SCADA equipment to the network just like RTUs. The difference is that they're usually less expensive. Another important component is the type of network link used to connect the supervisory computer to the RTUs or PLCs. Some of the most common options include a standard internet connection, a satellite link, a private WAN link, or even a simple modem connection over a telephone line.",
      "summary": "SCADA (Supervisory Control and Data Acquisition) systems are crucial for managing automated industrial equipment by providing supervisory control and data acquisition functions over network connections. They consist of a central supervisory computer, remote terminal units (RTUs), or programmable logic controllers (PLCs) that facilitate communication and control of remote devices, enabling monitoring and management from a distance. Various network links, such as internet connections or private WANs, are utilized to connect these components, highlighting the importance of cybersecurity in protecting these critical infrastructures.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "SCADA",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_3",
      "content": "When talking about smart technology and SCADA, we can't forget the Internet of Things, or IoT. IoT is a natural extension of SCADA. Its evolution is such that late-generation SCADA systems developed into first-generation IoT systems. An IoT ecosystem is made up of web-enabled smart devices that use embedded processors, sensors, and communication hardware to collect, send, and act on data they gather from their environments. One important aspect of newer IoT devices is the operating system they use because these offer connectivity, usability, and interoperability. One of these operating systems is called RIOT OS. It requires few resources and is very energy efficient. It's used on embedded systems, actuator boards, and sensors.",
      "summary": "The Internet of Things (IoT) represents an evolution of SCADA systems, comprising web-enabled smart devices equipped with embedded processors, sensors, and communication hardware that collect and act on environmental data. A key aspect of IoT is the operating systems used, such as RIOT OS, which is designed for energy efficiency and resource conservation, making it suitable for embedded systems and sensors. Understanding IoT is crucial for implementing effective cybersecurity measures in interconnected environments.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "IoT",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_4",
      "content": "Another is ARM Mbed OS. This OS is primarily used with low-power technology such as wearable devices. In other words, any mobile device that's meant to be worn somewhere on the body. These devices can be as simple as a step-tracking wristband or as complex as a virtual reality headset. Most wearable devices are designed to interface with another device. For example, a smartwatch by itself has a limited set of functions. But when you connect it to a smartphone through Bluetooth, you get added functionality like text messaging or being able to answer phone calls.",
      "summary": "The IoT section of the CompTIA Security+ course highlights ARM Mbed OS, which is tailored for low-power wearable devices, ranging from simple fitness trackers to advanced virtual reality headsets. These devices typically enhance their functionality through connectivity with smartphones or other devices, exemplifying the importance of secure communication protocols in IoT ecosystems. Understanding these concepts is crucial for implementing effective security measures in the rapidly evolving landscape of connected devices.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "IoT",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_5",
      "content": "Back to the operating systems now. RealSense OS X is used in Intel's depth-sensing technology for cameras and sensors. Then there's Nucleus and Integrity RTOS, which are both used for aerospace, industrial, automotive, and medical devices. When it comes to drones and robots, Ubuntu Core or Snappy are usually preferred.",
      "summary": "The IoT section of the CompTIA Security+ course covers various operating systems utilized in Internet of Things devices, highlighting RealSense OS X for Intel's depth-sensing technology and Nucleus and Integrity RTOS for critical applications in aerospace, industrial, automotive, and medical fields. Additionally, it notes the preference for Ubuntu Core or Snappy in the deployment of drones and robotics. Understanding these operating systems is essential for securing IoT environments and ensuring the reliability of connected devices.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "IoT",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_6",
      "content": "Whether it's a tablet, smartphone, or an e-reader, all mobile devices share some characteristics. The most common is the power source. The power source is typically a lithium ion battery rated in milliamp hours. The larger the number, the greater the battery capacity. For example, the average smartphone battery is about 2,000 milliamp hours while a notebook battery is about 6,000 milliamp hours. Another characteristic is a mobile device's storage. To extend battery life, mobile devices use some sort of non-volatile flash memory to store information. Because no moving parts need to be powered, flash memory is a more energy-efficient storage medium. In addition, a lot of mobile devices have expandable storage in the form of micro-SD cards. This allows mobile devices to increase their storage to upwards of 200 gigabytes. Mobile devices need connectivity to the internet and to other mobile devices. To do this, they use a variety of wireless connection mediums. For example, the typical smartphone utilizes 802.11, Bluetooth, and cellular wireless technologies. Mobile devices also have internal sensors that collect environmental data, usually with a GPS chip. They use these chips to calculate the device's location information, which you can use for navigation and for finding your device if you happen to lose it. Another internal sensor is called an accelerometer. This is a sensor that detects movement on a single plane, typically the horizontal plane. It detects when a mobile device is turned sideways and tells the device to change the screen's orientation. A third sensor is a gyroscope. It also detects movement, but instead of detecting movement on a single plane, it detects horizontal and vertical movements. If you've ever played a game on a smartphone or tablet that requires you to tilt the device, you've used a gyroscope.",
      "summary": "Mobile devices, including smartphones and tablets, are characterized by their lithium-ion batteries, non-volatile flash memory for efficient storage, and various wireless connectivity options such as 802.11, Bluetooth, and cellular technologies. They often feature expandable storage through micro-SD cards and include internal sensors like GPS, accelerometers, and gyroscopes for enhanced functionality, such as navigation and motion detection. Understanding these components is crucial for implementing effective security measures and managing risks associated with mobile device usage.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Mobile Devices",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_7",
      "content": "A key issue with smart technology is that there's little to no ability to modify the technology within. As a result, it's very difficult to manage security. For example, you can't install anti-malware software on a smart refrigerator or on an HVAC system even though there are significant security risks associated with them. For example, in early 2014 the first documented IoT attack occurred. This attack leveraged smart devices to conduct a rather pervasive, malicious email-phishing exploit. The trouble is that because smart devices are becoming more commonplace, we tend to forget about them. In addition, smart device vendors are slow to protect their products proactively because of cost constraints. For this reason, it's even more important for you as an administrator to secure your network against any possible smart device attacks.",
      "summary": "Smart devices pose significant security challenges due to their limited ability to be modified or secured, making it difficult to implement traditional security measures like anti-malware software. The first documented IoT attack in 2014 highlighted the vulnerabilities of these devices, as they can be exploited for malicious activities such as phishing. As smart devices become more prevalent, it is crucial for administrators to proactively secure networks against potential attacks, especially given the slow response from vendors in enhancing product security.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Smart Devices",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_8",
      "content": "It's also good to keep physical security in mind. When an attacker discovers a rogue access point, they're able to run various types of vulnerability scanners from outside the company. But if they gain physical access, they can hide a physical rogue access point as well. This is often done by configuring an extremely compact and powerful hardware device called a Raspberry Pi. Just like smart device attacks, a rogue access point attack happens simply because a network administrator didn't properly configure the legitimate access points. Maybe he or she didn't implemented proper security measures in the beginning and eventually just forgot about them altogether. This is known as access point misconfiguration.",
      "summary": "The Raspberry Pi can be exploited by attackers to create rogue access points, particularly when physical security measures are inadequate. These attacks often stem from misconfigured legitimate access points, highlighting the importance of proper security protocols and ongoing vigilance by network administrators. Understanding these vulnerabilities is crucial for enhancing network security and preventing unauthorized access.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Raspberry Pi",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_9",
      "content": "To defend against these attacks, there are a few things you can do. First, have a solid firewall design in place. Second, have intrusion detection. Or better yet, install intrusion-protection devices. Third, have very strong organizational security policies in place so that you're not caught off guard.",
      "summary": "To effectively defend against cyber attacks, organizations should implement a robust firewall design and utilize intrusion detection and protection systems. Additionally, establishing strong security policies is crucial to ensure preparedness and mitigate risks. These measures collectively enhance an organization's security posture and resilience against potential threats.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Defense Against Attacks",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.8.1_chunk_10",
      "content": "That's it for this lesson. In this video, we looked at security risks associated with embedded and specialized systems. We talked about SCADA, IoT, smart devices, and mobile devices. We talked about the security risks associated with these devices as well as with Raspberry Pi. We ended this lesson by talking about how you can defend yourself from distributed attacks leveled against these smart devices.",
      "summary": "This lesson covers the security risks linked to embedded and specialized systems, including SCADA, IoT, smart devices, and mobile devices, as well as specific vulnerabilities associated with Raspberry Pi. It highlights the importance of understanding these risks to effectively defend against distributed attacks targeting such devices. Practical applications include implementing security measures to safeguard against potential threats in these environments.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.8.1",
        "title": "Embedded and Specialized Systems",
        "content_type": "video",
        "filename": "10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.8.1_Embedded_and_Specialized_Systems_[video].txt",
        "word_count": 1410,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 10
}