{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.9.6",
    "title": "Securing Accounts on an iPad",
    "content_type": "video",
    "filename": "10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
    "word_count": 1083,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demonstration, we'll show you techniques to secure accounts on an iPad, specifically email and web browsing. The web browser and email client on a mobile device, as with any computer, represent one of the most serious and most easily attacked vectors into the device. Just as you need to secure the web browser and email client on a Windows workstation, you need to secure them on mobile devices as well. Let's take a look at some things you can do. We're currently using an iPad to do this demonstration. For email, one of the key things we can do is use SSL to communicate with the mail server. This includes POP or IMAP servers, as well as the SMTP server. Let's look at how we do that. Let's go into Settings. We'll scroll up to Passwords & Accounts Then we'll go into this Gmail account. To do that, we tap on the email address to get into the Account settings. At the bottom, there's an Advanced selection. Tap on Advanced. You can see that we are using SSL to encrypt communications between the mail client on this mobile device and the mail server. For this to work, the mail server for POP, IMAP, and SMTP, must be configured to support SSL. If it isn't, then turning this on won't accomplish anything. Remember that POP3, IMAP, and SMTP transmit clear text by default. So, using SSL greatly increases the security of your email communications. If you're using a mobile device to send email messages to someone through your mail server and you're not using SSL, then any sensitive proprietary information in that email is being transferred in clear text. It could be sniffed and read by almost anyone. Using SSL sets up an SSL tunnel between the email client and the mail server. The SSL tunnel secures message transmission through that tunnel. It is already enabled here. In addition to securing your email account, you also need to secure the web browser on a mobile device. Because we're using an iPad, Safari is the browser. Let's get out of the account and go to Safari Settings. We can do several things to increase the overall security of the web browser. First, let's look at autofill. Notice that Use Contact Info is on. To increase security, we'll turn that off. In addition, Credit Cards is also on. We'll also turn that off. This option automatically fills out credit card information. We don't want to do that; so let's keep that off. Now we'll have to manually fill in contact and credit card information in various web forms. Autofill is a security challenge on a workstation in an office. It's a bigger problem on a mobile device. Let's look at one more thing. We'll go back up and tap Passwords & Accounts, on the right we might want to turn off AutoFill Passwords. That way if we lose this device, someone can't access sites by having the passwords automatically populated. We're done with this. Let's go back and go to the main Safari settings. Now we want to look at cookies. Scroll down. As you can see here under Privacy and Security, we have Cookies, and the Block All Cookies option. That's currently, that's turned off. That means that it will not block cookies. Let's turn that on. When we turn it on, we are asked, \"Hey, are you sure you want to block all cookies?\" Because if we do, some websites are not going to work and the existing cookies will be removed. Let's tap Block All Cookies, and say goodbye to them. Let's go back. Now we need to enable Fraudulent Website Warning. This is right below our Block All Cookies. This will warn us if we're visiting a site the browser thinks is a potentially fraudulent website. Right now, you can see it's turned off. Let's turn that on. If we scroll down and tap Advanced, we can see that JavaScript is currently on. This is one of those issues where you have to balance functionality and security, just like with the cookies. Having JavaScript enabled makes the browser on this device more functional, but it also opens up security issues. The general advice is to disable JavaScript. There will be sites that don't function properly, however, because it's commonly used in a lot of websites, but it does increase the security of the device. We can turn it off if we want to, so let's select to turn that off. The last thing we're going to do to secure Safari is to make sure that we're blocking pop-ups. When we look here, we can see Block pop-ups is not currently on. Let's go ahead and turn that on. That'll stop many of those annoying pop-up windows that are so common on the internet. It will help get rid of any of the annoying ads. Also, we want to prevent drive by downloads from occurring. At this point, the Safari web browser is much more secure than it was. In this demo, we talked about things you can do to secure email and the web browser on a mobile device. In this case, an iPad. We configured the POP3 or IMAP and SMTP protocols to secure communications between the web client and the web server using SSL. Then, we looked at what you can do to secure the Safari web browser on an iPad. We disabled autofill, we restricted cookies, we turned fraud warning on, and we turned JavaScript off. Then, we finished by turning on the pop-up blocker.",
  "chunks": [
    {
      "chunk_id": "10.9.6_chunk_1",
      "content": "In this demonstration, we'll show you techniques to secure accounts on an iPad, specifically email and web browsing. The web browser and email client on a mobile device, as with any computer, represent one of the most serious and most easily attacked vectors into the device. Just as you need to secure the web browser and email client on a Windows workstation, you need to secure them on mobile devices as well. Let's take a look at some things you can do. We're currently using an iPad to do this demonstration. For email, one of the key things we can do is use SSL to communicate with the mail server. This includes POP or IMAP servers, as well as the SMTP server. Let's look at how we do that.",
      "summary": "This section focuses on securing accounts on an iPad, emphasizing the importance of protecting email and web browsing, which are common attack vectors. Key techniques include using SSL for secure communication with mail servers (POP, IMAP, and SMTP) to enhance security. The demonstration highlights practical steps to ensure mobile device security, paralleling the security measures applied to traditional workstations.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.9.6",
        "title": "Securing Accounts on an iPad",
        "content_type": "video",
        "filename": "10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "word_count": 1083,
        "has_content": true
      },
      "section_header": "Secure Accounts on an iPad",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.9.6_chunk_2",
      "content": "Let's go into Settings. We'll scroll up to Passwords & Accounts Then we'll go into this Gmail account. To do that, we tap on the email address to get into the Account settings. At the bottom, there's an Advanced selection. Tap on Advanced. You can see that we are using SSL to encrypt communications between the mail client on this mobile device and the mail server. For this to work, the mail server for POP, IMAP, and SMTP, must be configured to support SSL. If it isn't, then turning this on won't accomplish anything. Remember that POP3, IMAP, and SMTP transmit clear text by default. So, using SSL greatly increases the security of your email communications. If you're using a mobile device to send email messages to someone through your mail server and you're not using SSL, then any sensitive proprietary information in that email is being transferred in clear text. It could be sniffed and read by almost anyone. Using SSL sets up an SSL tunnel between the email client and the mail server. The SSL tunnel secures message transmission through that tunnel. It is already enabled here.",
      "summary": "The \"Change Settings\" section emphasizes the importance of using SSL (Secure Sockets Layer) to encrypt email communications between mobile devices and mail servers, particularly for protocols like POP3, IMAP, and SMTP, which transmit data in clear text by default. Enabling SSL creates a secure tunnel that protects sensitive information from being intercepted during transmission. Proper configuration of the mail server is essential for SSL to function effectively, ensuring enhanced security for email communications.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.9.6",
        "title": "Securing Accounts on an iPad",
        "content_type": "video",
        "filename": "10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "word_count": 1083,
        "has_content": true
      },
      "section_header": "Change Settings",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.9.6_chunk_3",
      "content": "In addition to securing your email account, you also need to secure the web browser on a mobile device. Because we're using an iPad, Safari is the browser. Let's get out of the account and go to Safari Settings. We can do several things to increase the overall security of the web browser. First, let's look at autofill. Notice that Use Contact Info is on. To increase security, we'll turn that off. In addition, Credit Cards is also on. We'll also turn that off. This option automatically fills out credit card information. We don't want to do that; so let's keep that off. Now we'll have to manually fill in contact and credit card information in various web forms. Autofill is a security challenge on a workstation in an office. It's a bigger problem on a mobile device. Let's look at one more thing. We'll go back up and tap Passwords & Accounts, on the right we might want to turn off AutoFill Passwords. That way if we lose this device, someone can't access sites by having the passwords automatically populated. We're done with this. Let's go back and go to the main Safari settings. Now we want to look at cookies. Scroll down. As you can see here under Privacy and Security, we have Cookies, and the Block All Cookies option. That's currently, that's turned off. That means that it will not block cookies. Let's turn that on. When we turn it on, we are asked, \"Hey, are you sure you want to block all cookies?\" Because if we do, some websites are not going to work and the existing cookies will be removed. Let's tap Block All Cookies, and say goodbye to them. Let's go back. Now we need to enable Fraudulent Website Warning. This is right below our Block All Cookies. This will warn us if we're visiting a site the browser thinks is a potentially fraudulent website. Right now, you can see it's turned off. Let's turn that on. If we scroll down and tap Advanced, we can see that JavaScript is currently on. This is one of those issues where you have to balance functionality and security, just like with the cookies. Having JavaScript enabled makes the browser on this device more functional, but it also opens up security issues. The general advice is to disable JavaScript. There will be sites that don't function properly, however, because it's commonly used in a lot of websites, but it does increase the security of the device. We can turn it off if we want to, so let's select to turn that off. The last thing we're going to do to secure Safari is to make sure that we're blocking pop-ups. When we look here, we can see Block pop-ups is not currently on. Let's go ahead and turn that on. That'll stop many of those annoying pop-up windows that are so common on the internet. It will help get rid of any of the annoying ads. Also, we want to prevent drive by downloads from occurring. At this point, the Safari web browser is much more secure than it was.",
      "summary": "The \"Secure Safari\" section of the CompTIA Security+ course emphasizes enhancing the security of the Safari web browser on mobile devices, particularly iPads. Key practices include disabling autofill for contact and credit card information, blocking all cookies, enabling fraudulent website warnings, and managing JavaScript settings to balance functionality with security. Additionally, turning on pop-up blocking helps prevent unwanted ads and potential security threats, resulting in a more secure browsing experience.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.9.6",
        "title": "Securing Accounts on an iPad",
        "content_type": "video",
        "filename": "10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "word_count": 1083,
        "has_content": true
      },
      "section_header": "Secure Safari",
      "timestamp_range": ""
    },
    {
      "chunk_id": "10.9.6_chunk_4",
      "content": "In this demo, we talked about things you can do to secure email and the web browser on a mobile device. In this case, an iPad. We configured the POP3 or IMAP and SMTP protocols to secure communications between the web client and the web server using SSL. Then, we looked at what you can do to secure the Safari web browser on an iPad. We disabled autofill, we restricted cookies, we turned fraud warning on, and we turned JavaScript off. Then, we finished by turning on the pop-up blocker.",
      "summary": "This demo focused on securing email and web browsing on an iPad by configuring secure communication protocols like POP3, IMAP, and SMTP with SSL. Key security measures for the Safari browser included disabling autofill, restricting cookies, enabling fraud warnings, turning off JavaScript, and activating the pop-up blocker. These practical applications enhance user privacy and protect against potential online threats.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.9.6",
        "title": "Securing Accounts on an iPad",
        "content_type": "video",
        "filename": "10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.9.6_Securing_Accounts_on_an_iPad_[video].txt",
        "word_count": 1083,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 4
}