{
  "metadata": {
    "chapter_num": "2",
    "section_num": "2.1.6",
    "title": "Attack Surfaces",
    "content_type": "video",
    "filename": "2.1.6_Attack_Surfaces_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
    "word_count": 1236,
    "has_content": true
  },
  "full_content": "The attack surface is all the points at which a malicious threat actor could try to exploit a vulnerability. To evaluate the attack surface, you need to consider the attributes of threat actors that pose the most risk to your organization. From a threat actor's perspective, each part of the attack surface represents a potential vector for attempting an intrusion. A threat vector is the path that an attacker uses to execute a data exfiltration, service disruption, or disinformation attack. Sophisticated threat actors will make use of multiple vectors. In this lesson, we'll look at several of those vectors. Vulnerable software contains a flaw in its code or design that can be exploited to circumvent access control or to crash the process. Typically, vulnerabilities can only be exploited in specific circumstances and are often patched by the vendor. However, because of the complexity of modern software and the speed with which new versions must be released to market, almost no software is free from vulnerabilities. Organizations that might not have an effective patch management system are exposed to this commonly exploited threat vector. Vulnerable software continues to be an effective threat vector due to the continued use of unsupported systems and applications. An unsupported system is one where its vendor no longer develops updates and patches. Unless the organization is able to patch the faulty code itself, these services and apps will be highly vulnerable to exploits. One of the best ways to mitigate this risk is to isolate these systems. Scanning software helps organizations automate the discovery and classification of software vulnerabilities. This scanning software can be implemented as a client-based agent, where the agent runs as a scanning process installed on each host and reports to a management server. Alternatively, the vulnerability management product might use agentless techniques to scan a host without requiring any sort of installation. To execute malicious code on a system, a threat actor must be able to run exploit code on the system or over a network. Let's look at some specific threat vectors that can expose unsecured networks. Direct Access — when the threat actor uses physical access to the site or system to perpetrate an attack. Wired Network — when a threat actor with access to the site attaches an unauthorized device to a physical network port, and the device is permitted to communicate with other hosts. Remote and Wireless Network—when the attacker obtains credentials for a remote access or wireless connection to the network or cracks the security protocols used for authentication. Cloud Access—many companies now run part or all of their network services via internet-accessible clouds. The attacker only needs to find one account, service, or host with weak credentials to gain access. Some additional network vectors include the following: Bluetooth Network—a threat actor can exploit a vulnerability or misconfiguration to transmit a malicious file to a user's device over the Bluetooth personal area wireless networking protocol. Default Credentials—the attacker gains control of a network device or app because it has been left configured with a default password. Default credentials are likely to be published in the product's setup documentation or are otherwise easy to discover. Open Service Port—the threat actor is able to establish an unauthenticated connection to a logical TCP or UDP network port. The server will run an application to process network traffic arriving over the port. The software might be vulnerable to exploit code or to service disruption. A lure is something superficially attractive or interesting that causes its target to want it, even though it may be concealing something dangerous, like a hook. In cybersecurity terms, when the target opens the file bait, it delivers a malicious payload hook that'll typically give the threat actor control over the system or perform service disruption. A common lure attack involves removable devices. An attacker conceals malware on a USB thumb drive or memory card and tries to trick employees into connecting the media to a device. In a drop attack, the threat actor simply leaves infected USB sticks near offices with the expectation that at least one employee will pick one up and plug it into a computer. They can contain executable files concealing malware, word processing documents or PDF files with embedded malicious code, or image files with exploit code concealed in the image. File-based lures need a mechanism to deliver the file and a message that'll trick a user into opening the file on their computer. Consequently, any features that allow direct messaging to users must be considered as part of the potential attack surface. Message-based threats involve malicious activities carried out through different communication channels, such as email, short message services (SMS), and instant messaging. A common vector involves sending email messages with malicious file attachments or fake URLs, commonly referred to as phishing. The attacker also uses social engineering techniques to persuade or trick the user into opening the attachment or clicking on the URL. Another vector utilizes the Short Message Service (SMS) to send a file or a link to a mobile device using the text messaging handler built into smartphone firmware. This practice is called smishing, and it's difficult to monitor because it's operated by the handset or subscriber identity module (SIM) card provider. Attackers can also exploit instant messaging (IM) platforms to deliver malicious links, files, or messages, attempting to compromise devices or steal sensitive data. Web and Social Media sites provide yet another vector. Malware may be concealed in files attached to posts or presented as downloads. An attacker may compromise a site so that it automatically infects vulnerable browser software (a drive-by download). A supply chain is an end-to-end process of designing, manufacturing, and distributing goods and services to customers. Rather than attack a target organization directly, a threat actor may seek ways to infiltrate it via companies in its supply chain. Ensuring reliable sources of equipment and software is called procurement management. In procurement management, it's helpful to distinguish several types of relationships, such as suppliers, vendors, and business partners. Suppliers obtain products directly from a manufacturer to sell to other businesses. Vendors receive products from suppliers to sell to retail businesses or directly to customers. The term business partners implies a closer relationship where two companies share closely aligned goals and marketing opportunities. Each of these companies has its own supply chain. The supply chain breadth and complexity expose organizations to a huge attack surface. For example, a computer motherboard supply chain can include a chip manufacturer, firmware code developer, OEM reseller, courier delivery company, and administrative staff responsible for provisioning the computing device to the end user. Anyone with the time and resources to modify the computer's firmware could create backdoor access. The same applies to any computer or network hardware, software, or service. Well, that's it for this lesson. In this lesson, we introduced you to multiple attack surface vectors including Vulnerable software vectors, Network Vectors, Lure-based Vectors, Message-based Vectors, and Supply Chain Vectors. Understanding the methods by which threat actors infiltrate networks and systems is essential for you to assess the attack surface of your networks and deploy controls to block attack vectors.",
  "chunks": [
    {
      "chunk_id": "2.1.6_chunk_1",
      "content": "The attack surface is all the points at which a malicious threat actor could try to exploit a vulnerability. To evaluate the attack surface, you need to consider the attributes of threat actors that pose the most risk to your organization. From a threat actor's perspective, each part of the attack surface represents a potential vector for attempting an intrusion. A threat vector is the path that an attacker uses to execute a data exfiltration, service disruption, or disinformation attack. Sophisticated threat actors will make use of multiple vectors. In this lesson, we'll look at several of those vectors.",
      "summary": "An attack surface encompasses all potential exploitation points where threat actors can target organizational vulnerabilities through various threat vectors - the specific paths used to execute data exfiltration, service disruption, or disinformation attacks. Security professionals must evaluate attack surfaces by analyzing threat actor attributes and capabilities, as sophisticated attackers typically employ multiple vectors simultaneously to maximize their intrusion potential.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Attack Surfaces",
      "timestamp_range": "00:00-00:39"
    },
    {
      "chunk_id": "2.1.6_chunk_2",
      "content": "Vulnerable software contains a flaw in its code or design that can be exploited to circumvent access control or to crash the process. Typically, vulnerabilities can only be exploited in specific circumstances and are often patched by the vendor. However, because of the complexity of modern software and the speed with which new versions must be released to market, almost no software is free from vulnerabilities. Organizations that might not have an effective patch management system are exposed to this commonly exploited threat vector.",
      "summary": "Vulnerable software contains exploitable flaws in code or design that attackers can use to bypass access controls or crash systems, with vulnerabilities typically exploitable under specific circumstances and requiring vendor patches. Modern software complexity and rapid release cycles make vulnerabilities nearly inevitable, creating a commonly exploited threat vector for organizations lacking effective patch management systems. Organizations must implement robust patch management processes to mitigate this attack surface and reduce exposure to software-based security threats.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Vulnerable Software Vectors",
      "timestamp_range": "00:39-01:13"
    },
    {
      "chunk_id": "2.1.6_chunk_3",
      "content": "Vulnerable software continues to be an effective threat vector due to the continued use of unsupported systems and applications. An unsupported system is one where its vendor no longer develops updates and patches. Unless the organization is able to patch the faulty code itself, these services and apps will be highly vulnerable to exploits. One of the best ways to mitigate this risk is to isolate these systems.",
      "summary": "Unsupported systems and applications create significant security vulnerabilities because vendors no longer provide security updates or patches, leaving organizations exposed to exploits unless they can patch code internally. The primary mitigation strategy for these legacy systems is network isolation to reduce attack surface exposure and limit potential breach impact.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Unsupported Systems and Applications",
      "timestamp_range": "01:13-01:39"
    },
    {
      "chunk_id": "2.1.6_chunk_4",
      "content": "Scanning software helps organizations automate the discovery and classification of software vulnerabilities. This scanning software can be implemented as a client-based agent, where the agent runs as a scanning process installed on each host and reports to a management server. Alternatively, the vulnerability management product might use agentless techniques to scan a host without requiring any sort of installation. To execute malicious code on a system, a threat actor must be able to run exploit code on the system or over a network.",
      "summary": "Vulnerability scanning software automates the discovery and classification of security vulnerabilities using either client-based agents installed on each host that report to a management server, or agentless techniques that scan systems remotely without requiring software installation. Threat actors exploit vulnerabilities by executing malicious code either directly on target systems or through network-based attacks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Client-Based vs. Agentless",
      "timestamp_range": "01:39-02:06"
    },
    {
      "chunk_id": "2.1.6_chunk_5",
      "content": "Let's look at some specific threat vectors that can expose unsecured networks. Direct Access — when the threat actor uses physical access to the site or system to perpetrate an attack. Wired Network — when a threat actor with access to the site attaches an unauthorized device to a physical network port, and the device is permitted to communicate with other hosts. Remote and Wireless Network—when the attacker obtains credentials for a remote access or wireless connection to the network or cracks the security protocols used for authentication. Cloud Access—many companies now run part or all of their network services via internet-accessible clouds. The attacker only needs to find one account, service, or host with weak credentials to gain access. Some additional network vectors include the following: Bluetooth Network—a threat actor can exploit a vulnerability or misconfiguration to transmit a malicious file to a user's device over the Bluetooth personal area wireless networking protocol. Default Credentials—the attacker gains control of a network device or app because it has been left configured with a default password. Default credentials are likely to be published in the product's setup documentation or are otherwise easy to discover. Open Service Port—the threat actor is able to establish an unauthenticated connection to a logical TCP or UDP network port. The server will run an application to process network traffic arriving over the port. The software might be vulnerable to exploit code or to service disruption.",
      "summary": "Network attack vectors include direct physical access, unauthorized wired device connections, compromised remote/wireless credentials, and vulnerable cloud services with weak authentication. Additional threats emerge from Bluetooth exploits, default passwords left unchanged on network devices, and open service ports that allow unauthenticated connections to potentially vulnerable applications. These vectors represent common entry points where attackers exploit physical access, weak credentials, or misconfigured network services to gain unauthorized system access.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Network Vectors",
      "timestamp_range": "02:06-03:57"
    },
    {
      "chunk_id": "2.1.6_chunk_6",
      "content": "A lure is something superficially attractive or interesting that causes its target to want it, even though it may be concealing something dangerous, like a hook. In cybersecurity terms, when the target opens the file bait, it delivers a malicious payload hook that'll typically give the threat actor control over the system or perform service disruption. A common lure attack involves removable devices. An attacker conceals malware on a USB thumb drive or memory card and tries to trick employees into connecting the media to a device. In a drop attack, the threat actor simply leaves infected USB sticks near offices with the expectation that at least one employee will pick one up and plug it into a computer. They can contain executable files concealing malware, word processing documents or PDF files with embedded malicious code, or image files with exploit code concealed in the image.",
      "summary": "Lure-based attacks use superficially attractive bait to conceal malicious payloads that deliver system control or service disruption when targets interact with the content. Drop attacks involve threat actors leaving infected USB devices near offices, expecting employees to connect them to systems, delivering malware through executable files, documents with embedded code, or exploited image files. These removable media attacks exploit human curiosity to bypass technical security controls and establish initial system access.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Lure-Based Vectors",
      "timestamp_range": "03:57-04:54"
    },
    {
      "chunk_id": "2.1.6_chunk_7",
      "content": "File-based lures need a mechanism to deliver the file and a message that'll trick a user into opening the file on their computer. Consequently, any features that allow direct messaging to users must be considered as part of the potential attack surface. Message-based threats involve malicious activities carried out through different communication channels, such as email, short message services (SMS), and instant messaging. A common vector involves sending email messages with malicious file attachments or fake URLs, commonly referred to as phishing. The attacker also uses social engineering techniques to persuade or trick the user into opening the attachment or clicking on the URL. Another vector utilizes the Short Message Service (SMS) to send a file or a link to a mobile device using the text messaging handler built into smartphone firmware. This practice is called smishing, and it's difficult to monitor because it's operated by the handset or subscriber identity module (SIM) card provider. Attackers can also exploit instant messaging (IM) platforms to deliver malicious links, files, or messages, attempting to compromise devices or steal sensitive data. Web and Social Media sites provide yet another vector. Malware may be concealed in files attached to posts or presented as downloads. An attacker may compromise a site so that it automatically infects vulnerable browser software (a drive-by download).",
      "summary": "Message-based attack vectors exploit communication channels including email phishing with malicious attachments/URLs, SMS smishing targeting mobile devices, instant messaging platforms, and compromised web/social media sites delivering drive-by downloads. These attacks combine file-based lures with social engineering techniques to trick users into executing malicious content, making any direct messaging feature a potential attack surface. Organizations must monitor and secure all communication channels as attackers leverage trusted messaging platforms to bypass traditional security controls and deliver malware or steal sensitive data.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Message-Based Vectors",
      "timestamp_range": "04:54-06:29"
    },
    {
      "chunk_id": "2.1.6_chunk_8",
      "content": "A supply chain is an end-to-end process of designing, manufacturing, and distributing goods and services to customers. Rather than attack a target organization directly, a threat actor may seek ways to infiltrate it via companies in its supply chain. Ensuring reliable sources of equipment and software is called procurement management. In procurement management, it's helpful to distinguish several types of relationships, such as suppliers, vendors, and business partners. Suppliers obtain products directly from a manufacturer to sell to other businesses. Vendors receive products from suppliers to sell to retail businesses or directly to customers. The term business partners implies a closer relationship where two companies share closely aligned goals and marketing opportunities. Each of these companies has its own supply chain. The supply chain breadth and complexity expose organizations to a huge attack surface. For example, a computer motherboard supply chain can include a chip manufacturer, firmware code developer, OEM reseller, courier delivery company, and administrative staff responsible for provisioning the computing device to the end user. Anyone with the time and resources to modify the computer's firmware could create backdoor access. The same applies to any computer or network hardware, software, or service.",
      "summary": "Supply chain attacks target organizations indirectly by compromising suppliers, vendors, or business partners in the end-to-end process of designing, manufacturing, and distributing goods and services. The complex network of relationships from chip manufacturers to delivery companies creates an extensive attack surface where threat actors can insert backdoors or malicious code into hardware, software, or services. Effective procurement management requires organizations to ensure reliable sources and assess security risks across all supply chain partners to prevent infiltration through these third-party vectors.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Supply Chain Vectors",
      "timestamp_range": "06:29-07:50"
    },
    {
      "chunk_id": "2.1.6_chunk_9",
      "content": "Well, that's it for this lesson. In this lesson, we introduced you to multiple attack surface vectors including Vulnerable software vectors, Network Vectors, Lure-based Vectors, Message-based Vectors, and Supply Chain Vectors. Understanding the methods by which threat actors infiltrate networks and systems is essential for you to assess the attack surface of your networks and deploy controls to block attack vectors.",
      "summary": "This lesson covered five critical attack surface vectors that security professionals must understand: Vulnerable Software, Network, Lure-based, Message-based, and Supply Chain vectors. Understanding these attack methods enables effective assessment of organizational attack surfaces and deployment of appropriate security controls to block threat actor infiltration attempts. Mastering attack vector identification is essential for implementing proactive defense strategies against network and system compromises.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.1.6",
        "title": "Attack Surfaces",
        "content_type": "video",
        "filename": "2.1.6_Attack_Surfaces_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.1.6_Attack_Surfaces_[video].txt",
        "word_count": 1236,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "07:50-08:18"
    }
  ],
  "num_chunks": 9,
  "document_summary": "Attack Surfaces (video): Remote and Wireless Network—when the attacker obtains credentials for a remote access or wireless connection to the network or cracks the security protocols used for authentication. In cybersecurity terms, when the target opens the file bait, it delivers a malicious payload hook that'll typically give the threat actor control over the system or perform service disruption. Understanding the methods by which threat actors infiltrate networks and systems is essential for you to assess the attack surface of your networks and deploy controls to block attack vectors."
}