{
  "metadata": {
    "chapter_num": "2",
    "section_num": "2.2.6",
    "title": "Investigating a Social Engineering Attack",
    "content_type": "video",
    "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
    "word_count": 1194,
    "has_content": true
  },
  "full_content": "In this demonstration, we'll talk about investigating a social engineering attack. We're going to focus on identifying the validity of emails, identifying the validity of websites, and identifying virus hoaxes. Let's take a look at email validity. You should always be wary of emails from unknown organizations or senders. Be careful opening them, and be even more cautious with their attachments. A lot of hoax emails are pretty easy to spot because of their bad spelling and terrible grammar, but some of them look very, very real. Let's take a look at a couple of examples. Let's start with this first one, Final Notice, Postal Status Notification. The first clue is the return address. It's from a variation of a Walmart address. It could be legit, but I'm not so sure. Next is the logo. It has a logo with a question mark after the word Walmart. I've never seen a Walmart logo like this, so I really wouldn't have to go any further to know it's a fake. If I hover over the logo, a bunch of addresses pop up. This looks like a batch of addresses that were spammed from this email. A little lower, when I hover over the Update Your Address Here link, I see a bunch more addresses. No legitimate email is going to be formatted to do this. Finally, here, it tells me to hurry, or I'll lose 17% of the money owed to me. Let's look at this other one, the Check Your Account email. The address looks a bit odd. That's always the first clue. They want to confirm my information. I've never heard of this company, and I don't gamble, so within a second, I know this is fake. These links down here are Bitl.ly, which is a URL shortening service. I don't think most legitimate emails would use a shortening service like this. Then we have another email that I took a screenshot of. It's this Attention email that says it's from usafed.gov. This is someone posing as somebody from the US Treasury. They're using a Gmail address for communication, which the government wouldn't do. At the bottom of the email, they've listed the legitimate website for the Department of the Treasury to make you think this is a legitimate email. Another way you can verify an email is by taking a look at the header information. I have my Walmart email opened up in Outlook. This is another way to verify an email and its content. The header information is helpful because it shows IP information for the path an email took from its origin to the destination. It also shows other information, like the mail client that was used, the actual email address of the sender, and the originating IP address of the email. There are a few ways to look at header information. In Outlook, it's helpful, but not easy to read. If we go into File > Properties, you can see the header information right here. As you can tell, this can't be resized, and it's hard to read in this format. The mail client in Windows 10 doesn't have a way to view header information, but don't worry. You can view header information by opening the email in a text editor like I've done with Notepad++. By looking through the email in this format, you can pick out many things about its origin and determine whether it's legitimate. Remember, this email was supposed to be from Walmart. Here's the sender's originating IP. If we highlight this address and copy it, we can actually look up some information on that IP address to see where it's coming from. All internet IP addresses for users come from some ISP somewhere. We can go to a website called arin.net, go to the search, and paste in our address. It'll find some information about this IP address. There are services that you can pay for that will give you a lot more information, but this one is free and simple. Looking at this information, I'm very skeptical that this email came from Walmart because the mailing address for this IP is from France. Another thing we want to talk about is verifying websites. The first thing that you should always do is double-check the spelling of the website you're navigating to. If you're trying to go to PayPal and the address you end up at is paypals.com (with an s) or paypal.fakesight.com, then you're likely in the wrong place. You could accidentally give away your login information for PayPal (or a similar site) by entering it into a false site. You could also verify a site by viewing the SSL certification information. An SSL certificate (Secure Sockets Layer certificate) is a digital certificate that authenticates the identity of a website and encrypts the information sent to its server using SSL technology. Let's look at two different browsers, Google Chrome and the Microsoft Edge browser. If we open both of these, there's a slight difference in how the SSL certificates are shown. In the Chrome browser, if you click on the lock in the address bar, it shows information about the certificate. I see that it's issued to google.com. I have a few tabs up here, Details and Certification Path. Under Certification Path, I see more information about the Certificate Authority and the certificate. Now, if you go to Edge, open up Gmail, and click on the little lock, it'll show you the same information, but in a slightly different format. If there's no lock and no SSL certificate, you should be a little more cautious. Certificates aren't the focus of this lesson, but you want to make sure you know how to verify certificate information when you're not sure about a website. Our last topic is identifying virus hoaxes. You've probably seen something like this before. Maybe one of your coworkers has come to you in a panic, worried about this type of error, and it's obviously very alarming. It's meant to be; this hoax is designed to scare or intimidate users into thinking they've contracted some type of virus. Normally, it says it's something like a Trojan, as you can see here. Often, there's a number you can call where they'll take payment over the phone for fixing the virus, but they never actually do anything. There have been similar hoaxes that use the same tactics, so it's good to understand that viruses don't usually want to be discovered. Unless you're being notified by a trusted antivirus software that you or your administrator has installed, then it's probably just a hoax. That's it for this lesson. We discussed verifying emails by looking at the HTML version and header information. We talked about verifying that a website is correct by checking the spelling of the address and the presence of a valid SSL certificate. We finished by discussing virus hoaxes.",
  "chunks": [
    {
      "chunk_id": "2.2.6_chunk_1",
      "content": "In this demonstration, we'll talk about investigating a social engineering attack. We're going to focus on identifying the validity of emails, identifying the validity of websites, and identifying virus hoaxes.",
      "summary": "This section covers the investigation of social engineering attacks, emphasizing the importance of verifying the authenticity of emails and websites to prevent deception. It also addresses the identification of virus hoaxes, equipping learners with practical skills to discern legitimate communications from malicious attempts. Understanding these concepts is crucial for enhancing cybersecurity awareness and protecting sensitive information.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Investigating a Social Engineering Attack",
      "timestamp_range": "00:00-00:16"
    },
    {
      "chunk_id": "2.2.6_chunk_2",
      "content": "Let's take a look at email validity. You should always be wary of emails from unknown organizations or senders. Be careful opening them, and be even more cautious with their attachments. A lot of hoax emails are pretty easy to spot because of their bad spelling and terrible grammar, but some of them look very, very real. Let's take a look at a couple of examples. Let's start with this first one, Final Notice, Postal Status Notification. The first clue is the return address. It's from a variation of a Walmart address. It could be legit, but I'm not so sure. Next is the logo. It has a logo with a question mark after the word Walmart. I've never seen a Walmart logo like this, so I really wouldn't have to go any further to know it's a fake. If I hover over the logo, a bunch of addresses pop up. This looks like a batch of addresses that were spammed from this email. A little lower, when I hover over the Update Your Address Here link, I see a bunch more addresses. No legitimate email is going to be formatted to do this. Finally, here, it tells me to hurry, or I'll lose 17% of the money owed to me. Let's look at this other one, the Check Your Account email. The address looks a bit odd. That's always the first clue. They want to confirm my information. I've never heard of this company, and I don't gamble, so within a second, I know this is fake. These links down here are Bitl.ly, which is a URL shortening service. I don't think most legitimate emails would use a shortening service like this. Then we have another email that I took a screenshot of. It's this Attention email that says it's from usafed.gov. This is someone posing as somebody from the US Treasury. They're using a Gmail address for communication, which the government wouldn't do. At the bottom of the email, they've listed the legitimate website for the Department of the Treasury to make you think this is a legitimate email.",
      "summary": "The \"Email Hoaxes\" section of the CompTIA Security+ course emphasizes the importance of verifying the authenticity of emails, particularly from unknown senders. Key indicators of hoax emails include suspicious sender addresses, poor grammar, unusual logos, and the use of URL shortening services. Practical applications involve scrutinizing email elements such as return addresses and links to avoid falling victim to phishing attempts and scams.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Email Hoaxes",
      "timestamp_range": "00:16-02:04"
    },
    {
      "chunk_id": "2.2.6_chunk_3",
      "content": "Another way you can verify an email is by taking a look at the header information. I have my Walmart email opened up in Outlook. This is another way to verify an email and its content. The header information is helpful because it shows IP information for the path an email took from its origin to the destination. It also shows other information, like the mail client that was used, the actual email address of the sender, and the originating IP address of the email. There are a few ways to look at header information. In Outlook, it's helpful, but not easy to read. If we go into File > Properties, you can see the header information right here. As you can tell, this can't be resized, and it's hard to read in this format. The mail client in Windows 10 doesn't have a way to view header information, but don't worry. You can view header information by opening the email in a text editor like I've done with Notepad++.",
      "summary": "Email header information is a crucial tool for verifying the authenticity of an email, as it reveals the path taken by the email, the sender's actual email address, and the originating IP address. While Outlook provides access to this information through File > Properties, it can be difficult to read; using a text editor like Notepad++ offers a clearer view. Understanding how to analyze email headers enhances security awareness and helps identify potential phishing attempts.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Header Information",
      "timestamp_range": "02:04-03:02"
    },
    {
      "chunk_id": "2.2.6_chunk_4",
      "content": "By looking through the email in this format, you can pick out many things about its origin and determine whether it's legitimate. Remember, this email was supposed to be from Walmart. Here's the sender's originating IP. If we highlight this address and copy it, we can actually look up some information on that IP address to see where it's coming from.",
      "summary": "This section emphasizes the importance of analyzing email headers to verify the legitimacy of an email's origin, using a practical example of an email purportedly from Walmart. By examining the sender's originating IP address, learners can investigate its source to assess potential phishing attempts or fraudulent communications. This skill is essential for enhancing cybersecurity awareness and protecting against email-based threats.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "View Header in Text Editor",
      "timestamp_range": "03:02-03:20"
    },
    {
      "chunk_id": "2.2.6_chunk_5",
      "content": "All internet IP addresses for users come from some ISP somewhere. We can go to a website called arin.net, go to the search, and paste in our address. It'll find some information about this IP address. There are services that you can pay for that will give you a lot more information, but this one is free and simple. Looking at this information, I'm very skeptical that this email came from Walmart because the mailing address for this IP is from France.",
      "summary": "The IP Lookup section teaches users how to identify the origin of an IP address using free tools like arin.net, which provides basic information about the address's ISP. This practical application helps in verifying the legitimacy of communications, such as emails, by cross-referencing IP details with expected locations, highlighting potential security concerns like phishing attempts. Understanding IP address origins is essential for enhancing cybersecurity awareness and response.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "IP Lookup",
      "timestamp_range": "03:20-03:47"
    },
    {
      "chunk_id": "2.2.6_chunk_6",
      "content": "Another thing we want to talk about is verifying websites. The first thing that you should always do is double-check the spelling of the website you're navigating to. If you're trying to go to PayPal and the address you end up at is paypals.com (with an s) or paypal.fakesight.com, then you're likely in the wrong place. You could accidentally give away your login information for PayPal (or a similar site) by entering it into a false site. You could also verify a site by viewing the SSL certification information. An SSL certificate (Secure Sockets Layer certificate) is a digital certificate that authenticates the identity of a website and encrypts the information sent to its server using SSL technology. Let's look at two different browsers, Google Chrome and the Microsoft Edge browser. If we open both of these, there's a slight difference in how the SSL certificates are shown. In the Chrome browser, if you click on the lock in the address bar, it shows information about the certificate. I see that it's issued to google.com. I have a few tabs up here, Details and Certification Path. Under Certification Path, I see more information about the Certificate Authority and the certificate. Now, if you go to Edge, open up Gmail, and click on the little lock, it'll show you the same information, but in a slightly different format. If there's no lock and no SSL certificate, you should be a little more cautious. Certificates aren't the focus of this lesson, but you want to make sure you know how to verify certificate information when you're not sure about a website.",
      "summary": "The \"Website Validity\" section emphasizes the importance of verifying website authenticity to avoid phishing scams and data theft. Key practices include checking the spelling of URLs and examining SSL certificates, which authenticate a website's identity and encrypt data. The section also highlights differences in how browsers like Google Chrome and Microsoft Edge display SSL information, underscoring the need for users to be cautious when a site lacks a secure connection.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Website Validity",
      "timestamp_range": "03:47-05:22"
    },
    {
      "chunk_id": "2.2.6_chunk_7",
      "content": "Our last topic is identifying virus hoaxes. You've probably seen something like this before. Maybe one of your coworkers has come to you in a panic, worried about this type of error, and it's obviously very alarming. It's meant to be; this hoax is designed to scare or intimidate users into thinking they've contracted some type of virus. Normally, it says it's something like a Trojan, as you can see here. Often, there's a number you can call where they'll take payment over the phone for fixing the virus, but they never actually do anything. There have been similar hoaxes that use the same tactics, so it's good to understand that viruses don't usually want to be discovered. Unless you're being notified by a trusted antivirus software that you or your administrator has installed, then it's probably just a hoax.",
      "summary": "This section focuses on recognizing virus hoaxes, which are deceptive messages designed to instill fear and prompt users to take unnecessary actions, such as paying for nonexistent virus removal services. It emphasizes the importance of relying on trusted antivirus software notifications rather than succumbing to alarming claims. Understanding these hoaxes is crucial for maintaining cybersecurity awareness and preventing potential scams.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Virus Hoaxes",
      "timestamp_range": "05:22-06:08"
    },
    {
      "chunk_id": "2.2.6_chunk_8",
      "content": "That's it for this lesson. We discussed verifying emails by looking at the HTML version and header information. We talked about verifying that a website is correct by checking the spelling of the address and the presence of a valid SSL certificate. We finished by discussing virus hoaxes.",
      "summary": "In this lesson, we covered essential techniques for verifying the authenticity of emails and websites, including examining HTML versions, header information, and ensuring the presence of a valid SSL certificate. Additionally, we addressed the importance of recognizing virus hoaxes to prevent misinformation. These practices are crucial for maintaining cybersecurity and protecting against phishing attacks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.6",
        "title": "Investigating a Social Engineering Attack",
        "content_type": "video",
        "filename": "2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.6_Investigating_a_Social_Engineering_Attack_[video].txt",
        "word_count": 1194,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "06:08-06:26"
    }
  ],
  "num_chunks": 8
}