{
  "metadata": {
    "chapter_num": "2",
    "section_num": "2.2.3",
    "title": "Social Engineering Techniques",
    "content_type": "video",
    "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
    "word_count": 956,
    "has_content": true
  },
  "full_content": "Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of people. Employees, contractors, suppliers, and customers represent part of the attack surface of any organization. Collectively, they're part of the attack surface referred to as the human vector. Social engineering refers to eliciting information from someone or getting them to perform some action for the threat actor. It can also be referred to as \"hacking the human.\" We'll look at some common vectors that highlight how cybercriminals exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or other goals. Knowing these techniques will help you to develop policies and other security controls to mitigate these risks. Phishing is a combination of social engineering and spoofing. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection. Other types of phishing campaigns use a spoofed website set up to imitate a bank, e?commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the real website indicating their account must be updated or with a hoax alert or alarm, supplying a link to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured. Another variation on phishing is called smishing which uses SMS, or text messages instead of email. It's more difficult to determine if the links are spoofed due to the reduced screen and functionality. However, direct messages to a single contact have a high chance of failure. Next is vishing, short for \"voice phishing,\" which uses phone calls or voice messages to manipulate individuals under the guise of a trusted entity. One high-profile example happened in 2021 when a branch manager received a call that he thought was from his director asking him to transfer $35 million for an acquisition. The voice on the phone sounded just like his director but was a computer-generated voice. The next vector is impersonation, which simply means pretending to be someone else. It's one of the basic social engineering techniques. Impersonation is possible when the target can't easily verify the attacker's identity, such as over the phone or via an email message. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password. To make the impersonation more credible, hackers will utilize pretexting. This attack vector involves creating a fabricated scenario (pretext) where they carefully craft a story with convincing or intimidating details. To be successful, they depend on obtaining privileged information about their target. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation. Another technique that overlaps with impersonation and pretexting is brand impersonation. Brand impersonation occurs when attackers create fake websites, emails, or social media profiles that mimic a legitimate brand's online presence. These fake assets are used to deceive individuals into providing personal information or credentials. Business email compromise (BEC) is a more sophisticated variation of phishing that also employs impersonation. BEC refers to a sophisticated campaign that targets a specific individual within a company, typically an executive. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them. Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation. A watering hole attack relies on a group of targets that use an unsecured third-party website. For example, a threat actor might discover that the staff running an international e-commerce site might use a local pizza delivery firm. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company's systems. Typosquatting means that the threat actor registers a domain name very similar to a real one, such as exannple.com, hoping that users won't notice the difference and assume they're browsing a trusted site or receiving email from a known source. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it. Well, that's it for this lesson. In this lesson, we looked at various ways that cybercriminals exploit human vectors that play on human nature through social engineering. The best defense against these types of attacks is training. Individuals and organizations that understand these methods will be more vigilant and less likely to fall prey to the attackers.",
  "chunks": [
    {
      "chunk_id": "2.2.3_chunk_1",
      "content": "Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of people. Employees, contractors, suppliers, and customers represent part of the attack surface of any organization. Collectively, they're part of the attack surface referred to as the human vector. Social engineering refers to eliciting information from someone or getting them to perform some action for the threat actor. It can also be referred to as \"hacking the human.\" We'll look at some common vectors that highlight how cybercriminals exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or other goals. Knowing these techniques will help you to develop policies and other security controls to mitigate these risks.",
      "summary": "Social engineering is a cyberattack technique that exploits human psychology to obtain sensitive information or manipulate people into performing actions that compromise security systems. Employees, contractors, suppliers, and customers form the \"human vector\" attack surface that threat actors target through various communication channels to gain unauthorized access or steal data. Understanding these social engineering techniques enables organizations to develop effective security policies and controls to mitigate human-based security risks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Social Engineering",
      "timestamp_range": "00:00-00:56"
    },
    {
      "chunk_id": "2.2.3_chunk_2",
      "content": "Phishing is a combination of social engineering and spoofing. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection. Other types of phishing campaigns use a spoofed website set up to imitate a bank, e?commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the real website indicating their account must be updated or with a hoax alert or alarm, supplying a link to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured.",
      "summary": "Phishing combines social engineering and spoofing techniques to deceive users into performing malicious actions like installing malware, enabling remote access, or entering credentials on fraudulent websites that imitate trusted services. Attackers typically send deceptive emails with urgent account update requests or fake security alerts containing links to spoofed sites designed to capture login credentials. This attack method exploits user trust in legitimate organizations to steal sensitive authentication information and gain unauthorized access to accounts.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Phishing",
      "timestamp_range": "00:56-01:32"
    },
    {
      "chunk_id": "2.2.3_chunk_3",
      "content": "Another variation on phishing is called smishing which uses SMS, or text messages instead of email. It's more difficult to determine if the links are spoofed due to the reduced screen and functionality. However, direct messages to a single contact have a high chance of failure.",
      "summary": "Smishing is a social engineering attack that uses SMS text messages instead of email to deliver phishing attempts, making it harder for victims to identify spoofed links due to mobile devices' limited screen size and functionality. This attack method exploits the constraints of mobile interfaces to deceive users into clicking malicious links. Direct messaging to individual contacts reduces the attack's success rate compared to mass distribution methods.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Smishing",
      "timestamp_range": "01:32-01:48"
    },
    {
      "chunk_id": "2.2.3_chunk_4",
      "content": "Next is vishing, short for \"voice phishing,\" which uses phone calls or voice messages to manipulate individuals under the guise of a trusted entity. One high-profile example happened in 2021 when a branch manager received a call that he thought was from his director asking him to transfer $35 million for an acquisition. The voice on the phone sounded just like his director but was a computer-generated voice.",
      "summary": "Vishing (voice phishing) is a social engineering attack that uses phone calls or voice messages to impersonate trusted entities and manipulate victims into unauthorized actions. Attackers can now use computer-generated voices that convincingly mimic real people, as demonstrated in a 2021 case where a branch manager was tricked into transferring $35 million by a fake director's voice. Organizations must implement voice verification protocols and train employees to authenticate high-risk requests through alternative communication channels.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Vishing",
      "timestamp_range": "01:48-02:12"
    },
    {
      "chunk_id": "2.2.3_chunk_5",
      "content": "The next vector is impersonation, which simply means pretending to be someone else. It's one of the basic social engineering techniques. Impersonation is possible when the target can't easily verify the attacker's identity, such as over the phone or via an email message. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password.",
      "summary": "Impersonation is a social engineering technique where attackers pretend to be someone else to gain unauthorized access, typically exploiting situations where identity verification is difficult such as phone calls or emails. The classic attack involves calling employees, claiming to be IT support needing remote system access, and tricking users into revealing their passwords. This technique succeeds because targets cannot easily verify the caller's true identity through voice-only or text-based communication channels.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Impersonation",
      "timestamp_range": "02:12-02:38"
    },
    {
      "chunk_id": "2.2.3_chunk_6",
      "content": "To make the impersonation more credible, hackers will utilize pretexting. This attack vector involves creating a fabricated scenario (pretext) where they carefully craft a story with convincing or intimidating details. To be successful, they depend on obtaining privileged information about their target. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation.",
      "summary": "Pretexting is a social engineering attack where hackers create fabricated scenarios with convincing details to make impersonation attacks more credible and successful. Attackers leverage seemingly harmless organizational information like employee lists, job titles, phone numbers, and internal documents to craft believable stories that enable unauthorized access. This technique depends on gathering privileged target information to build trust and bypass security controls through deceptive storytelling.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Pretexting",
      "timestamp_range": "02:38-03:09"
    },
    {
      "chunk_id": "2.2.3_chunk_7",
      "content": "Another technique that overlaps with impersonation and pretexting is brand impersonation. Brand impersonation occurs when attackers create fake websites, emails, or social media profiles that mimic a legitimate brand's online presence. These fake assets are used to deceive individuals into providing personal information or credentials.",
      "summary": "Brand impersonation is a social engineering attack where cybercriminals create fraudulent websites, emails, or social media profiles that replicate legitimate company branding to deceive victims into surrendering personal information or login credentials. This technique combines elements of impersonation and pretexting to exploit user trust in recognizable brands. Organizations and individuals must verify authentic communication channels and scrutinize brand communications for subtle inconsistencies to prevent credential theft and data compromise.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Brand Impersonation",
      "timestamp_range": "03:09-03:29"
    },
    {
      "chunk_id": "2.2.3_chunk_8",
      "content": "Business email compromise (BEC) is a more sophisticated variation of phishing that also employs impersonation. BEC refers to a sophisticated campaign that targets a specific individual within a company, typically an executive. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them.",
      "summary": "Business Email Compromise (BEC) is a sophisticated phishing attack that targets specific company executives through impersonation and compromised legitimate email accounts. Threat actors conduct extensive reconnaissance on targets to develop psychological manipulation tactics and convincing pretexts. This high-stakes social engineering technique combines account takeover with targeted spear-phishing to exploit executive-level access and authority.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Business Email Compromise (BEC)",
      "timestamp_range": "03:29-04:01"
    },
    {
      "chunk_id": "2.2.3_chunk_9",
      "content": "Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation.",
      "summary": "Disinformation involves deliberately spreading false information to deceive targets, while misinformation refers to unknowingly sharing false claims without malicious intent. Attackers use disinformation tactics to create fake social media posts and fraudulent referrer sites that boost search rankings and legitimacy. Security professionals must recognize that disinformation campaigns often succeed by converting intentional lies into widespread misinformation through unwitting amplification by others.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Disinformation and Misinformation",
      "timestamp_range": "04:01-04:28"
    },
    {
      "chunk_id": "2.2.3_chunk_10",
      "content": "A watering hole attack relies on a group of targets that use an unsecured third-party website. For example, a threat actor might discover that the staff running an international e-commerce site might use a local pizza delivery firm. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company's systems.",
      "summary": "A watering hole attack targets organizations by compromising third-party websites frequently visited by their employees, allowing attackers to deliver exploit code and malware to specific user groups. Threat actors identify commonly used external sites (like local service providers) accessed by target company staff, then compromise these sites to serve as infection vectors. This social engineering technique enables lateral movement from infected employee devices into the primary target organization's network infrastructure.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Watering Hole",
      "timestamp_range": "04:28-04:55"
    },
    {
      "chunk_id": "2.2.3_chunk_11",
      "content": "Typosquatting means that the threat actor registers a domain name very similar to a real one, such as exannple.com, hoping that users won't notice the difference and assume they're browsing a trusted site or receiving email from a known source. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it.",
      "summary": "Typosquatting is a social engineering attack where threat actors register domain names with slight misspellings or variations of legitimate domains to deceive users into trusting fraudulent websites or emails. Attackers also exploit trusted cloud provider domains by registering hijacked subdomains that appear legitimate to users. This technique relies on users not carefully examining domain names and assuming communications are from trusted sources.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Typosquatting",
      "timestamp_range": "04:55-05:24"
    },
    {
      "chunk_id": "2.2.3_chunk_12",
      "content": "Well, that's it for this lesson. In this lesson, we looked at various ways that cybercriminals exploit human vectors that play on human nature through social engineering. The best defense against these types of attacks is training. Individuals and organizations that understand these methods will be more vigilant and less likely to fall prey to the attackers.",
      "summary": "Social engineering attacks exploit human psychology and behavior to compromise security, making individuals the weakest link in cybersecurity defenses. The most effective countermeasure against social engineering techniques is comprehensive security awareness training that educates users to recognize and respond appropriately to manipulation tactics. Organizations must prioritize human-focused security training to reduce susceptibility to attacks that bypass technical controls by targeting people directly.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "05:24-05:43"
    }
  ],
  "num_chunks": 12,
  "document_summary": "Social Engineering Techniques (video): A prerequisite of many types of attacks is to obtain information about the network and security system. Knowing these techniques will help you to develop policies and other security controls to mitigate these risks. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages."
}