{
  "metadata": {
    "chapter_num": "2",
    "section_num": "2.2.3",
    "title": "Social Engineering Techniques",
    "content_type": "video",
    "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
    "word_count": 956,
    "has_content": true
  },
  "full_content": "Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of people. Employees, contractors, suppliers, and customers represent part of the attack surface of any organization. Collectively, they're part of the attack surface referred to as the human vector. Social engineering refers to eliciting information from someone or getting them to perform some action for the threat actor. It can also be referred to as \"hacking the human.\" We'll look at some common vectors that highlight how cybercriminals exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or other goals. Knowing these techniques will help you to develop policies and other security controls to mitigate these risks. Phishing is a combination of social engineering and spoofing. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection. Other types of phishing campaigns use a spoofed website set up to imitate a bank, e?commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the real website indicating their account must be updated or with a hoax alert or alarm, supplying a link to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured. Another variation on phishing is called smishing which uses SMS, or text messages instead of email. It's more difficult to determine if the links are spoofed due to the reduced screen and functionality. However, direct messages to a single contact have a high chance of failure. Next is vishing, short for \"voice phishing,\" which uses phone calls or voice messages to manipulate individuals under the guise of a trusted entity. One high-profile example happened in 2021 when a branch manager received a call that he thought was from his director asking him to transfer $35 million for an acquisition. The voice on the phone sounded just like his director but was a computer-generated voice. The next vector is impersonation, which simply means pretending to be someone else. It's one of the basic social engineering techniques. Impersonation is possible when the target can't easily verify the attacker's identity, such as over the phone or via an email message. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password. To make the impersonation more credible, hackers will utilize pretexting. This attack vector involves creating a fabricated scenario (pretext) where they carefully craft a story with convincing or intimidating details. To be successful, they depend on obtaining privileged information about their target. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation. Another technique that overlaps with impersonation and pretexting is brand impersonation. Brand impersonation occurs when attackers create fake websites, emails, or social media profiles that mimic a legitimate brand's online presence. These fake assets are used to deceive individuals into providing personal information or credentials. Business email compromise (BEC) is a more sophisticated variation of phishing that also employs impersonation. BEC refers to a sophisticated campaign that targets a specific individual within a company, typically an executive. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them. Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation. A watering hole attack relies on a group of targets that use an unsecured third-party website. For example, a threat actor might discover that the staff running an international e-commerce site might use a local pizza delivery firm. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company's systems. Typosquatting means that the threat actor registers a domain name very similar to a real one, such as exannple.com, hoping that users won't notice the difference and assume they're browsing a trusted site or receiving email from a known source. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it. Well, that's it for this lesson. In this lesson, we looked at various ways that cybercriminals exploit human vectors that play on human nature through social engineering. The best defense against these types of attacks is training. Individuals and organizations that understand these methods will be more vigilant and less likely to fall prey to the attackers.",
  "chunks": [
    {
      "chunk_id": "2.2.3_chunk_1",
      "content": "Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of people. Employees, contractors, suppliers, and customers represent part of the attack surface of any organization. Collectively, they're part of the attack surface referred to as the human vector. Social engineering refers to eliciting information from someone or getting them to perform some action for the threat actor. It can also be referred to as \"hacking the human.\" We'll look at some common vectors that highlight how cybercriminals exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or other goals. Knowing these techniques will help you to develop policies and other security controls to mitigate these risks.",
      "summary": "The Social Engineering section of the CompTIA Security+ course emphasizes the importance of understanding human vulnerabilities as a significant attack vector in cybersecurity. It explores various techniques used by adversaries to manipulate individuals into divulging sensitive information or performing actions that compromise security. By recognizing these tactics, organizations can implement effective policies and controls to mitigate risks associated with social engineering attacks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Social Engineering",
      "timestamp_range": "00:00-00:56"
    },
    {
      "chunk_id": "2.2.3_chunk_2",
      "content": "Phishing is a combination of social engineering and spoofing. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection. Other types of phishing campaigns use a spoofed website set up to imitate a bank, e?commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the real website indicating their account must be updated or with a hoax alert or alarm, supplying a link to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured.",
      "summary": "Phishing combines social engineering and spoofing to deceive users into taking harmful actions, such as installing malware or granting remote access. Attackers often create spoofed websites that mimic trusted entities, like banks or e-commerce sites, and send emails prompting users to update their accounts or respond to fake alerts, ultimately capturing their login credentials when they authenticate on these fraudulent sites. Understanding phishing tactics is crucial for implementing effective security measures and protecting sensitive information.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Phishing",
      "timestamp_range": "00:56-01:32"
    },
    {
      "chunk_id": "2.2.3_chunk_3",
      "content": "Another variation on phishing is called smishing which uses SMS, or text messages instead of email. It's more difficult to determine if the links are spoofed due to the reduced screen and functionality. However, direct messages to a single contact have a high chance of failure.",
      "summary": "Smishing is a form of phishing that utilizes SMS text messages to deceive individuals into clicking on malicious links. Due to the limited screen space and functionality of mobile devices, it can be challenging to identify spoofed links, making users more vulnerable. Direct messages sent to individual contacts often have a higher likelihood of being ineffective, highlighting the need for awareness and caution when receiving unsolicited texts.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Smishing",
      "timestamp_range": "01:32-01:48"
    },
    {
      "chunk_id": "2.2.3_chunk_4",
      "content": "Next is vishing, short for \"voice phishing,\" which uses phone calls or voice messages to manipulate individuals under the guise of a trusted entity. One high-profile example happened in 2021 when a branch manager received a call that he thought was from his director asking him to transfer $35 million for an acquisition. The voice on the phone sounded just like his director but was a computer-generated voice.",
      "summary": "Vishing, or voice phishing, involves using phone calls or voice messages to deceive individuals by impersonating trusted entities. A notable case in 2021 highlighted this threat when a branch manager was tricked into transferring $35 million, believing he was speaking to his director, but the voice was actually computer-generated. This underscores the importance of verifying identities and being cautious with sensitive financial transactions over the phone.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Vishing",
      "timestamp_range": "01:48-02:12"
    },
    {
      "chunk_id": "2.2.3_chunk_5",
      "content": "The next vector is impersonation, which simply means pretending to be someone else. It's one of the basic social engineering techniques. Impersonation is possible when the target can't easily verify the attacker's identity, such as over the phone or via an email message. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password.",
      "summary": "Impersonation is a fundamental social engineering technique where an attacker pretends to be someone else to deceive the target into revealing sensitive information. This tactic is particularly effective in scenarios where identity verification is challenging, such as phone calls or emails. A common example involves an attacker calling a user and claiming they need access to their system, ultimately leading the user to disclose their password.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Impersonation",
      "timestamp_range": "02:12-02:38"
    },
    {
      "chunk_id": "2.2.3_chunk_6",
      "content": "To make the impersonation more credible, hackers will utilize pretexting. This attack vector involves creating a fabricated scenario (pretext) where they carefully craft a story with convincing or intimidating details. To be successful, they depend on obtaining privileged information about their target. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation.",
      "summary": "Pretexting is a social engineering attack where hackers create a believable scenario to impersonate someone and extract sensitive information from their target. By leveraging seemingly harmless details like employee lists or job titles, attackers enhance their credibility and increase the likelihood of successful deception. Understanding pretexting is crucial for organizations to implement effective security measures and train employees to recognize and respond to such threats.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Pretexting",
      "timestamp_range": "02:38-03:09"
    },
    {
      "chunk_id": "2.2.3_chunk_7",
      "content": "Another technique that overlaps with impersonation and pretexting is brand impersonation. Brand impersonation occurs when attackers create fake websites, emails, or social media profiles that mimic a legitimate brand's online presence. These fake assets are used to deceive individuals into providing personal information or credentials.",
      "summary": "Brand impersonation is a cybersecurity tactic where attackers replicate a legitimate brand's online presence through fake websites, emails, or social media profiles. This deceptive practice aims to trick individuals into divulging personal information or credentials, highlighting the importance of vigilance and verification in online interactions. Understanding brand impersonation is crucial for recognizing and mitigating potential phishing threats.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Brand Impersonation",
      "timestamp_range": "03:09-03:29"
    },
    {
      "chunk_id": "2.2.3_chunk_8",
      "content": "Business email compromise (BEC) is a more sophisticated variation of phishing that also employs impersonation. BEC refers to a sophisticated campaign that targets a specific individual within a company, typically an executive. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them.",
      "summary": "Business Email Compromise (BEC) is a targeted phishing attack that involves impersonating an executive or trusted individual within a company to deceive employees into divulging sensitive information or transferring funds. Attackers often conduct thorough reconnaissance to tailor their approach, making the deception more convincing. Understanding BEC is crucial for implementing effective security measures and training to protect against these sophisticated threats.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Business Email Compromise (BEC)",
      "timestamp_range": "03:29-04:01"
    },
    {
      "chunk_id": "2.2.3_chunk_9",
      "content": "Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation.",
      "summary": "The CompTIA Security+ course highlights the distinction between disinformation and misinformation, emphasizing that disinformation is intentionally deceptive, while misinformation involves the unintentional spread of false information. Tactics such as creating fake social media posts and misleading links are used to manipulate search rankings and amplify false narratives. Understanding these concepts is crucial for recognizing and mitigating the impact of such campaigns in cybersecurity.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Disinformation and Misinformation",
      "timestamp_range": "04:01-04:28"
    },
    {
      "chunk_id": "2.2.3_chunk_10",
      "content": "A watering hole attack relies on a group of targets that use an unsecured third-party website. For example, a threat actor might discover that the staff running an international e-commerce site might use a local pizza delivery firm. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company's systems.",
      "summary": "A watering hole attack targets a specific group by compromising a third-party website that the group frequently visits, such as a local service used by employees. By injecting malicious code into the compromised site, attackers can exploit vulnerabilities in the visitors' systems, potentially gaining access to sensitive information within the targeted organization. This tactic highlights the importance of securing all third-party interactions to prevent indirect attacks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Watering Hole",
      "timestamp_range": "04:28-04:55"
    },
    {
      "chunk_id": "2.2.3_chunk_11",
      "content": "Typosquatting means that the threat actor registers a domain name very similar to a real one, such as exannple.com, hoping that users won't notice the difference and assume they're browsing a trusted site or receiving email from a known source. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it.",
      "summary": "Typosquatting is a cyber threat where attackers register domain names that closely resemble legitimate ones, tricking users into believing they are interacting with a trusted site or source. This tactic can also involve hijacking subdomains of reputable cloud providers, making phishing attempts appear more credible. Understanding typosquatting is crucial for recognizing and mitigating phishing risks in cybersecurity.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Typosquatting",
      "timestamp_range": "04:55-05:24"
    },
    {
      "chunk_id": "2.2.3_chunk_12",
      "content": "Well, that's it for this lesson. In this lesson, we looked at various ways that cybercriminals exploit human vectors that play on human nature through social engineering. The best defense against these types of attacks is training. Individuals and organizations that understand these methods will be more vigilant and less likely to fall prey to the attackers.",
      "summary": "This lesson highlights the significance of social engineering in cybersecurity, where cybercriminals exploit human behavior to gain unauthorized access. The key defense against such attacks is comprehensive training for individuals and organizations, fostering awareness and vigilance to mitigate risks. Understanding these tactics is essential for reducing susceptibility to exploitation.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.3",
        "title": "Social Engineering Techniques",
        "content_type": "video",
        "filename": "2.2.3_Social_Engineering_Techniques_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.3_Social_Engineering_Techniques_[video].txt",
        "word_count": 956,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "05:24-05:43"
    }
  ],
  "num_chunks": 12
}