{
  "metadata": {
    "chapter_num": "12",
    "section_num": "12.1.1",
    "title": "Risk Types and Tolerance",
    "content_type": "video",
    "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
    "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
    "word_count": 959,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Risk management is the process of identifying vulnerabilities and threats, and then deciding on countermeasures to reduce the risk to an acceptable level. In other words, risk management is when a person or group considers worst-case scenarios and determines just how bad those scenarios would be for their organization. Senior management is ultimately responsible for residual risk, which is what remains after taking risk-reduction measures. This all might sound kind of depressing. But it's actually pretty liberating because you can feel secure knowing that you've thought through all possible problems. It's kind of like insurance. No one wants bad stuff to happen, but you invest in an insurance policy so that you can have peace of mind that if something does happen, you'll be ready. The first step in risk management is to identify your organization's assets and how much each asset is worth. You want to pay special attention to assets that are critical for your business to function. You should place values on all assets, including the cost of lost data, failed systems, downtime, and training new employees. Assets include physical items like computers and storage devices. These items are usually purchased, and so it's fairly easy to place a value on them. But it becomes a bit harder to place a value on an intangible asset like computer data or a seasoned employee's knowledge. While a computer can be easily replaced, the data itself is possibly far more valuable in the end. It's difficult to assign values to things like that, but it's important to attempt to. After you've identified your assets, you should then identify possible asset threats, which can be internal or external. Internal threats come from within your organization and could include employee fraud, theft, system failure, sabotage, espionage, collusion, or snooping. External threats are things like fire, water damage, burglars, internet attacks, market competition, or natural disasters. Let's talk about risk analysis. Risk analysis is the practice of assessing which risks you've identified to be the most relevant to the organization. This is a key part of the risk management process. Risk assessment determines quantitative and qualitative risk values as they relate to a particular threat. As a best practice, we try to create risk assessments using quantitative measurements, which require us to assign a number value to each identified risk. You should also evaluate your risks. This means determining if and when action should be taken in a worst-cast scenario. You would use this during the analysis phase to determine each risk's tolerability. Finally, once all risks have been identified and assessed, their management falls into one of four categories: avoidance, transference, mitigation, and acceptance. Avoidance is the decision to avoid the risk altogether. In other words, you choose not to engage in an activity because the risk is too high. Transference involves transferring the risk to someone else. Many organizations have opted to outsource their networking, security, and storage solutions. Doing so helps to transfer a bit of the risk to companies that are better prepared for potential threats. As businesses dependence on technology continues to grow, so does their cyber risk. Another way businesses help prepare for a potentially catastrophic loss is to take out cybersecurity insurance. As with most insurance policies, this protects against events that would have a big financial impact should they occur. Mitigation is also an option. You could reduce a potential threat's risk by deploying security controls or other protections. An administrative control is an actionable procedure that should be followed to reduce risk. A technical control is a device that's used for this very purpose. For example, you could configure system redundancy so that if the original system were to go down, the redundant system could take over and continue providing services. Organizations should perform regular risk-control assessments to ensure that these controls continue to be effective. Sometimes, organizations opt to accept a risk because the associated cost is acceptable, or the cost to protect the asset is just too high. A risk appetite statement, put simply, is the amount of risk an organization is willing to tolerate in order to reach its objectives. If you do decide to accept a risk, it's important to build response policies around a plausible outcome. Know that in some instances, there might actually be regulations that outline how certain risks must be lawfully handled. In these cases, you want to show that you took all the necessary steps to safeguard against loss. So make sure to study up and consider the guidance of legal counsel. That's it for this lesson. In summary, the risk management process is the process for identifying threats and deciding which countermeasures to take to reduce an undesirable outcome. Asset and risk identification as well as risk analysis, evaluation, and management strategies all make up the risk management process.",
  "chunks": [
    {
      "chunk_id": "12.1.1_chunk_1",
      "content": "Risk management is the process of identifying vulnerabilities and threats, and then deciding on countermeasures to reduce the risk to an acceptable level. In other words, risk management is when a person or group considers worst-case scenarios and determines just how bad those scenarios would be for their organization. Senior management is ultimately responsible for residual risk, which is what remains after taking risk-reduction measures. This all might sound kind of depressing. But it's actually pretty liberating because you can feel secure knowing that you've thought through all possible problems. It's kind of like insurance. No one wants bad stuff to happen, but you invest in an insurance policy so that you can have peace of mind that if something does happen, you'll be ready.",
      "summary": "Risk management involves identifying vulnerabilities and threats, followed by implementing countermeasures to mitigate risks to an acceptable level. Senior management holds responsibility for residual risk, which remains after risk-reduction efforts. This proactive approach to risk assessment is akin to investing in insurance, providing organizations with peace of mind by preparing for potential worst-case scenarios.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Risk Types and Tolerance",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_2",
      "content": "The first step in risk management is to identify your organization's assets and how much each asset is worth. You want to pay special attention to assets that are critical for your business to function. You should place values on all assets, including the cost of lost data, failed systems, downtime, and training new employees. Assets include physical items like computers and storage devices. These items are usually purchased, and so it's fairly easy to place a value on them. But it becomes a bit harder to place a value on an intangible asset like computer data or a seasoned employee's knowledge. While a computer can be easily replaced, the data itself is possibly far more valuable in the end. It's difficult to assign values to things like that, but it's important to attempt to.",
      "summary": "Asset identification is a critical first step in risk management, focusing on recognizing and valuing an organization's assets, both tangible and intangible. This process involves assessing the worth of physical items like computers and storage devices, as well as the more challenging valuation of data and employee knowledge, which can significantly impact business operations. Properly valuing these assets helps organizations prioritize security measures and mitigate potential risks effectively.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Asset Identification",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_3",
      "content": "After you've identified your assets, you should then identify possible asset threats, which can be internal or external. Internal threats come from within your organization and could include employee fraud, theft, system failure, sabotage, espionage, collusion, or snooping. External threats are things like fire, water damage, burglars, internet attacks, market competition, or natural disasters.",
      "summary": "In the Risk Identification section of the CompTIA Security+ course, learners are taught to recognize potential threats to their identified assets, categorizing them as either internal or external. Internal threats may arise from employees through actions like fraud or sabotage, while external threats encompass risks such as natural disasters, cyberattacks, and market competition. Understanding these threats is crucial for developing effective security strategies and mitigating risks.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Risk Identification",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_4",
      "content": "Let's talk about risk analysis. Risk analysis is the practice of assessing which risks you've identified to be the most relevant to the organization. This is a key part of the risk management process. Risk assessment determines quantitative and qualitative risk values as they relate to a particular threat. As a best practice, we try to create risk assessments using quantitative measurements, which require us to assign a number value to each identified risk.",
      "summary": "Risk analysis involves evaluating and prioritizing identified risks to determine their relevance to an organization, forming a crucial aspect of the risk management process. It includes both quantitative and qualitative assessments, with a focus on assigning numerical values to risks for more precise evaluation. This structured approach aids organizations in effectively mitigating potential threats.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Risk Analysis",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_5",
      "content": "You should also evaluate your risks. This means determining if and when action should be taken in a worst-cast scenario. You would use this during the analysis phase to determine each risk's tolerability.",
      "summary": "In the Risk Evaluation section of the CompTIA Security+ course, learners are taught to assess risks by analyzing potential worst-case scenarios and deciding when to take action. This evaluation helps in determining the tolerability of each risk, guiding organizations in their decision-making processes regarding security measures and resource allocation. Practical applications include risk assessment frameworks and methodologies that aid in prioritizing security efforts based on identified vulnerabilities.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Risk Evaluation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_6",
      "content": "Finally, once all risks have been identified and assessed, their management falls into one of four categories: avoidance, transference, mitigation, and acceptance. Avoidance is the decision to avoid the risk altogether. In other words, you choose not to engage in an activity because the risk is too high. Transference involves transferring the risk to someone else. Many organizations have opted to outsource their networking, security, and storage solutions. Doing so helps to transfer a bit of the risk to companies that are better prepared for potential threats. As businesses dependence on technology continues to grow, so does their cyber risk. Another way businesses help prepare for a potentially catastrophic loss is to take out cybersecurity insurance. As with most insurance policies, this protects against events that would have a big financial impact should they occur. Mitigation is also an option. You could reduce a potential threat's risk by deploying security controls or other protections. An administrative control is an actionable procedure that should be followed to reduce risk. A technical control is a device that's used for this very purpose. For example, you could configure system redundancy so that if the original system were to go down, the redundant system could take over and continue providing services. Organizations should perform regular risk-control assessments to ensure that these controls continue to be effective. Sometimes, organizations opt to accept a risk because the associated cost is acceptable, or the cost to protect the asset is just too high. A risk appetite statement, put simply, is the amount of risk an organization is willing to tolerate in order to reach its objectives. If you do decide to accept a risk, it's important to build response policies around a plausible outcome. Know that in some instances, there might actually be regulations that outline how certain risks must be lawfully handled. In these cases, you want to show that you took all the necessary steps to safeguard against loss. So make sure to study up and consider the guidance of legal counsel.",
      "summary": "Risk management strategies in cybersecurity involve four key approaches: avoidance, transference, mitigation, and acceptance. Organizations may choose to avoid high-risk activities, transfer risks through outsourcing or cybersecurity insurance, mitigate risks with security controls, or accept risks when costs are deemed acceptable. Regular risk-control assessments and adherence to legal regulations are essential to ensure effective risk management and compliance.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Risk Management Strategies",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.1.1_chunk_7",
      "content": "That's it for this lesson. In summary, the risk management process is the process for identifying threats and deciding which countermeasures to take to reduce an undesirable outcome. Asset and risk identification as well as risk analysis, evaluation, and management strategies all make up the risk management process.",
      "summary": "The risk management process is essential for identifying potential threats and determining appropriate countermeasures to mitigate negative outcomes. Key components include asset and risk identification, along with risk analysis, evaluation, and management strategies, which collectively help organizations protect their assets and maintain security. Practical applications of this process enable informed decision-making to enhance overall cybersecurity posture.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.1.1",
        "title": "Risk Types and Tolerance",
        "content_type": "video",
        "filename": "12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.1.1_Risk_Types_and_Tolerance_[video].txt",
        "word_count": 959,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 7
}