{
  "metadata": {
    "chapter_num": "12",
    "section_num": "12.2.1",
    "title": "Managing Third Parties",
    "content_type": "video",
    "filename": "12.2.1_Managing_Third_Parties_[video].txt",
    "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
    "word_count": 1003,
    "has_content": true
  },
  "full_content": "Transcript close interactive script It's common for one organization to work directly with a third party in a vendor, supply chain, or business partner relationship. These relationships often require the both parties' information systems to connect and integrate. Doing this exposes both network to risks. You'll want to pay careful attention to the onboarding phase, the ongoing operations phase, and the offboarding phase of this third-party relationship. Let's take a look at the onboarding phase first. During this phase of the relationship, you'll want to sit down with individuals from the third-party organization. Compare each of your organization's security policies and infrastructure. Are the security policies for each organization similar? If there are substantial differences, you should discuss them. Do both organizations have similar incident response procedures? If there are differences, how will each party handle incident response? Are the security controls similar? Are the audit policies similar? Is the security posture of each organization compatible enough to work together, or will the integration expose vulnerabilities in one or both organizations? Finding answers to these questions helps you to identify and evaluate differences and potential risks up front. There will always be risks, so you'll need to work with your organization's leadership to determine if the risks of this potential relationship outweigh the benefits. If so, it's okay to walk away. But if the benefits outweigh the risks, you'll want to move forward with the relationship. After that decision is made, you need to create an interoperability agreement. This agreement is a collection of documents that identifies the key responsibilities in the relationship. The documents will specify who is going to perform key tasks, how those tasks will be measured, and how decisions will be handled, and other such information. The first interoperability agreement document you need is a Service Level Agreement, or SLA. An SLA states what each organization in the relationship will do and at what level. It may also define how disputes will be managed, provide warranties, specify disaster recovery procedures, and specify when the agreement will be terminated. Second, we need a Memorandum of Understanding, or MOU. An MOU provides a brief summary of the relationship. It describes which party is responsible for performing specific tasks . Basically, it says who is going to do what, and when they'll do it. Next, we'll need a Business Partnership Agreement, or BPA. A BPA explains the rules surrounding the finances of the partnership. This could include details on how to handle contributions, withdrawals, financial reporting, and the profit and loss distribution. Another important document is the Interconnection Security Agreement, or ISA. The ISA documents how the information systems of both organizations will connect and how they're going to share data. The ISA is more technical in nature. The SLA and the MOU define the relationship, whereas the BPA and the ISA specify how the project work is going to take place. When onboarding is complete, you can start conducting business according to the terms of the agreement. During the ongoing operations phase, you'll want to keep any eye on several things. First, regularly verify compliance with the interoperability agreement documents. Make sure that each organization is doing what it said it would do. In addition, conduct periodic vulnerability assessments to verify that the shared network connections have not exposed or created some type of security weakness. You should also conduct regular security audits to ensure that organizations are following the security requirements contained in the interoperability agreement. Communication between the organizations is critical. Share the vulnerability assessment and security audit findings with everyone involved in the relationship in order to maintain risk awareness. When the operations phase is complete and you've reached the end of your agreement, you're ready to end the relationship. This process is called offboarding. Although this is an important phase, it's probably the most neglected. During offboarding, you want to ensure that all the security doors you opened to facilitate the relationship are closed. From a technical standpoint, you'll want to reset or disable any open or shared connections that you may have with the third party. This could include VPNs, firewalls, or routers and switches that were set up to share information from your network. In addition, disable any domain trust relationships established between the organizations. Disable any user or group accounts used by third parties to access your organization's data. Finally, reset passwords used by the third party to access applications on your network. Leaving any of these doors open could potentially expose the information on your network. During the offboarding process, you'll also want to revisit the NDA, and you'll want to put all of your end-of-business agreements into a written format. That's it for this lesson. In this video, we talked about managing third parties. We looked at the onboarding phase and the various documents commonly used. We talked about the ongoing operations phase of the relationship, and we discussed considerations for the offboarding phase to ensure that access to your system ends with the relationship.",
  "chunks": [
    {
      "chunk_id": "12.2.1_chunk_1",
      "content": "It's common for one organization to work directly with a third party in a vendor, supply chain, or business partner relationship. These relationships often require the both parties' information systems to connect and integrate. Doing this exposes both network to risks. You'll want to pay careful attention to the onboarding phase, the ongoing operations phase, and the offboarding phase of this third-party relationship.",
      "summary": "The \"Manage Third Parties\" section emphasizes the importance of securing relationships with vendors, supply chains, and business partners, as these connections can introduce significant risks to both organizations' information systems. Key phases to focus on include onboarding, ongoing operations, and offboarding, ensuring that security measures are implemented throughout the entire relationship lifecycle to mitigate potential vulnerabilities. Practical applications involve establishing clear security protocols and continuous monitoring to protect sensitive data during integration and collaboration.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Manage Third Parties",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_2",
      "content": "Let's take a look at the onboarding phase first. During this phase of the relationship, you'll want to sit down with individuals from the third-party organization. Compare each of your organization's security policies and infrastructure. Are the security policies for each organization similar? If there are substantial differences, you should discuss them. Do both organizations have similar incident response procedures? If there are differences, how will each party handle incident response? Are the security controls similar? Are the audit policies similar? Is the security posture of each organization compatible enough to work together, or will the integration expose vulnerabilities in one or both organizations? Finding answers to these questions helps you to identify and evaluate differences and potential risks up front. There will always be risks, so you'll need to work with your organization's leadership to determine if the risks of this potential relationship outweigh the benefits. If so, it's okay to walk away. But if the benefits outweigh the risks, you'll want to move forward with the relationship. After that decision is made, you need to create an interoperability agreement. This agreement is a collection of documents that identifies the key responsibilities in the relationship. The documents will specify who is going to perform key tasks, how those tasks will be measured, and how decisions will be handled, and other such information.",
      "summary": "The onboarding phase involves a thorough evaluation of security policies, incident response procedures, and audit practices between your organization and a third-party entity to identify compatibility and potential risks. By addressing differences in security posture and controls, organizations can determine if the benefits of collaboration outweigh the risks. If proceeding, an interoperability agreement should be established to outline responsibilities, performance metrics, and decision-making processes for the partnership.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Onboarding Phase",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_3",
      "content": "The first interoperability agreement document you need is a Service Level Agreement, or SLA. An SLA states what each organization in the relationship will do and at what level. It may also define how disputes will be managed, provide warranties, specify disaster recovery procedures, and specify when the agreement will be terminated.",
      "summary": "A Service Level Agreement (SLA) is a crucial document that outlines the responsibilities and performance expectations of each organization involved in a partnership. It typically includes provisions for dispute resolution, warranties, disaster recovery procedures, and termination conditions, ensuring clarity and accountability in service delivery. Understanding SLAs is essential for maintaining effective cybersecurity practices and managing risks in organizational relationships.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Service Level Agreement",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_4",
      "content": "Second, we need a Memorandum of Understanding, or MOU. An MOU provides a brief summary of the relationship. It describes which party is responsible for performing specific tasks . Basically, it says who is going to do what, and when they'll do it.",
      "summary": "A Memorandum of Understanding (MOU) is a formal document that outlines the relationship between parties involved in a cybersecurity agreement. It specifies the responsibilities of each party regarding task execution and timelines, ensuring clarity and accountability in collaborative efforts. MOUs are essential for establishing expectations and facilitating cooperation in security initiatives.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Memorandum of Understanding",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_5",
      "content": "Next, we'll need a Business Partnership Agreement, or BPA. A BPA explains the rules surrounding the finances of the partnership. This could include details on how to handle contributions, withdrawals, financial reporting, and the profit and loss distribution.",
      "summary": "A Business Partnership Agreement (BPA) outlines the financial rules governing a partnership, detailing contributions, withdrawals, financial reporting, and the distribution of profits and losses. This agreement is crucial for establishing clear expectations and responsibilities among partners, ensuring transparency and accountability in financial matters. Understanding and implementing a BPA is essential for maintaining a healthy business relationship and mitigating potential conflicts.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Business Partnership Agreement",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_6",
      "content": "Another important document is the Interconnection Security Agreement, or ISA. The ISA documents how the information systems of both organizations will connect and how they're going to share data. The ISA is more technical in nature. The SLA and the MOU define the relationship, whereas the BPA and the ISA specify how the project work is going to take place.",
      "summary": "The Interconnection Security Agreement (ISA) is a technical document that outlines the protocols for connecting and sharing data between the information systems of two organizations. While the Service Level Agreement (SLA) and Memorandum of Understanding (MOU) define the overall relationship, the ISA, along with the Business Partnership Agreement (BPA), details the specific operational procedures for collaboration. Understanding the ISA is crucial for ensuring secure and efficient inter-organizational data exchange.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Interconnection Security Agreement",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_7",
      "content": "When onboarding is complete, you can start conducting business according to the terms of the agreement. During the ongoing operations phase, you'll want to keep any eye on several things. First, regularly verify compliance with the interoperability agreement documents. Make sure that each organization is doing what it said it would do. In addition, conduct periodic vulnerability assessments to verify that the shared network connections have not exposed or created some type of security weakness. You should also conduct regular security audits to ensure that organizations are following the security requirements contained in the interoperability agreement. Communication between the organizations is critical. Share the vulnerability assessment and security audit findings with everyone involved in the relationship in order to maintain risk awareness.",
      "summary": "In the ongoing operations phase of cybersecurity, it is essential to ensure compliance with interoperability agreements by regularly verifying that all parties adhere to their commitments. Conducting periodic vulnerability assessments and security audits helps identify any potential security weaknesses in shared network connections. Effective communication of findings among organizations is crucial for maintaining risk awareness and fostering a secure collaborative environment.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Ongoing Operations Phase",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_8",
      "content": "When the operations phase is complete and you've reached the end of your agreement, you're ready to end the relationship. This process is called offboarding. Although this is an important phase, it's probably the most neglected. During offboarding, you want to ensure that all the security doors you opened to facilitate the relationship are closed.",
      "summary": "The offboarding phase is a critical yet often overlooked process that occurs at the end of a contractual relationship, focusing on closing all security access points established during the partnership. This phase ensures that sensitive information and resources are secured, preventing unauthorized access after the relationship concludes. Proper offboarding practices are essential for maintaining organizational security and mitigating potential risks.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Offboarding Phase",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_9",
      "content": "From a technical standpoint, you'll want to reset or disable any open or shared connections that you may have with the third party. This could include VPNs, firewalls, or routers and switches that were set up to share information from your network. In addition, disable any domain trust relationships established between the organizations. Disable any user or group accounts used by third parties to access your organization's data. Finally, reset passwords used by the third party to access applications on your network. Leaving any of these doors open could potentially expose the information on your network. During the offboarding process, you'll also want to revisit the NDA, and you'll want to put all of your end-of-business agreements into a written format.",
      "summary": "During the offboarding phase, it's crucial to secure your network by disabling or resetting any shared connections, such as VPNs and domain trust relationships, used by third parties. Additionally, all user accounts and passwords associated with external access should be deactivated to prevent unauthorized information exposure. Revisiting non-disclosure agreements (NDAs) and formalizing end-of-business agreements in writing are also essential steps in ensuring a comprehensive offboarding process.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Offboarding Phase",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.2.1_chunk_10",
      "content": "That's it for this lesson. In this video, we talked about managing third parties. We looked at the onboarding phase and the various documents commonly used. We talked about the ongoing operations phase of the relationship, and we discussed considerations for the offboarding phase to ensure that access to your system ends with the relationship.",
      "summary": "This lesson covers the management of third-party relationships in cybersecurity, emphasizing the onboarding, ongoing operations, and offboarding phases. Key documents and considerations are discussed to ensure secure access control throughout the partnership, particularly focusing on terminating access when the relationship ends. Understanding these phases is crucial for maintaining organizational security and mitigating risks associated with third-party access.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.2.1",
        "title": "Managing Third Parties",
        "content_type": "video",
        "filename": "12.2.1_Managing_Third_Parties_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.2.1_Managing_Third_Parties_[video].txt",
        "word_count": 1003,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 10
}