{
  "metadata": {
    "chapter_num": "12",
    "section_num": "12.3.5",
    "title": "Auditing Device Logs on a Switch",
    "content_type": "video",
    "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
    "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
    "word_count": 812,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demo, we'll discuss auditing device logs. and we'll use our Cisco managed switch as an example. Now, auditing device logs requires two things: First, we must enable logging so that we have log events that are being captured on the device. And second, we take the time to review or audit the logs to see what's happening. Let's see how this is done. First, let's enable logging by clicking Administration, System Log, then Log Settings. You'll see that logging is currently enabled. This particular device has three types of logging. You can save log events in RAM, the random-access memory which will be lost after the system reboots. You can also save log events in flash memory which means that they'll be stored after the system reboots. And, finally, you can also aggregate, or compile, your logs and send them to a SYS log server. To enable event aggregation, we enable the Syslog aggregator by checking the box and entering a time in seconds for Max Aggregation Time. Will enter 300 here, which will mean 5 minutes. If you have a set of events that happen repeatedly—\"for example, the same event keeps happening every five seconds—\"what will happen is the aggregator will say this event happened 15 times. Instead of seeing a separate entry for each similar event, you'll see the event happened and the number of times it happened within that aggregation period. We'll click apply to enable logging with aggregation. You can add a remote log server, so you can view your logs from a central location. We'll click add and here you can specify the server by IP address or name, the UDP port, and have your logs sent to a certain facility. Let's click Close and go back to Log Settings. As you'll notice there are several levels of logging on this device starting with Emergency. Let's talk about what each of these mean. The Emergency level of severity means the system is not usable. An alert means that there's some sort of action that's needed. An event with critical severity means that the system is in a critical condition. An error means that there's an error in the system. Warning means that a system warning has occurred and a notice means that the system is functioning properly, but it just wants to let you know that something has happened. The informational level log is about device information. And then if you're having an issue with the device, you can log detailed debugging information about a particular event. As you'll notice we don't have debug information selected. But in our RAM logging , we're logging all of the other device events. Selecting a severity level causes all of those events higher to be selected as well. For example, we'll choose informational, and notice all the more critical events above it are selected, too. We can also specify the Originator Identifier in our log messages by choosing None, or by hostname, IP address, or a description of your choice. For flash memory logging which will be available after a system reboot, we're logging only a few top severity levels. These events are aggregating in our error log every 300 seconds, and then sent off to our defined SYS log server. Now let's take a look at some of the events in the event log. With logging now setup and enabled, we're ready to view the logs. To see the logs, click on Status and Statistics, View Log, and then we can review both the RAM and Flash log entries. Notice there are various events by chronological order, newest on top. On this device, we see mostly notices and informational events, with an occasional warning. Keep an eye out for important messages like failed login attempts, logins from unauthorized workstations, device restarts, down links, and much more. That's a quick summary of device log auditing. Remember to first enable logging so your device will generate events in the logs, then you need to take the time to periodically review the logs to see if there is important information there.",
  "chunks": [
    {
      "chunk_id": "12.3.5_chunk_1",
      "content": "In this demo, we'll discuss auditing device logs. and we'll use our Cisco managed switch as an example. Now, auditing device logs requires two things: First, we must enable logging so that we have log events that are being captured on the device. And second, we take the time to review or audit the logs to see what's happening. Let's see how this is done.",
      "summary": "In this section on auditing device logs, the focus is on the importance of enabling logging on devices, such as a Cisco managed switch, to capture log events. The process involves not only activating the logging feature but also regularly reviewing and auditing these logs to monitor device activity and identify potential security issues. This practice is essential for maintaining network security and ensuring proper incident response.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Auditing Device Logs",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_2",
      "content": "First, let's enable logging by clicking Administration, System Log, then Log Settings. You'll see that logging is currently enabled. This particular device has three types of logging. You can save log events in RAM, the random-access memory which will be lost after the system reboots. You can also save log events in flash memory which means that they'll be stored after the system reboots. And, finally, you can also aggregate, or compile, your logs and send them to a SYS log server.",
      "summary": "In the Log Settings section, users learn to enable and configure logging for a device, which is essential for monitoring and auditing security events. The course covers three types of log storage: temporary storage in RAM, persistent storage in flash memory, and the option to aggregate logs for centralized management on a SYS log server. Understanding these logging methods is crucial for effective incident response and system analysis in cybersecurity.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Log Settings",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_3",
      "content": "To enable event aggregation, we enable the Syslog aggregator by checking the box and entering a time in seconds for Max Aggregation Time. Will enter 300 here, which will mean 5 minutes. If you have a set of events that happen repeatedly—\"for example, the same event keeps happening every five seconds—\"what will happen is the aggregator will say this event happened 15 times. Instead of seeing a separate entry for each similar event, you'll see the event happened and the number of times it happened within that aggregation period. We'll click apply to enable logging with aggregation.",
      "summary": "Event aggregation in cybersecurity involves configuring a Syslog aggregator to consolidate repeated events into a single entry, enhancing log management efficiency. By setting a Max Aggregation Time—such as 300 seconds—events occurring within that timeframe are counted collectively, reducing clutter and making it easier to analyze incident frequency. This practical application aids in monitoring and responding to security events more effectively.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Event Aggregation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_4",
      "content": "You can add a remote log server, so you can view your logs from a central location. We'll click add and here you can specify the server by IP address or name, the UDP port, and have your logs sent to a certain facility. Let's click Close and go back to Log Settings.",
      "summary": "The Remote Log Servers section covers the process of configuring a centralized logging system by adding a remote log server, allowing users to view logs from a single location. Key steps include specifying the server's IP address or name, selecting the UDP port, and directing logs to a designated facility. This setup enhances log management and monitoring efficiency in cybersecurity practices.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Remote Log Servers",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_5",
      "content": "As you'll notice there are several levels of logging on this device starting with Emergency. Let's talk about what each of these mean. The Emergency level of severity means the system is not usable. An alert means that there's some sort of action that's needed. An event with critical severity means that the system is in a critical condition. An error means that there's an error in the system. Warning means that a system warning has occurred and a notice means that the system is functioning properly, but it just wants to let you know that something has happened. The informational level log is about device information. And then if you're having an issue with the device, you can log detailed debugging information about a particular event. As you'll notice we don't have debug information selected. But in our RAM logging , we're logging all of the other device events. Selecting a severity level causes all of those events higher to be selected as well. For example, we'll choose informational, and notice all the more critical events above it are selected, too. We can also specify the Originator Identifier in our log messages by choosing None, or by hostname, IP address, or a description of your choice.",
      "summary": "The RAM Memory Logging section covers various levels of logging severity, ranging from Emergency (system unusable) to Informational (device information), each indicating the state of the system and the necessary actions. Users can select a severity level to log all events of that level and higher, enabling efficient monitoring and troubleshooting. Additionally, the Originator Identifier can be customized for clearer log messages, enhancing the practical application of logging in cybersecurity management.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "RAM Memory Logging",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_6",
      "content": "For flash memory logging which will be available after a system reboot, we're logging only a few top severity levels. These events are aggregating in our error log every 300 seconds, and then sent off to our defined SYS log server. Now let's take a look at some of the events in the event log.",
      "summary": "Flash memory logging captures high-severity events that persist after system reboots, aggregating them into an error log every 300 seconds. These logs are then transmitted to a designated SYS log server for centralized monitoring and analysis. This process enhances security by ensuring critical events are recorded and accessible for review, aiding in incident response and system integrity.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Flash Memory Logging",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_7",
      "content": "With logging now setup and enabled, we're ready to view the logs. To see the logs, click on Status and Statistics, View Log, and then we can review both the RAM and Flash log entries. Notice there are various events by chronological order, newest on top. On this device, we see mostly notices and informational events, with an occasional warning. Keep an eye out for important messages like failed login attempts, logins from unauthorized workstations, device restarts, down links, and much more.",
      "summary": "In this section, learners are guided on how to access and interpret logs after enabling logging on a device. The logs display events in chronological order, highlighting notices, informational messages, and warnings, with a focus on critical alerts such as failed login attempts and unauthorized access. Understanding these logs is essential for monitoring security incidents and maintaining the integrity of the system.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "View Log",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.5_chunk_8",
      "content": "That's a quick summary of device log auditing. Remember to first enable logging so your device will generate events in the logs, then you need to take the time to periodically review the logs to see if there is important information there.",
      "summary": "Device log auditing is essential for maintaining security, requiring the initial step of enabling logging to generate event data. Regularly reviewing these logs is crucial to identify potential security incidents or important information that could impact the overall security posture of the system. This practice helps organizations proactively manage risks and respond to threats effectively.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.5",
        "title": "Auditing Device Logs on a Switch",
        "content_type": "video",
        "filename": "12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.5_Auditing_Device_Logs_on_a_Switch_[video].txt",
        "word_count": 812,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 8
}