{
  "metadata": {
    "chapter_num": "12",
    "section_num": "12.3.1",
    "title": "Audits",
    "content_type": "video",
    "filename": "12.3.1_Audits_[video].txt",
    "file_path": "data_raw/12_Risk_Management_Processes/12.3.1_Audits_[video].txt",
    "word_count": 941,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Audits and assessments are crucial to maintaining trustworthy relationships and business operations. Audits involve evaluating an organization's processes, controls, and compliance, whereas an assessment evaluates operations such as cybersecurity, risk management, and internal controls. In this lesson, we'll look at the difference between internal and external assessments. We'll also look at penetration testing, one of the more common assessments that need to be performed. When an audit or assessment is done, it'll be classified as either an internal or external assessment. An internal audit is performed by the organization's employees to provide an in-depth analysis of the organization's business processes. These internal audits should be performed on a regular basis and focus on the needs and priorities of the organization. External audits, on the other hand, are performed by an independent third party. An external audit ensures that the organization's practices meet industry standards and identifies any areas the internal audit might have missed. Performing internal and external audits and assessments provides a full accounting of the organization's policies and procedures and allows the organization to quickly identify and fix any shortcomings. Performing these audits and assessments fosters transparency and accountability and builds trust among stakeholders. One of the more common assessments that should be performed on a regular basis is a penetration test. Penetration testing, also called pen testing or ethical hacking, involves hacking into a network to discover any vulnerabilities and weaknesses so they can be remediated before they're exploited by a malicious hacker. The penetration test utilizes the same techniques that a hacker would use, but the pen tester has written permission to perform the audit, and the scope of the test is clearly defined before anything is done. A penetration test will typically consist of five steps. These include reconnaissance, scanning, vulnerability assessment, exploitation, and reporting. In the reconnaissance phase, the pen tester begins gathering information about their target. This can include gathering publicly available information, using social engineering techniques, and dumpster diving. The second step is scanning the target. At this point, the tester is actively engaged with the target. Various tools are used to gather in-depth information about the network, such as live hosts, open ports, and more. During the vulnerability assessment phase, the pen tester takes all the information they've gathered so far and identifies all potential vulnerabilities that may exist on the network. The pen tester then moves into the next phase and attempts to exploit the confirmed vulnerabilities. The final step, reporting, involves compiling a detailed analysis of the organization's security systems. This includes all discovered vulnerabilities that were exploited, along with recommendations to remediate the vulnerabilities. When defining the rules of the penetration test, the first step is to determine whether an unknown, partially known, or known test environment will be used. Let's look at the difference in each of these. An unknown test is when an ethical hacker has no information about the target or network. This test is the best for simulating an outside attack and ignores insider threats. The major drawback to this type of test is that it takes more time and is much more expensive, mostly because a lot of time and resources must go into the reconnaissance and scanning phases. A known test is the opposite of an unknown test. The pen tester is given full knowledge of the network, computer systems, and infrastructure. The known test environment allows a comprehensive and thorough test of the organization's security. Still, it's not very realistic, as an attacker will rarely have all the information handed over to them. The partially known testing environment simulates an insider threat. The tester is given partial information about the network and computer systems. This can be IP configurations, email lists, computer names, or other information an insider would realistically have. This type of test requires less reconnaissance and scanning but doesn't give all the information to the pen tester. Aside from testing network security, physical penetration testing should also be performed. In this type of test, the penetration tester attempts to gain access to restricted areas, sensitive information, or critical assets within the organization using techniques like social engineering, tailgating, lock picking, bypassing alarms or surveillance systems, and exploiting physical vulnerabilities. Red team and blue team are other terms you'll run across. In the cybersecurity field, an offensive security team is called a red team, and a defensive security team is called a blue team. As the red team attempts to break into a system, the blue team works to keep them out. That'll wrap up this lesson on audits and assessments. In this lesson, we first looked at the benefits of performing audits and assessments and the difference between internal and external audits. We then went over penetration testing, including the steps involved and the different types of penetration tests that can be performed.",
  "chunks": [
    {
      "chunk_id": "12.3.1_chunk_1",
      "content": "Audits and assessments are crucial to maintaining trustworthy relationships and business operations. Audits involve evaluating an organization's processes, controls, and compliance, whereas an assessment evaluates operations such as cybersecurity, risk management, and internal controls. In this lesson, we'll look at the difference between internal and external assessments. We'll also look at penetration testing, one of the more common assessments that need to be performed. When an audit or assessment is done, it'll be classified as either an internal or external assessment. An internal audit is performed by the organization's employees to provide an in-depth analysis of the organization's business processes. These internal audits should be performed on a regular basis and focus on the needs and priorities of the organization. External audits, on the other hand, are performed by an independent third party. An external audit ensures that the organization's practices meet industry standards and identifies any areas the internal audit might have missed. Performing internal and external audits and assessments provides a full accounting of the organization's policies and procedures and allows the organization to quickly identify and fix any shortcomings. Performing these audits and assessments fosters transparency and accountability and builds trust among stakeholders. One of the more common assessments that should be performed on a regular basis is a penetration test.",
      "summary": "Audits and assessments are essential for ensuring organizational integrity and compliance, with internal audits conducted by employees focusing on business processes and external audits performed by third parties to validate adherence to industry standards. This section emphasizes the importance of both types of assessments, including penetration testing, to identify vulnerabilities and enhance cybersecurity and risk management. Regular audits foster transparency, accountability, and trust among stakeholders, enabling organizations to address shortcomings effectively.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.1",
        "title": "Audits",
        "content_type": "video",
        "filename": "12.3.1_Audits_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.1_Audits_[video].txt",
        "word_count": 941,
        "has_content": true
      },
      "section_header": "Internal and External",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.1_chunk_2",
      "content": "Penetration testing, also called pen testing or ethical hacking, involves hacking into a network to discover any vulnerabilities and weaknesses so they can be remediated before they're exploited by a malicious hacker. The penetration test utilizes the same techniques that a hacker would use, but the pen tester has written permission to perform the audit, and the scope of the test is clearly defined before anything is done. A penetration test will typically consist of five steps. These include reconnaissance, scanning, vulnerability assessment, exploitation, and reporting. In the reconnaissance phase, the pen tester begins gathering information about their target. This can include gathering publicly available information, using social engineering techniques, and dumpster diving. The second step is scanning the target. At this point, the tester is actively engaged with the target. Various tools are used to gather in-depth information about the network, such as live hosts, open ports, and more. During the vulnerability assessment phase, the pen tester takes all the information they've gathered so far and identifies all potential vulnerabilities that may exist on the network. The pen tester then moves into the next phase and attempts to exploit the confirmed vulnerabilities. The final step, reporting, involves compiling a detailed analysis of the organization's security systems. This includes all discovered vulnerabilities that were exploited, along with recommendations to remediate the vulnerabilities. When defining the rules of the penetration test, the first step is to determine whether an unknown, partially known, or known test environment will be used. Let's look at the difference in each of these. An unknown test is when an ethical hacker has no information about the target or network. This test is the best for simulating an outside attack and ignores insider threats. The major drawback to this type of test is that it takes more time and is much more expensive, mostly because a lot of time and resources must go into the reconnaissance and scanning phases. A known test is the opposite of an unknown test. The pen tester is given full knowledge of the network, computer systems, and infrastructure. The known test environment allows a comprehensive and thorough test of the organization's security. Still, it's not very realistic, as an attacker will rarely have all the information handed over to them. The partially known testing environment simulates an insider threat. The tester is given partial information about the network and computer systems. This can be IP configurations, email lists, computer names, or other information an insider would realistically have. This type of test requires less reconnaissance and scanning but doesn't give all the information to the pen tester. Aside from testing network security, physical penetration testing should also be performed. In this type of test, the penetration tester attempts to gain access to restricted areas, sensitive information, or critical assets within the organization using techniques like social engineering, tailgating, lock picking, bypassing alarms or surveillance systems, and exploiting physical vulnerabilities. Red team and blue team are other terms you'll run across. In the cybersecurity field, an offensive security team is called a red team, and a defensive security team is called a blue team. As the red team attempts to break into a system, the blue team works to keep them out.",
      "summary": "Penetration testing, or ethical hacking, is a proactive security measure that simulates cyberattacks to identify and remediate vulnerabilities within a network. The process consists of five key phases: reconnaissance, scanning, vulnerability assessment, exploitation, and reporting, with various testing environments (unknown, known, and partially known) tailored to simulate different attack scenarios. Additionally, physical penetration testing assesses vulnerabilities in physical security, while red teams (offensive) and blue teams (defensive) collaborate to enhance overall cybersecurity resilience.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.1",
        "title": "Audits",
        "content_type": "video",
        "filename": "12.3.1_Audits_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.1_Audits_[video].txt",
        "word_count": 941,
        "has_content": true
      },
      "section_header": "Penetration Testing",
      "timestamp_range": ""
    },
    {
      "chunk_id": "12.3.1_chunk_3",
      "content": "That'll wrap up this lesson on audits and assessments. In this lesson, we first looked at the benefits of performing audits and assessments and the difference between internal and external audits. We then went over penetration testing, including the steps involved and the different types of penetration tests that can be performed.",
      "summary": "This lesson covers the importance of audits and assessments in cybersecurity, highlighting the distinctions between internal and external audits. It also delves into penetration testing, outlining the various types and the systematic steps involved in conducting these tests to identify vulnerabilities within a system. Understanding these concepts is crucial for enhancing an organization's security posture.",
      "metadata": {
        "chapter_num": "12",
        "section_num": "12.3.1",
        "title": "Audits",
        "content_type": "video",
        "filename": "12.3.1_Audits_[video].txt",
        "file_path": "data_raw/12_Risk_Management_Processes/12.3.1_Audits_[video].txt",
        "word_count": 941,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 3
}