{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.2.5",
    "title": "Biometrics and Authentication Technologies",
    "content_type": "video",
    "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
    "word_count": 756,
    "has_content": true
  },
  "full_content": "In this lesson, we'll look at biometrics and some of the other technologies used for multifactor authentication. Remember, authentication is the process of verifying a claimed identity. And to verify an identity, we need a unique piece of information that could only come from one person. Biometric authentication has come a long way. You're probably familiar with fingerprint and retina scans, but did you know that people can also be identified by their iris, facial structure, and even by their gait when they walk? Biometric authentication requires capturing and storing a unique physical attribute in a biometric system. The initial capture is called enrollment. Subsequent authentication attempts are then tested against the stored biometric template. A few key parameters can determine whether an attribute is viable. First, the physical attribute should be universal – something that everyone has. Second, the attribute should be unique. It should be measurable and so distinctive that it can be used to tell people apart. Third, the attribute should be permanent – in other words, it should hold up to aging. For example, a person's face might change considerably over time, but their fingerprint or retina will stay the same. Fourth, the attribute must be collectable. In other words, how easy is it to acquire this measurable attribute? If collecting the measurement is difficult or invasive, it probably won't work. Lastly, the attribute must be difficult to duplicate. For example, if the attribute is the person's voice, it might be possible to evade the system using an audio recording. But if the attribute is the person's retina, then it's much more difficult to circumvent. If errors do occur, they can be labeled as a false positive or a false negative. A false positive occurs when the biometric system returns a positive match and identifies an unauthorized user as a legitimate user. A false negative occurs when the biometric system returns a negative match when a legitimate user tries to authenticate. Now let's look at some other technologies that are used for authentication. You've probably already used a lot of these methods. To provide an extra layer of security for their employees, some organizations use authenticator applications for their remote employees. An authenticator app, typically installed on a smartphone, provides a 6- to 8-digit code. Every 30 seconds, that code changes. The employee enter their username and password along with the code from the authenticator app, providing additional verification that you are who you say you are. A similar method that you may have used is a one-time password. Some banks use this method to allow ATM withdrawals without using a debit card or to let customers access their accounts from the internet. An application or token creates a one-time password. This password will only work for a single login. After that, the password expires. The password also expires if it isn't used withing a short period of time. These one-time passwords can be sent to the users several ways. For example, the one-time password can be sent using the Short Message Service, or SMS. When this option is selected, an SMS message with a one-time code or password is sent to your previously verified phone number. This code can then be used to verify your identify and complete your login. Similarly, if you chose to receive your code through the phone, you'll get a phone call and an automated voice will provide you with a one-time code or password. Push notification authentication can also be used to grant access to an account. For example, when you log in to your account, you'll enter your username, but instead of a password, you receive an access request notification on your mobile device. You can then view the authentication details and approve or deny access, typically with a simple press of a button. One advantage of using this authentication method is that you don't have to remember passwords. However, this method only works with the services provided by a specific company. As a result, there are a limited number of applications that integrate with their services. This makes them unavailable to organizations that use enterprise-level and proprietary solutions. That's it for this lesson. In this lesson, we looked at biometric systems and several other authentication technologies used for multifactor authentication.",
  "chunks": [
    {
      "chunk_id": "4.2.5_chunk_1",
      "content": "In this lesson, we'll look at biometrics and some of the other technologies used for multifactor authentication. Remember, authentication is the process of verifying a claimed identity. And to verify an identity, we need a unique piece of information that could only come from one person.",
      "summary": "Biometrics and Advanced Authentication: In this lesson, we'll look at biometrics and some of the other technologies used for multifactor authentication. Remember, authentication is the process of verifying a claimed identity.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Biometrics and Advanced Authentication",
      "timestamp_range": "00:00-00:20"
    },
    {
      "chunk_id": "4.2.5_chunk_2",
      "content": "Biometric authentication has come a long way. You're probably familiar with fingerprint and retina scans, but did you know that people can also be identified by their iris, facial structure, and even by their gait when they walk? Biometric authentication requires capturing and storing a unique physical attribute in a biometric system. The initial capture is called enrollment. Subsequent authentication attempts are then tested against the stored biometric template. A few key parameters can determine whether an attribute is viable. First, the physical attribute should be universal – something that everyone has. Second, the attribute should be unique. It should be measurable and so distinctive that it can be used to tell people apart. Third, the attribute should be permanent – in other words, it should hold up to aging. For example, a person's face might change considerably over time, but their fingerprint or retina will stay the same. Fourth, the attribute must be collectable. In other words, how easy is it to acquire this measurable attribute? If collecting the measurement is difficult or invasive, it probably won't work. Lastly, the attribute must be difficult to duplicate. For example, if the attribute is the person's voice, it might be possible to evade the system using an audio recording. But if the attribute is the person's retina, then it's much more difficult to circumvent. If errors do occur, they can be labeled as a false positive or a false negative. A false positive occurs when the biometric system returns a positive match and identifies an unauthorized user as a legitimate user. A false negative occurs when the biometric system returns a negative match when a legitimate user tries to authenticate.",
      "summary": "Biometrics: Biometric authentication requires capturing and storing a unique physical attribute in a biometric system. Subsequent authentication attempts are then tested against the stored biometric template.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Biometrics",
      "timestamp_range": "00:20-02:04"
    },
    {
      "chunk_id": "4.2.5_chunk_3",
      "content": "Now let's look at some other technologies that are used for authentication. You've probably already used a lot of these methods.",
      "summary": "Now let's look at some other technologies that are used for authentication. You've probably already used a lot of these methods.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Authentication Technologies",
      "timestamp_range": "02:04-02:11"
    },
    {
      "chunk_id": "4.2.5_chunk_4",
      "content": "To provide an extra layer of security for their employees, some organizations use authenticator applications for their remote employees. An authenticator app, typically installed on a smartphone, provides a 6- to 8-digit code. Every 30 seconds, that code changes. The employee enter their username and password along with the code from the authenticator app, providing additional verification that you are who you say you are.",
      "summary": "Authenticator Applications: To provide an extra layer of security for their employees, some organizations use authenticator applications for their remote employees. An authenticator app, typically installed on a smartphone, provides a 6- to 8-digit code.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Authenticator Applications",
      "timestamp_range": "02:11-02:35"
    },
    {
      "chunk_id": "4.2.5_chunk_5",
      "content": "A similar method that you may have used is a one-time password. Some banks use this method to allow ATM withdrawals without using a debit card or to let customers access their accounts from the internet. An application or token creates a one-time password. This password will only work for a single login. After that, the password expires. The password also expires if it isn't used withing a short period of time.",
      "summary": "One-Time Password: A similar method that you may have used is a one-time password. Some banks use this method to allow ATM withdrawals without using a debit card or to let customers access their accounts from the internet.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "One-Time Password",
      "timestamp_range": "02:35-02:57"
    },
    {
      "chunk_id": "4.2.5_chunk_6",
      "content": "These one-time passwords can be sent to the users several ways. For example, the one-time password can be sent using the Short Message Service, or SMS. When this option is selected, an SMS message with a one-time code or password is sent to your previously verified phone number. This code can then be used to verify your identify and complete your login.",
      "summary": "Short message service (SMS): These one-time passwords can be sent to the users several ways. For example, the one-time password can be sent using the Short Message Service, or SMS.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Short message service (SMS)",
      "timestamp_range": "02:57-03:19"
    },
    {
      "chunk_id": "4.2.5_chunk_7",
      "content": "Similarly, if you chose to receive your code through the phone, you'll get a phone call and an automated voice will provide you with a one-time code or password.",
      "summary": "Similarly, if you chose to receive your code through the phone, you'll get a phone call and an automated voice will provide you with a one-time code or password.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Phone Call",
      "timestamp_range": "03:19-03:27"
    },
    {
      "chunk_id": "4.2.5_chunk_8",
      "content": "Push notification authentication can also be used to grant access to an account. For example, when you log in to your account, you'll enter your username, but instead of a password, you receive an access request notification on your mobile device. You can then view the authentication details and approve or deny access, typically with a simple press of a button. One advantage of using this authentication method is that you don't have to remember passwords. However, this method only works with the services provided by a specific company. As a result, there are a limited number of applications that integrate with their services. This makes them unavailable to organizations that use enterprise-level and proprietary solutions.",
      "summary": "Push Notification Authentication: Push notification authentication can also be used to grant access to an account. You can then view the authentication details and approve or deny access, typically with a simple press of a button.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Push Notification Authentication",
      "timestamp_range": "03:27-04:07"
    },
    {
      "chunk_id": "4.2.5_chunk_9",
      "content": "That's it for this lesson. In this lesson, we looked at biometric systems and several other authentication technologies used for multifactor authentication.",
      "summary": "That's it for this lesson. In this lesson, we looked at biometric systems and several other authentication technologies used for multifactor authentication.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "04:07-04:17"
    }
  ],
  "num_chunks": 9,
  "document_summary": "Biometrics and Authentication Technologies (video): Remember, authentication is the process of verifying a claimed identity. Push notification authentication can also be used to grant access to an account. You can then view the authentication details and approve or deny access, typically with a simple press of a button."
}