{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.2.7",
    "title": "Use Single Sign-on",
    "content_type": "video",
    "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
    "word_count": 758,
    "has_content": true
  },
  "full_content": "In this demo, we're going to look at single sign-on, or SSO. Now, before we begin, I want to point out that you've probably used single sign-on without even knowing it. In fact, if you have a Gmail or Facebook account, then you've definitely used single sign-on. And if you've ever logged into a Windows domain on a computer, you've used single sign-on there too. Single sign-on is an authentication method that requires you to log in only once to have access to a wide range of services. In a domain, these services include things like file servers and print servers. When you log in, you can access the file server without providing authentication credentials again. It's really nice. Now, we aren't going to see single sign-on with a domain in this demo. Instead, we're going to look at single sign-on with Google internet services. Let's start by logging in to a google account. You're probably familiar with Google's email service, Gmail. Let's go to gmail.com and enter our login information. We've logged into Gmail. Because we logged into our single Gmail account, now we have access to all of these Googles services without needing to provide authentication credentials again. There are a lot of them. All of these services fall under the single sign-on of Google. For example, let's click the YouTube icon, which will take us to YouTube's page. In the top right here, notice that we're automatically signed in. We didn't need to type our username or password. This is because YouTube is connected with Google, which uses a single sign-on service. The same is true for other Google services. If we go back and click on Google Drive, we have access to that as well. No need to log in. Let's search LinkedIn in Google. Click Join Now. Notice here, instead of creating an account with LinkedIn directly, we can create an account with Google. This creates a single sign-on link of sorts between LinkedIn and Google that makes it so when we're logged in on Google, we're also logged in on LinkedIn. Let's try another. Let's go to wordpress.com. Click Log In and look down here. Instead of creating an account, we can link our Google account by clicking Continue with Google. When we do, we're asked which account to link. We only have one, so I'll click on it. And now, after we wait a minute or two, an account will be created, and we're logged in to the service without needing to provide our password. Again, this is because of the single sign-on functionality that's been implemented between WordPress and Google. Now, because everything is linked to our Google account, when we log out of it, we're also logged out of those services. Let's do that. We'll log out of Gmail. The page will refresh, and we're asked to log in. So, what happened with Wordpress? Let's go back and look. I'll type ‘wordpress.com' and press Enter. Back on WordPress, we're still logged in. This is probably because of how the session cookies are handled. We know we're logged out of Google, so let's log out of WordPress. I'm taken back to the logon page. Click Sign in. We're taken back to the Log in to your account page. I'll click Sign in with Google. Notice my account info here. My password is automatically populated. I'll click Next. After just a few seconds, I'm logged back into WordPress. Now, guess what else happened? We were actually logging into our Google account again. If I jump back over to my Gmail account, you can see that I was logged back into there, too. As you can see, single sign-on can be extremely useful and convenient. However, as we know all too well, convenience comes with risk. For example, using single sign-on presents the risk that if someone were to compromise a single account, they could potentially have access to any service that has been linked to that account. One thing that can protect against this is multi-factor authentication, such as requiring a one-time key to access different services. That's it for this demonstration. In this demo, we looked at single sign-on. We looked at a few different single sign-on features and how a single account can be used to access multiple services.",
  "chunks": [
    {
      "chunk_id": "4.2.7_chunk_1",
      "content": "In this demo, we're going to look at single sign-on, or SSO. Now, before we begin, I want to point out that you've probably used single sign-on without even knowing it. In fact, if you have a Gmail or Facebook account, then you've definitely used single sign-on. And if you've ever logged into a Windows domain on a computer, you've used single sign-on there too. Single sign-on is an authentication method that requires you to log in only once to have access to a wide range of services. In a domain, these services include things like file servers and print servers. When you log in, you can access the file server without providing authentication credentials again. It's really nice. Now, we aren't going to see single sign-on with a domain in this demo. Instead, we're going to look at single sign-on with Google internet services.",
      "summary": "Using Single Sign-on: Single sign-on is an authentication method that requires you to log in only once to have access to a wide range of services. When you log in, you can access the file server without providing authentication credentials again.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "Using Single Sign-on",
      "timestamp_range": "00:00-00:50"
    },
    {
      "chunk_id": "4.2.7_chunk_2",
      "content": "Let's start by logging in to a google account. You're probably familiar with Google's email service, Gmail. Let's go to gmail.com and enter our login information. We've logged into Gmail. Because we logged into our single Gmail account, now we have access to all of these Googles services without needing to provide authentication credentials again. There are a lot of them. All of these services fall under the single sign-on of Google. For example, let's click the YouTube icon, which will take us to YouTube's page. In the top right here, notice that we're automatically signed in. We didn't need to type our username or password. This is because YouTube is connected with Google, which uses a single sign-on service. The same is true for other Google services. If we go back and click on Google Drive, we have access to that as well. No need to log in.",
      "summary": "SSO with Google: Because we logged into our single Gmail account, now we have access to all of these Googles services without needing to provide authentication credentials again. If we go back and click on Google Drive, we have access to that as well.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "SSO with Google",
      "timestamp_range": "00:50-01:47"
    },
    {
      "chunk_id": "4.2.7_chunk_3",
      "content": "Let's search LinkedIn in Google. Click Join Now. Notice here, instead of creating an account with LinkedIn directly, we can create an account with Google. This creates a single sign-on link of sorts between LinkedIn and Google that makes it so when we're logged in on Google, we're also logged in on LinkedIn.",
      "summary": "Linkedin and Google Single Sign On: Notice here, instead of creating an account with LinkedIn directly, we can create an account with Google. This creates a single sign-on link of sorts between LinkedIn and Google that makes it so when we're logged in on Google, we're also logged in on LinkedIn.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "Linkedin and Google Single Sign On",
      "timestamp_range": "01:47-02:12"
    },
    {
      "chunk_id": "4.2.7_chunk_4",
      "content": "Let's try another. Let's go to wordpress.com. Click Log In and look down here. Instead of creating an account, we can link our Google account by clicking Continue with Google. When we do, we're asked which account to link. We only have one, so I'll click on it. And now, after we wait a minute or two, an account will be created, and we're logged in to the service without needing to provide our password. Again, this is because of the single sign-on functionality that's been implemented between WordPress and Google.",
      "summary": "Enable SSO on an Account: Instead of creating an account, we can link our Google account by clicking Continue with Google. And now, after we wait a minute or two, an account will be created, and we're logged in to the service without needing to provide our password.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "Enable SSO on an Account",
      "timestamp_range": "02:12-02:49"
    },
    {
      "chunk_id": "4.2.7_chunk_5",
      "content": "Now, because everything is linked to our Google account, when we log out of it, we're also logged out of those services. Let's do that. We'll log out of Gmail. The page will refresh, and we're asked to log in. So, what happened with Wordpress? Let's go back and look. I'll type ‘wordpress.com' and press Enter. Back on WordPress, we're still logged in. This is probably because of how the session cookies are handled. We know we're logged out of Google, so let's log out of WordPress. I'm taken back to the logon page. Click Sign in. We're taken back to the Log in to your account page. I'll click Sign in with Google. Notice my account info here. My password is automatically populated. I'll click Next. After just a few seconds, I'm logged back into WordPress. Now, guess what else happened? We were actually logging into our Google account again. If I jump back over to my Gmail account, you can see that I was logged back into there, too.",
      "summary": "Sign Out: Now, because everything is linked to our Google account, when we log out of it, we're also logged out of those services. The page will refresh, and we're asked to log in.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "Sign Out",
      "timestamp_range": "02:49-03:59"
    },
    {
      "chunk_id": "4.2.7_chunk_6",
      "content": "As you can see, single sign-on can be extremely useful and convenient. However, as we know all too well, convenience comes with risk. For example, using single sign-on presents the risk that if someone were to compromise a single account, they could potentially have access to any service that has been linked to that account. One thing that can protect against this is multi-factor authentication, such as requiring a one-time key to access different services. That's it for this demonstration. In this demo, we looked at single sign-on. We looked at a few different single sign-on features and how a single account can be used to access multiple services.",
      "summary": "However, as we know all too well, convenience comes with risk. One thing that can protect against this is multi-factor authentication, such as requiring a one-time key to access different services.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.7",
        "title": "Use Single Sign-on",
        "content_type": "video",
        "filename": "4.2.7_Use_Single_Sign-on_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.7_Use_Single_Sign-on_[video].txt",
        "word_count": 758,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "03:59-04:35"
    }
  ],
  "num_chunks": 6,
  "document_summary": "Use Single Sign-on (video): Single sign-on is an authentication method that requires you to log in only once to have access to a wide range of services. When you log in, you can access the file server without providing authentication credentials again. Because we logged into our single Gmail account, now we have access to all of these Googles services without needing to provide authentication credentials again."
}