{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.4.2",
    "title": "Joining a Domain",
    "content_type": "video",
    "filename": "4.4.2_Joining_a_Domain_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
    "word_count": 1663,
    "has_content": true
  },
  "full_content": "In this demonstration, we're going to review how to join a Windows workstation to an Active Directory domain. I'll come down to the Start button, right-click, and then go to System. Beside Related links, click on Domain or workgroup. This will launch our System Properties window. Toward the bottom of the window, you can see that it says, \"To rename the computer or change to a domain or workgroup, click Change.\" That seems straightforward, so let's click on Change. Down here, you can see it's part of a workgroup, and the name of the workgroup is WorkGroup. This is the default workgroup that's set up when you install a Windows system. It's not joined to a domain yet. We need to change that. In order to join this system to a domain, we need to create a domain. That means we have to install a Windows server system, install Active Directory on it, make it a domain controller, and then configure a domain. Let's switch over to my Windows Server system. As you can see here, on this server system, I've already done all of those tasks. This is my Windows server system. Note, over here, that it already has the Active Directory Domain Services role installed. DNS is installed, and the server is functioning as the domain controller for the domain named CorpNet.xyz. Before we switch back over to the workstation system, I want to point out something very important: this server is also functioning as my DNS server for the domain. Depending on the implementation you're working in, this may or may not be the case in the real world. I've set it up this way for convenience in a demonstration environment. I have all of my services, including directory services and DNS, all running on the same system. In a large implementation, it's very likely that the DNS server would be configured to run on a different server. We don't have to worry about that here. We just need to remember that this server, with an IP address of 10.10.10.5, is my DNS server for my CorpNet domain. With that information in mind, let's go ahead and join this workstation to the CorpNet.xyz domain. We need to get back to the System Properties window, where we were a few minutes ago. Keep in mind that there are a few different ways to get to System Properties, and as Windows evolves, it could be different in the future. On the Computer Name tab, we have an option called Change. Click it. Notice we could change the computer name, here, if we wanted to. This is also where we can make this workstation a member of a domain. I'm not going to do that just yet because currently, this workstation doesn't know how to contact the domain controller. It's not configured to use my Active Directory DNS server. We need to fix that before we can proceed. Let's go down to our Network icon, down here in the notification area. Right-click and go to Network and Internet settings. We'll click here, where it says Ethernet. If I scroll down a bit, you can see our IP assignment, which is set to Automatic, or DHCP. Our IP is coming via DHCP, and so is our DNS information. And in this case, that's a problem Let's fix it. If your network is set up so that your DHCP server is handing out the correct IP address for your Active Directory DNS server, you don't actually have to make any changes. If it's not, then you need to go manually specify the IP address pointing to the DNS server that's functioning within your Active Directory environment. That's the case we have here. I happen to know that the DHCP server on this network is handing out a different IP address for the DNS server than the one that's being used by my Active Directory domain. Before I'll be able to contact the domain controller and locate the CorpNet.xyz domain, we're going to need to change that. Let's click on Edit, click the dropdown, and change this setting to Manual. Now we'll change this one from Off to On. I could just change the DNS information on this workstation, but I'm going to go ahead and configure it with a static IP address. That's just my preference. In other words, I could manually set my DNS to point to my Active Directory server and obtain the IP from the DHCP dynamically. Let's configure the settings now. For the IP, I'll use 10.10.10.199. I know this isn't an IP that my DHCP server is handing out, so I'm safe to use it here. My subnet mask is 255.255.255.0. The gateway is my router IP address, which is 10.10.10.1. Now the DNS info, 10.10.10.5. Remember, I pointed out a minute ago that it's very important to remember that DNS is running on the same server as Active Directory. Its IP address is 10.10.10.5. So that's the value we just put into this field. We'll click Save. I'm going to come down to Search, type in cmd to get to a Command Prompt, use elevated privileges, and type Ipconfig /all. Note that my we can confirm that our DNS server has been changed to 10.10.10.5. That's good. All is well in the world. Now my workstation will be able to contact my domain controller in the CorpNet.xyz domain. With that set up, we're ready to change settings and join the domain. We'll go back to System Properties. I'll mark Domain and then enter in the name of the domain that I want to join, CorpNet.xyz, and click OK. Of course, before I can join this workstation to the domain, I have to provide the credentials of an administrative domain user. Not the local system, but an administrative user in the domain itself. That username is dfellows. As I said earlier, we're not looking at an administrator user on this local system; we're looking at for an administrator in CorpNet.xyz. So I have to be sure to put in the right password for that user account. I'll go ahead and enter in the password for the administrator user account in my CorpNet.xyz domain. Click OK. Everything went well. I was able to authenticate. I know that because it's welcoming me to the domain. I'll click OK. It does require the system to restart before the changes can take place. I'll click OK, and I'll Restart Now. We'll click that option and wait just a minute while the system reboots. At this point, my system has rebooted. I have the option of logging in. I was logged in as my local user prior to joining the domain, and I can still log in as my local user after joining the domain as well. But now there's a new option available: Log in as Other user. I can now log in using a domain user account instead of a local user account. You see, domain user accounts have a lot of advantages. For example, I could log in to this workstation using a domain user account. I could go to other workstations in the domain and log in using that very same user account. This means I don't have to duplicate my user account on every single workstation in my network that I'm going to want to log in from. If I were functioning in a workgroup situation, I would. I would have to go through and make myself a local user on each and every workstation in my network and configure that user account with the same password. That would be a pain. But by using a domain user account, I can have one user account defined in the domain and use it to log in to all of the workstations in the domain. If you're going to log in as a domain user account, you need to log in a little bit differently. You'll note down here that it tells me that I'm going to be signing into CorpNet. So, technically, I could type dfellows right here, and it would authenticate me using the dfellows user account in the domain instead of the local user account on the local system. However, there may be times when this option is not automatically configured, or you need to sign in to another domain that's not listed here. The way you do that is to type the name of the domain first. In this example, we're going to log in to CorpNet. Then I put a backslash, and then I put in the name of the user in the domain that I want to use for authentication. In this case, I'm going to log in as the dfellows user in the CorpNet domain. I'm essentially telling the workstation where to locate the user account I want to log in from. Because I specified that the dfellows user here resides in CorpNet, it won't use the local user account on the local system to authenticate. Instead, it'll use the dfellows user in the domain. I'll go ahead and log in with my password. Because I'm logging in to the system for the first time using a domain user account, we need to provision that user account on this system. I have to have my profile directory set up. And I need to have my default apps installed. All of this has to happen for that domain dfellows user account on the local system. It'll take just a minute to complete. The provisioning process is complete, so my dfellows domain user now has a profile on this local workstation. That's it for this demonstration. In this demo, we joined a Windows workstation to a domain.",
  "chunks": [
    {
      "chunk_id": "4.4.2_chunk_1",
      "content": "In this demonstration, we're going to review how to join a Windows workstation to an Active Directory domain. I'll come down to the Start button, right-click, and then go to System. Beside Related links, click on Domain or workgroup. This will launch our System Properties window. Toward the bottom of the window, you can see that it says, \"To rename the computer or change to a domain or workgroup, click Change.\" That seems straightforward, so let's click on Change. Down here, you can see it's part of a workgroup, and the name of the workgroup is WorkGroup. This is the default workgroup that's set up when you install a Windows system. It's not joined to a domain yet. We need to change that. In order to join this system to a domain, we need to create a domain. That means we have to install a Windows server system, install Active Directory on it, make it a domain controller, and then configure a domain. Let's switch over to my Windows Server system.",
      "summary": "Join a Domain: In this demonstration, we're going to review how to join a Windows workstation to an Active Directory domain. That means we have to install a Windows server system, install Active Directory on it, make it a domain controller, and then configure a domain.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Join a Domain",
      "timestamp_range": "00:00-00:58"
    },
    {
      "chunk_id": "4.4.2_chunk_2",
      "content": "As you can see here, on this server system, I've already done all of those tasks. This is my Windows server system. Note, over here, that it already has the Active Directory Domain Services role installed. DNS is installed, and the server is functioning as the domain controller for the domain named CorpNet.xyz. Before we switch back over to the workstation system, I want to point out something very important: this server is also functioning as my DNS server for the domain. Depending on the implementation you're working in, this may or may not be the case in the real world. I've set it up this way for convenience in a demonstration environment. I have all of my services, including directory services and DNS, all running on the same system. In a large implementation, it's very likely that the DNS server would be configured to run on a different server. We don't have to worry about that here. We just need to remember that this server, with an IP address of 10.10.10.5, is my DNS server for my CorpNet domain. With that information in mind, let's go ahead and join this workstation to the CorpNet.xyz domain. We need to get back to the System Properties window, where we were a few minutes ago. Keep in mind that there are a few different ways to get to System Properties, and as Windows evolves, it could be different in the future. On the Computer Name tab, we have an option called Change. Click it. Notice we could change the computer name, here, if we wanted to. This is also where we can make this workstation a member of a domain.",
      "summary": "Prepare the System: As you can see here, on this server system, I've already done all of those tasks. DNS is installed, and the server is functioning as the domain controller for the domain named CorpNet.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Prepare the System",
      "timestamp_range": "00:58-02:24"
    },
    {
      "chunk_id": "4.4.2_chunk_3",
      "content": "I'm not going to do that just yet because currently, this workstation doesn't know how to contact the domain controller. It's not configured to use my Active Directory DNS server. We need to fix that before we can proceed. Let's go down to our Network icon, down here in the notification area. Right-click and go to Network and Internet settings. We'll click here, where it says Ethernet. If I scroll down a bit, you can see our IP assignment, which is set to Automatic, or DHCP. Our IP is coming via DHCP, and so is our DNS information. And in this case, that's a problem Let's fix it. If your network is set up so that your DHCP server is handing out the correct IP address for your Active Directory DNS server, you don't actually have to make any changes. If it's not, then you need to go manually specify the IP address pointing to the DNS server that's functioning within your Active Directory environment. That's the case we have here. I happen to know that the DHCP server on this network is handing out a different IP address for the DNS server than the one that's being used by my Active Directory domain. Before I'll be able to contact the domain controller and locate the CorpNet.xyz domain, we're going to need to change that. Let's click on Edit, click the dropdown, and change this setting to Manual. Now we'll change this one from Off to On. I could just change the DNS information on this workstation, but I'm going to go ahead and configure it with a static IP address. That's just my preference. In other words, I could manually set my DNS to point to my Active Directory server and obtain the IP from the DHCP dynamically. Let's configure the settings now. For the IP, I'll use 10.10.10.199. I know this isn't an IP that my DHCP server is handing out, so I'm safe to use it here. My subnet mask is 255.255.255.0. The gateway is my router IP address, which is 10.10.10.1. Now the DNS info, 10.10.10.5. Remember, I pointed out a minute ago that it's very important to remember that DNS is running on the same server as Active Directory. Its IP address is 10.10.10.5. So that's the value we just put into this field. We'll click Save. I'm going to come down to Search, type in cmd to get to a Command Prompt, use elevated privileges, and type Ipconfig /all. Note that my we can confirm that our DNS server has been changed to 10.10.10.5. That's good. All is well in the world. Now my workstation will be able to contact my domain controller in the CorpNet.xyz domain.",
      "summary": "Configure DNS Server Address: I'm not going to do that just yet because currently, this workstation doesn't know how to contact the domain controller. Let's go down to our Network icon, down here in the notification area.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Configure DNS Server Address",
      "timestamp_range": "02:24-05:00"
    },
    {
      "chunk_id": "4.4.2_chunk_4",
      "content": "With that set up, we're ready to change settings and join the domain. We'll go back to System Properties. I'll mark Domain and then enter in the name of the domain that I want to join, CorpNet.xyz, and click OK. Of course, before I can join this workstation to the domain, I have to provide the credentials of an administrative domain user. Not the local system, but an administrative user in the domain itself. That username is dfellows. As I said earlier, we're not looking at an administrator user on this local system; we're looking at for an administrator in CorpNet.xyz. So I have to be sure to put in the right password for that user account. I'll go ahead and enter in the password for the administrator user account in my CorpNet.xyz domain. Click OK. Everything went well. I was able to authenticate. I know that because it's welcoming me to the domain. I'll click OK. It does require the system to restart before the changes can take place. I'll click OK, and I'll Restart Now. We'll click that option and wait just a minute while the system reboots.",
      "summary": "Join the Domain: With that set up, we're ready to change settings and join the domain. I'll mark Domain and then enter in the name of the domain that I want to join, CorpNet.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Join the Domain",
      "timestamp_range": "05:00-06:04"
    },
    {
      "chunk_id": "4.4.2_chunk_5",
      "content": "At this point, my system has rebooted. I have the option of logging in. I was logged in as my local user prior to joining the domain, and I can still log in as my local user after joining the domain as well. But now there's a new option available: Log in as Other user. I can now log in using a domain user account instead of a local user account. You see, domain user accounts have a lot of advantages. For example, I could log in to this workstation using a domain user account. I could go to other workstations in the domain and log in using that very same user account. This means I don't have to duplicate my user account on every single workstation in my network that I'm going to want to log in from. If I were functioning in a workgroup situation, I would. I would have to go through and make myself a local user on each and every workstation in my network and configure that user account with the same password. That would be a pain. But by using a domain user account, I can have one user account defined in the domain and use it to log in to all of the workstations in the domain. If you're going to log in as a domain user account, you need to log in a little bit differently. You'll note down here that it tells me that I'm going to be signing into CorpNet. So, technically, I could type dfellows right here, and it would authenticate me using the dfellows user account in the domain instead of the local user account on the local system. However, there may be times when this option is not automatically configured, or you need to sign in to another domain that's not listed here. The way you do that is to type the name of the domain first. In this example, we're going to log in to CorpNet. Then I put a backslash, and then I put in the name of the user in the domain that I want to use for authentication. In this case, I'm going to log in as the dfellows user in the CorpNet domain. I'm essentially telling the workstation where to locate the user account I want to log in from. Because I specified that the dfellows user here resides in CorpNet, it won't use the local user account on the local system to authenticate. Instead, it'll use the dfellows user in the domain. I'll go ahead and log in with my password. Because I'm logging in to the system for the first time using a domain user account, we need to provision that user account on this system. I have to have my profile directory set up. And I need to have my default apps installed. All of this has to happen for that domain dfellows user account on the local system. It'll take just a minute to complete. The provisioning process is complete, so my dfellows domain user now has a profile on this local workstation.",
      "summary": "Log in as a Domain User: This means I don't have to duplicate my user account on every single workstation in my network that I'm going to want to log in from. I would have to go through and make myself a local user on each and every workstation in my network and configure that user account with the same password.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Log in as a Domain User",
      "timestamp_range": "06:04-08:33"
    },
    {
      "chunk_id": "4.4.2_chunk_6",
      "content": "That's it for this demonstration. In this demo, we joined a Windows workstation to a domain.",
      "summary": "That's it for this demonstration. In this demo, we joined a Windows workstation to a domain.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.2",
        "title": "Joining a Domain",
        "content_type": "video",
        "filename": "4.4.2_Joining_a_Domain_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.2_Joining_a_Domain_[video].txt",
        "word_count": 1663,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "08:33-08:38"
    }
  ],
  "num_chunks": 6,
  "document_summary": "Joining a Domain (video): That means we have to install a Windows server system, install Active Directory on it, make it a domain controller, and then configure a domain. DNS is installed, and the server is functioning as the domain controller for the domain named CorpNet. I'm not going to do that just yet because currently, this workstation doesn't know how to contact the domain controller."
}