{
  "metadata": {
    "chapter_num": "13",
    "section_num": "13.2.4",
    "title": "Data Protection and Policies Facts",
    "content_type": "text",
    "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
    "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
    "word_count": 1883,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Data protection and compliance encompass a range of practices and principles aimed at safeguarding sensitive information, ensuring privacy, and adhering to applicable laws and regulations. Data protection involves implementing measures to secure data against unauthorized access, loss, or misuse. It includes practices such as encryption, access controls, data backup, and secure storage. Compliance refers to conforming to legal, regulatory, and industry requirements relevant to data handling, privacy, security, and transparency. Organizations can safeguard individuals' privacy, ensure data security, fulfill legal requirements, and establish credibility with customers, partners, and regulatory authorities by comprehending and implementing these data protection and compliance principles. Compliance with applicable data protection laws, regulations, and standards is crucial for organizations to avoid legal liabilities, reputational damage, and financial penalties associated with noncompliance. Data protection Data loss prevention Data sovereignty and geographical considerations Data retention policies Data Protection Classifying data as \"at rest,\" \"in motion,\" and \"in use\" is crucial for effective data protection and security measures. By analyzing data based on its state (at rest, in motion, in use), organizations can tailor security measures and controls to address the specific risks and requirements associated with each data state. This classification helps organizations identify vulnerabilities, prioritize security investments, and ensure appropriate safeguards to protect sensitive data throughout its lifecycle. It also facilitates compliance with data protection regulations and industry best practices. Data at rest — this state means that the data is in some sort of persistent storage media. Examples of types of data that may be at rest include financial information stored in databases, archived audiovisual media, operational policies and other management documents, system configuration data, and more. In this state, it is usually possible to encrypt the data using techniques such as whole disk encryption, database encryption, and file- or folder-level encryption. It is also possible to apply permissions—access control lists (ACLs)—to ensure only authorized users can read or modify the data. ACLs can be applied only if access to the data is fully mediated through a trusted OS. Data in transit (or data in motion) — this is the state when data is transmitted over a network. Examples of types of data that may be in transit include website traffic, remote access traffic, data being synchronized between cloud repositories, and more. In this state, data can be protected by a transport encryption protocol, such as TLS or IPSec. With data at rest, there is a greater encryption challenge than with data in transit, as the encryption keys must be kept secure for longer. Transport encryption can use ephemeral (session) keys. Data in use (or data in processing) — this is the state when data is present in volatile memory, such as system RAM or CPU registers and cache. Examples of types of data that may be in use include documents open in a word processing application, database data that is currently being modified, event logs being generated while an operating system is running, and more. When a user works with data, it usually needs to be decrypted as it goes from in rest to in use. The data may stay decrypted for an entire work session, which puts it at risk. However, trusted execution environment (TEE) mechanisms, such as Intel Software Guard Extensions (software.intel.com/content/www/us/en/develop/topics/software-guard-extensions/details.html), can encrypt data as it exists in memory so that an untrusted process cannot decode the information. Due diligence in the context of data protection describes the comprehensive assessment and evaluation of an organization's data protection practices and measures. It involves examining and verifying the adequacy of data security controls, privacy policies, data handling procedures, and compliance with applicable laws and regulations. Data Loss Prevention To apply data guardianship policies and procedures, smaller organizations might classify and type data manually. However, an organization that creates and collects large amounts of personal data will usually need to use automated tools to assist with this task. There may also be a requirement to protect valuable intellectual property (IP) data. Data loss prevention (DLP) products automate the discovery and classification of data types and enforce rules so that data is not viewed or transferred without proper authorization. Such solutions will usually consist of the following components: Policy server — to configure classification, confidentiality, and privacy rules and policies, log incidents, and compile reports. Endpoint agents — to enforce policy on client computers, even when they are not connected to the network. Network agents — to scan communications at network borders and interface with web and messaging servers to enforce policy. DLP agents scan content in structured formats, such as a database with a formal access control model, or unstructured formats, such as email or word processing documents. A file cracking process is applied to unstructured data to render it in a consistent scannable format. The transfer of content to removable media, such as USB devices, by email, instant messaging, or even social media, can be blocked if it does not conform to a predefined policy. Most DLP solutions can extend the protection mechanisms to cloud storage services, using either a proxy to mediate access or the cloud service provider's API to perform scanning and policy enforcement. Creating a DLP policy in Office 365 Screenshot used with permission from Microsoft Description Remediation is the action the DLP software takes when it detects a policy violation. The following remediation mechanisms are typical: Alert only — copying is allowed, but the management system records an incident and may alert an administrator. Block — the user is prevented from copying the original file but retains access. The user may or may not be alerted to the policy violation, but it will be logged as an incident by the management engine. Quarantine — access to the original file is denied to the user (or possibly any user). This might be accomplished by encrypting the file in place or by moving it to a quarantine area in the file system. Tombstone — the original file is quarantined and replaced with one describing the policy violation and how the user can release it again. When configured to protect a communications channel such as email, DLP remediation might take place using client-side or server-side mechanisms. For example, some DLP solutions prevent the actual attaching of files to the email before it is sent. Others might scan the email attachments and message contents and then strip out certain data or stop the email from reaching its destination. Data Sovereignty and Geographical Considerations Some states and nations may respect data privacy more or less than others, and likewise, some nations may disapprove of the nature and content of certain data. They may even be suspicious of security measures such as encryption. When your data is stored or transmitted in other jurisdictions or when you collect data from citizens in other states or other countries, you may not \"own\" the data in the same way as you'd expect or like to. Data Sovereignty Data sovereignty refers to a jurisdiction preventing or restricting processing and storage from taking place on systems that do not physically reside within that jurisdiction. Data sovereignty may demand certain concessions on your part, such as using location-specific storage facilities in a cloud service. For example, GDPR protections are extended to any EU citizen while they are within EU or EEA (European Economic Area) borders. Data subjects can consent to allow a transfer, but there must be a meaningful option for them to refuse consent. If the transfer destination jurisdiction does not provide adequate privacy regulations (to a level comparable to GDPR), then contractual safeguards must be given to extend GDPR rights to the data subject. In the United States, companies can self-certify that the protections they offer are adequate under the Privacy Shield scheme (privacyshield.gov/US-Businesses). Maintaining compliance with data sovereignty requirements requires several approaches. Organizations ensure data localization by storing and processing data using datacenters or cloud providers within defined legal or geographic boundaries. Additionally, contractual agreements with vendors and service providers ensure data remains within approved boundaries by outlining responsibilities, restrictions, and mandatory safeguards. Geographical Considerations Storage locations might have to be carefully selected to mitigate data sovereignty issues. Most cloud providers allow a choice of datacenters for processing and storage, ensuring that information is not illegally transferred from a particular privacy jurisdiction without consent. Employees needing access from multiple geographic locations. Cloud-based file and database services can apply constraint-based access controls to validate the user's geographic location before authorizing access. Geolocation requirements impact data protection practices by requiring organizations to ensure data remains within a designated boundary, such as utilizing local datacenters or cloud providers. Geolocation restrictions affect data protection practices such as data replication and data dispersion. Geolocation requirements impact incident investigation and forensics activities because they often include jurisdiction-specific data access and sharing restrictions and other legal requirements. Data Retention Policies Data retention policies define how information in your possession is maintained and for how long. The key point to remember is that different types of data must be retained for different lengths of time based on legal and business requirements. Archiving information Destroying information when the retention limit is reached Handling information involved in litigation Review all the different types of information used in your organization and develop a policy that defines how long different types of data are retained and destroyed when the retention period is passed. Record this information in a clearly written policy, and never allow selective or arbitrary information destruction. It might make it appear that you are trying to hide evidence and could expose you to potential criminal charges. Benefits of Data Retention Policies Having a written policy and ensuring everyone in the organization follows it protects you from accusations of destroying evidence. Adhering to your data retention and destruction policy protects you and your organization. Reduced cost of discovery requests in the event of legal action. Responding to discovery requests can be time-consuming and costly. If old material has been destroyed, discovery costs are minimized. Reduced exposure during discovery. Minimizing the amount of electronic material an organization keeps reduces the amount of information that could expose an organization to potential litigation. Reduced hardware and software requirements for storing old data. Data Retention Best Practices Delete email messages after 90 days. Keep tax-related information for seven years. This timeframe should be defined by the applicable taxation authority. For example, the United States Internal Revenue Service requires tax information to be retained for seven years. Keep employee records for four years after an employee leaves the organization. Keep integral research, design, or patent documents for 25 years. Keep contracts with vendors and partners for five years after a contract has ended. Delete employee files after one year. All information should be destroyed before being disposed of. Simply deleting files can leave sensitive information behind. After creating your written data retention policy, use information classification labels to identify which retention policy rule is to be applied to specific data. Using classification labels allows you to use software tools to automate the data retention and destruction process.",
  "chunks": [
    {
      "chunk_id": "13.2.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces fundamental security concepts essential for protecting information systems. Key topics include risk management, network security, identity and access management, and cryptography, with a focus on practical applications such as implementing security controls and responding to incidents. This foundational knowledge equips learners to effectively safeguard organizational assets against evolving cyber threats.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_2",
      "content": "Data protection and compliance encompass a range of practices and principles aimed at safeguarding sensitive information, ensuring privacy, and adhering to applicable laws and regulations. Data protection involves implementing measures to secure data against unauthorized access, loss, or misuse. It includes practices such as encryption, access controls, data backup, and secure storage. Compliance refers to conforming to legal, regulatory, and industry requirements relevant to data handling, privacy, security, and transparency. Organizations can safeguard individuals' privacy, ensure data security, fulfill legal requirements, and establish credibility with customers, partners, and regulatory authorities by comprehending and implementing these data protection and compliance principles. Compliance with applicable data protection laws, regulations, and standards is crucial for organizations to avoid legal liabilities, reputational damage, and financial penalties associated with noncompliance.",
      "summary": "Data protection and compliance involve practices aimed at securing sensitive information and adhering to legal and regulatory standards. Key measures include encryption, access controls, data backup, and secure storage, which help prevent unauthorized access and data loss. By implementing these principles, organizations can protect privacy, ensure data security, and maintain credibility while avoiding legal liabilities and penalties.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "13.2.4 Data Protection and Policies Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_3",
      "content": "Data protection Data loss prevention Data sovereignty and geographical considerations Data retention policies Data Protection Classifying data as \"at rest,\" \"in motion,\" and \"in use\" is crucial for effective data protection and security measures. By analyzing data based on its state (at rest, in motion, in use), organizations can tailor security measures and controls to address the specific risks and requirements associated with each data state. This classification helps organizations identify vulnerabilities, prioritize security investments, and ensure appropriate safeguards to protect sensitive data throughout its lifecycle. It also facilitates compliance with data protection regulations and industry best practices. Data at rest — this state means that the data is in some sort of persistent storage media. Examples of types of data that may be at rest include financial information stored in databases, archived audiovisual media, operational policies and other management documents, system configuration data, and more. In this state, it is usually possible to encrypt the data using techniques such as whole disk encryption, database encryption, and file- or folder-level encryption. It is also possible to apply permissions—access control lists (ACLs)—to ensure only authorized users can read or modify the data. ACLs can be applied only if access to the data is fully mediated through a trusted OS. Data in transit (or data in motion) — this is the state when data is transmitted over a network. Examples of types of data that may be in transit include website traffic, remote access traffic, data being synchronized between cloud repositories, and more. In this state, data can be protected by a transport encryption protocol, such as TLS or IPSec. With data at rest, there is a greater encryption challenge than with data in transit, as the encryption keys must be kept secure for longer. Transport encryption can use ephemeral (session) keys. Data in use (or data in processing) — this is the state when data is present in volatile memory, such as system RAM or CPU registers and cache. Examples of types of data that may be in use include documents open in a word processing application, database data that is currently being modified, event logs being generated while an operating system is running, and more. When a user works with data, it usually needs to be decrypted as it goes from in rest to in use. The data may stay decrypted for an entire work session, which puts it at risk. However, trusted execution environment (TEE) mechanisms, such as Intel Software Guard Extensions (software.intel.com/content/www/us/en/develop/topics/software-guard-extensions/details.html), can encrypt data as it exists in memory so that an untrusted process cannot decode the information. Due diligence in the context of data protection describes the comprehensive assessment and evaluation of an organization's data protection practices and measures. It involves examining and verifying the adequacy of data security controls, privacy policies, data handling procedures, and compliance with applicable laws and regulations. Data Loss Prevention To apply data guardianship policies and procedures, smaller organizations might classify and type data manually. However, an organization that creates and collects large amounts of personal data will usually need to use automated tools to assist with this task. There may also be a requirement to protect valuable intellectual property (IP) data. Data loss prevention (DLP) products automate the discovery and classification of data types and enforce rules so that data is not viewed or transferred without proper authorization. Such solutions will usually consist of the following components: Policy server — to configure classification, confidentiality, and privacy rules and policies, log incidents, and compile reports. Endpoint agents — to enforce policy on client computers, even when they are not connected to the network. Network agents — to scan communications at network borders and interface with web and messaging servers to enforce policy. DLP agents scan content in structured formats, such as a database with a formal access control model, or unstructured formats, such as email or word processing documents. A file cracking process is applied to unstructured data to render it in a consistent scannable format. The transfer of content to removable media, such as USB devices, by email, instant messaging, or even social media, can be blocked if it does not conform to a predefined policy. Most DLP solutions can extend the protection mechanisms to cloud storage services, using either a proxy to mediate access or the cloud service provider's API to perform scanning and policy enforcement. Creating a DLP policy in Office 365 Screenshot used with permission from Microsoft Description Remediation is the action the DLP software takes when it detects a policy violation. The following remediation mechanisms are typical: Alert only — copying is allowed, but the management system records an incident and may alert an administrator. Block — the user is prevented from copying the original file but retains access. The user may or may not be alerted to the policy violation, but it will be logged as an incident by the management engine. Quarantine — access to the original file is denied to the user (or possibly any user). This might be accomplished by encrypting the file in place or by moving it to a quarantine area in the file system. Tombstone — the original file is quarantined and replaced with one describing the policy violation and how the user can release it again. When configured to protect a communications channel such as email, DLP remediation might take place using client-side or server-side mechanisms. For example, some DLP solutions prevent the actual attaching of files to the email before it is sent. Others might scan the email attachments and message contents and then strip out certain data or stop the email from reaching its destination. Data Sovereignty and Geographical Considerations Some states and nations may respect data privacy more or less than others, and likewise, some nations may disapprove of the nature and content of certain data. They may even be suspicious of security measures such as encryption. When your data is stored or transmitted in other jurisdictions or when you collect data from citizens in other states or other countries, you may not \"own\" the data in the same way as you'd expect or like to. Data Sovereignty Data sovereignty refers to a jurisdiction preventing or restricting processing and storage from taking place on systems that do not physically reside within that jurisdiction. Data sovereignty may demand certain concessions on your part, such as using location-specific storage facilities in a cloud service. For example, GDPR protections are extended to any EU citizen while they are within EU or EEA (European Economic Area) borders. Data subjects can consent to allow a transfer, but there must be a meaningful option for them to refuse consent. If the transfer destination jurisdiction does not provide adequate privacy regulations (to a level comparable to GDPR), then contractual safeguards must be given to extend GDPR rights to the data subject. In the United States, companies can self-certify that the protections they offer are adequate under the Privacy Shield scheme (privacyshield.gov/US-Businesses). Maintaining compliance with data sovereignty requirements requires several approaches. Organizations ensure data localization by storing and processing data using datacenters or cloud providers within defined legal or geographic boundaries. Additionally, contractual agreements with vendors and service providers ensure data remains within approved boundaries by outlining responsibilities, restrictions, and mandatory safeguards. Geographical Considerations",
      "summary": "This lesson emphasizes the importance of data protection through classification of data states—at rest, in motion, and in use—enabling organizations to implement tailored security measures and comply with regulations. It covers data loss prevention (DLP) strategies, which automate data classification and enforce policies to safeguard sensitive information, alongside considerations for data sovereignty that dictate how and where data can be stored and processed based on jurisdictional laws. Understanding these concepts is crucial for organizations to effectively manage risks and protect their data throughout its lifecycle.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_4",
      "content": "Storage locations might have to be carefully selected to mitigate data sovereignty issues. Most cloud providers allow a choice of datacenters for processing and storage, ensuring that information is not illegally transferred from a particular privacy jurisdiction without consent. Employees needing access from multiple geographic locations. Cloud-based file and database services can apply constraint-based access controls to validate the user's geographic location before authorizing access.",
      "summary": "Geographic access requirements are crucial for addressing data sovereignty issues, as organizations must select storage locations that comply with privacy regulations. Cloud providers typically offer options for data center selection to prevent unauthorized data transfers across jurisdictions. Additionally, constraint-based access controls can be implemented to verify user locations, ensuring that only authorized personnel can access sensitive information from various geographic areas.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Geographic access requirements fall into two different scenarios:",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_5",
      "content": "Geolocation requirements impact data protection practices by requiring organizations to ensure data remains within a designated boundary, such as utilizing local datacenters or cloud providers. Geolocation restrictions affect data protection practices such as data replication and data dispersion. Geolocation requirements impact incident investigation and forensics activities because they often include jurisdiction-specific data access and sharing restrictions and other legal requirements. Data Retention Policies Data retention policies define how information in your possession is maintained and for how long. The key point to remember is that different types of data must be retained for different lengths of time based on legal and business requirements.",
      "summary": "Geolocation requirements significantly influence data protection practices by necessitating that organizations store data within specific geographic boundaries, which affects data replication and dispersion strategies. These restrictions also complicate incident investigations and forensics due to jurisdiction-specific legal requirements. Additionally, data retention policies dictate the duration for which various types of data must be maintained, aligning with both legal obligations and business needs.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Geographic restrictions impact other business functions:",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_6",
      "content": "Archiving information Destroying information when the retention limit is reached Handling information involved in litigation Review all the different types of information used in your organization and develop a policy that defines how long different types of data are retained and destroyed when the retention period is passed. Record this information in a clearly written policy, and never allow selective or arbitrary information destruction. It might make it appear that you are trying to hide evidence and could expose you to potential criminal charges. Benefits of Data Retention Policies Having a written policy and ensuring everyone in the organization follows it protects you from accusations of destroying evidence. Adhering to your data retention and destruction policy protects you and your organization.",
      "summary": "Data retention policies are essential for defining how long different types of information are archived, handled during litigation, and destroyed once retention limits are reached. A well-documented policy ensures compliance and protects organizations from accusations of evidence tampering, which could lead to legal repercussions. Implementing and adhering to these policies safeguards both the organization and its stakeholders.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Data retention policies also typically describe procedures for:",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_7",
      "content": "Reduced cost of discovery requests in the event of legal action. Responding to discovery requests can be time-consuming and costly. If old material has been destroyed, discovery costs are minimized. Reduced exposure during discovery. Minimizing the amount of electronic material an organization keeps reduces the amount of information that could expose an organization to potential litigation. Reduced hardware and software requirements for storing old data. Data Retention Best Practices",
      "summary": "Implementing a data retention policy offers several benefits, including reduced costs and exposure during legal discovery by minimizing the volume of stored electronic material. This proactive approach not only streamlines the discovery process, making it less time-consuming and expensive, but also decreases the hardware and software requirements needed for data storage. Adopting best practices in data retention ensures organizations manage their information effectively while mitigating legal risks.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Other benefits of implementing a data retention policy include:",
      "timestamp_range": null
    },
    {
      "chunk_id": "13.2.4_chunk_8",
      "content": "Delete email messages after 90 days. Keep tax-related information for seven years. This timeframe should be defined by the applicable taxation authority. For example, the United States Internal Revenue Service requires tax information to be retained for seven years. Keep employee records for four years after an employee leaves the organization. Keep integral research, design, or patent documents for 25 years. Keep contracts with vendors and partners for five years after a contract has ended. Delete employee files after one year. All information should be destroyed before being disposed of. Simply deleting files can leave sensitive information behind. After creating your written data retention policy, use information classification labels to identify which retention policy rule is to be applied to specific data. Using classification labels allows you to use software tools to automate the data retention and destruction process.",
      "summary": "Best practices for data retention emphasize the importance of adhering to specific timeframes for retaining various types of information, such as keeping tax-related documents for seven years and employee records for four years post-employment. Organizations should develop a written data retention policy and utilize information classification labels to streamline the application of retention rules and automate data management processes. Additionally, proper data destruction techniques are crucial to ensure sensitive information is completely removed before disposal.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.4",
        "title": "Data Protection and Policies Facts",
        "content_type": "text",
        "filename": "13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.4_Data_Protection_and_Policies_Facts_[text].txt",
        "word_count": 1883,
        "has_content": true
      },
      "section_header": "Some best practices include:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 8
}