{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.2.6",
    "title": "Configure Network Security Appliance Access",
    "content_type": "video",
    "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
    "word_count": 1519,
    "has_content": true
  },
  "full_content": "In this demonstration, we're going to secure access to our LAN and WAN interfaces and configure IP addresses to them. We're also going to work with user accounts on a network security appliance. We're using a pfSense security appliance, which has a graphical interface for configuration that's accessible through a web browser. I'm here at the login screen, and I'll sign in with the default username of ‘admin'. For this pfSense device, the default password is ‘pfsense'. I'll click Sign In to log on. The first thing I want to do is configure the IP address on my WAN and my LAN. We'll start with the LAN settings. Go up to Interfaces > LAN, and that takes us to the LAN configuration page. If I look here, the IPv4 Configuration Type is set to Static IPv4. DHCP is the other option there. I need to change it to a different IP address. I want to change it to ‘10.10.10.1', so I'll do that now. Now I want to confirm that my subnet is set to the /24 subnet mask. That's all I need to do on this page. I'll scroll down and click Save. The page refreshes and says that the LAN configuration has changed, and I need to click Apply Changes for it to take effect. It reminds me to change my DHCP server configuration if needed. Since my IP address is in the same subnet range as it was before, my DHCP configuration is still okay. Just make sure the IP you assigned is not in the scope of IPs you've configured to be leased. Click Apply Changes. Now, if you look up at my address, you'll see that it says 10.10.10.254. When I log back in, I need to go to the new address that I configured. I've found that you sometimes get a token error if you just try to log back in, so I'm going to close my web browser and open it back up. Now let's type in '10.10.10.1' to get back to our Sign In page. I'll put my credentials back in here and click Sign In. I'll go back to my LAN interface, and you can see that my changes are there. Now let's configure our WAN settings. Once again, I'll go to Interfaces. But this time, I'll select WAN from the list. Right now, I'm getting an IP for my WAN interface via DHCP. I want to configure this with a static IP, so I'll change that to Static IPv4 from our IPv4 configuration type. Now, for an IP address, I'll give it ‘192.168.25.254'. Right away, you might be saying, \"Hey, that's a Class C Private IP address.\" If so, you're absolutely correct. I'm on a test network that's connected to my regular network, which is using the 192.168 scheme. I need to set my subnet mask to /24 here. For this demo, I'm not going to configure DHCP version 6. I'm going to leave everything else set to the defaults and click Save to continue. I get a few reminders, just like we did with the LAN configuration. I'll click Apply Changes. Now I want to configure the DNS that my WAN will use. A lot of devices will have those settings right here, with the WAN settings. But with this device, we need to go up to System > General Setup. I'm going to add a few DNS servers here. But first, let's take a look at the current status of our WAN interface. To do that, I'll go to Status > Interfaces. Here, we see that my DNS server is using the home address of 127.0.0.1. IPv4 network standards reserve the entire address block 127.0.0.0/8 for loopback purposes, so this is normal. I want to change those to a different DNS, so let's go back to System > General Setup. Beneath DNS Server Settings, I'll put in the Google DNS IP of ‘8.8.8.8'. Now I'll click the Add DNS Server button, and this time, I'll put in the other Google DNS IP of ‘8.8.4.4'. I'm going to check this box, Disable DNS Forwarder. For this demo, I don't want my local host, 127.0.0.1, to be used as my first DNS server. Checking the box will remove the local host DNS. I'm only doing this to demonstrate what happens when you check the box. I'll scroll down to save these settings. Now let's look at the status of our interfaces. We can see our DNS settings are now set to the Google DNS servers. That wraps up configuring IP interfaces. Now let's add an additional user to our pfSense appliance. To add a user, we need to go up to System > User Manager. You can see here that we have just one user, the admin user. It's good practice not to use the admin account for normal maintenance. You usually want to create a separate account for each person that might mange the device, collect logs, and so on. We can also track the logon and logoff events of the users in case something happens. I'll add the user by going over and clicking the Add User button. I'll enter in a username of ‘Rachel McGaffey'. I'll give Rachel a password, and I'll put the password in a second time to confirm it. Now, under Full Name, I'll enter in ‘Rachel McGaffey'. That's really all that's required. But if I wanted to, I could check this box to customize the GUI for Rachel's account. Let's take a look at some of those options. After I check the box, I get some more options. I can change the theme for her account from this dropdown list. We can change the top navigation of the page here. We can change how the hostname appears in the menu and change the amount of dashboard columns. If we want things like WAN and LAN to be sorted alphabetically, we can change that too. If we have groups set up, we can change the memberships here. But we won't make any changes to these right now. Let's come down and click Save. One thing we don't want to happen with our security appliance is have someone logged in to it make configuration changes. If a user gets called away from his or her desk and doesn't sign out, anyone can sit down at their computer and start messing around. To mitigate this risk, we want to configure Session Timeout. I'll click on the Settings tab. Under Session Timeout, I'm going to change this to 10 minutes. That is actually a long time, and you might want to set this to a lower amount of time. Having no timeout is a huge security risk. You'll have to judge your circumstances and decide what session timeout settings are best. The last thing I want to do in this demo is change the default admin password. Default passwords for devices are easy to find with a simple web search. It's such a problem, some US states and other governments have forced many tech manufacturers to make the devices they produce have random passwords. Even if your device comes with a random password already configured, those passwords are often printed on the device somewhere, so it's always recommended that you change it—that should be the very first thing you do. To change this password for the admin account, I'll click on the edit icon here. I'll type in my new password. Now I'll type it a second time to confirm it. Come down and click Save, and that's all there is to it. That's it for this demonstration. In this demo, we configured a network security appliance. We configured the LAN and WAN IP addresses. We changed the WAN DNS. We created a second account on the device. We configured a session timeout. We ended the demo by changing the default admin password to something more secure.",
  "chunks": [
    {
      "chunk_id": "5.2.6_chunk_1",
      "content": "In this demonstration, we're going to secure access to our LAN and WAN interfaces and configure IP addresses to them. We're also going to work with user accounts on a network security appliance. We're using a pfSense security appliance, which has a graphical interface for configuration that's accessible through a web browser.",
      "summary": "This section focuses on securing access to LAN and WAN interfaces by configuring IP addresses and managing user accounts on a pfSense security appliance. The demonstration highlights the use of a graphical interface for streamlined configuration via a web browser, emphasizing practical applications in network security management. Key concepts include interface security and user account management within a network security context.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Configuring Network Security Appliance Access",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_2",
      "content": "I'm here at the login screen, and I'll sign in with the default username of ‘admin'. For this pfSense device, the default password is ‘pfsense'. I'll click Sign In to log on.",
      "summary": "In this section, the focus is on accessing a pfSense device by using the default credentials, specifically the username 'admin' and the password 'pfsense'. This practical application highlights the importance of understanding default login information for network devices, which is crucial for securing systems against unauthorized access. It serves as a reminder to change default credentials to enhance security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Sign In",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_3",
      "content": "The first thing I want to do is configure the IP address on my WAN and my LAN. We'll start with the LAN settings. Go up to Interfaces > LAN, and that takes us to the LAN configuration page. If I look here, the IPv4 Configuration Type is set to Static IPv4. DHCP is the other option there. I need to change it to a different IP address. I want to change it to ‘10.10.10.1', so I'll do that now. Now I want to confirm that my subnet is set to the /24 subnet mask. That's all I need to do on this page. I'll scroll down and click Save. The page refreshes and says that the LAN configuration has changed, and I need to click Apply Changes for it to take effect. It reminds me to change my DHCP server configuration if needed. Since my IP address is in the same subnet range as it was before, my DHCP configuration is still okay. Just make sure the IP you assigned is not in the scope of IPs you've configured to be leased. Click Apply Changes. Now, if you look up at my address, you'll see that it says 10.10.10.254. When I log back in, I need to go to the new address that I configured. I've found that you sometimes get a token error if you just try to log back in, so I'm going to close my web browser and open it back up. Now let's type in '10.10.10.1' to get back to our Sign In page. I'll put my credentials back in here and click Sign In. I'll go back to my LAN interface, and you can see that my changes are there.",
      "summary": "In this section of the CompTIA Security+ course, learners are guided through the process of configuring a LAN interface by setting a static IPv4 address and ensuring proper subnet mask settings. Key steps include changing the IP address to '10.10.10.1', verifying DHCP configurations, and applying changes to ensure the new settings take effect. Practical applications involve troubleshooting login issues related to IP address changes and confirming successful configuration through the interface.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Configure LAN Interface",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_4",
      "content": "Now let's configure our WAN settings. Once again, I'll go to Interfaces. But this time, I'll select WAN from the list. Right now, I'm getting an IP for my WAN interface via DHCP. I want to configure this with a static IP, so I'll change that to Static IPv4 from our IPv4 configuration type. Now, for an IP address, I'll give it ‘192.168.25.254'. Right away, you might be saying, \"Hey, that's a Class C Private IP address.\" If so, you're absolutely correct. I'm on a test network that's connected to my regular network, which is using the 192.168 scheme. I need to set my subnet mask to /24 here. For this demo, I'm not going to configure DHCP version 6. I'm going to leave everything else set to the defaults and click Save to continue. I get a few reminders, just like we did with the LAN configuration. I'll click Apply Changes.",
      "summary": "In this section, learners configure a WAN interface by switching from DHCP to a static IP address, specifically setting it to '192.168.25.254' with a subnet mask of /24. This practical application emphasizes the importance of understanding IP addressing, particularly within a private Class C network. The process includes saving changes and applying configurations, reinforcing foundational skills in network management.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Configure WAN Interface",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_5",
      "content": "Now I want to configure the DNS that my WAN will use. A lot of devices will have those settings right here, with the WAN settings. But with this device, we need to go up to System > General Setup. I'm going to add a few DNS servers here. But first, let's take a look at the current status of our WAN interface. To do that, I'll go to Status > Interfaces. Here, we see that my DNS server is using the home address of 127.0.0.1. IPv4 network standards reserve the entire address block 127.0.0.0/8 for loopback purposes, so this is normal. I want to change those to a different DNS, so let's go back to System > General Setup. Beneath DNS Server Settings, I'll put in the Google DNS IP of ‘8.8.8.8'. Now I'll click the Add DNS Server button, and this time, I'll put in the other Google DNS IP of ‘8.8.4.4'. I'm going to check this box, Disable DNS Forwarder. For this demo, I don't want my local host, 127.0.0.1, to be used as my first DNS server. Checking the box will remove the local host DNS. I'm only doing this to demonstrate what happens when you check the box. I'll scroll down to save these settings. Now let's look at the status of our interfaces. We can see our DNS settings are now set to the Google DNS servers. That wraps up configuring IP interfaces.",
      "summary": "In this section, learners are guided through the process of configuring DNS settings for a WAN interface, emphasizing the importance of selecting reliable DNS servers. The demonstration includes changing the default loopback address (127.0.0.1) to Google's public DNS servers (8.8.8.8 and 8.8.4.4) and disabling the local DNS forwarder. This practical application highlights how to effectively manage DNS configurations to enhance network performance and reliability.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Configure WAN DNS",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_6",
      "content": "Now let's add an additional user to our pfSense appliance. To add a user, we need to go up to System > User Manager. You can see here that we have just one user, the admin user. It's good practice not to use the admin account for normal maintenance. You usually want to create a separate account for each person that might mange the device, collect logs, and so on. We can also track the logon and logoff events of the users in case something happens. I'll add the user by going over and clicking the Add User button. I'll enter in a username of ‘Rachel McGaffey'. I'll give Rachel a password, and I'll put the password in a second time to confirm it. Now, under Full Name, I'll enter in ‘Rachel McGaffey'. That's really all that's required. But if I wanted to, I could check this box to customize the GUI for Rachel's account. Let's take a look at some of those options. After I check the box, I get some more options. I can change the theme for her account from this dropdown list. We can change the top navigation of the page here. We can change how the hostname appears in the menu and change the amount of dashboard columns. If we want things like WAN and LAN to be sorted alphabetically, we can change that too. If we have groups set up, we can change the memberships here. But we won't make any changes to these right now. Let's come down and click Save.",
      "summary": "In this section of the CompTIA Security+ course, users learn how to add a new user to the pfSense appliance through the System > User Manager interface, emphasizing the importance of not using the admin account for regular tasks. The process involves creating a unique username and password, with optional customization of the user interface for individual accounts. Additionally, the course highlights the significance of tracking user logon and logoff events for security monitoring.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Add User",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_7",
      "content": "One thing we don't want to happen with our security appliance is have someone logged in to it make configuration changes. If a user gets called away from his or her desk and doesn't sign out, anyone can sit down at their computer and start messing around. To mitigate this risk, we want to configure Session Timeout. I'll click on the Settings tab. Under Session Timeout, I'm going to change this to 10 minutes. That is actually a long time, and you might want to set this to a lower amount of time. Having no timeout is a huge security risk. You'll have to judge your circumstances and decide what session timeout settings are best.",
      "summary": "Session Timeout is a critical security measure that prevents unauthorized access to a security appliance when a user is away from their desk. By configuring a timeout period—such as 10 minutes or less—organizations can mitigate the risk of unauthorized configuration changes. It is essential to assess specific circumstances to determine the most effective session timeout settings for optimal security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Session Timeout",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_8",
      "content": "The last thing I want to do in this demo is change the default admin password. Default passwords for devices are easy to find with a simple web search. It's such a problem, some US states and other governments have forced many tech manufacturers to make the devices they produce have random passwords. Even if your device comes with a random password already configured, those passwords are often printed on the device somewhere, so it's always recommended that you change it—that should be the very first thing you do. To change this password for the admin account, I'll click on the edit icon here. I'll type in my new password. Now I'll type it a second time to confirm it. Come down and click Save, and that's all there is to it.",
      "summary": "Changing default admin passwords is a critical security measure, as these passwords are often easily accessible online or printed on devices, making them vulnerable to unauthorized access. Many jurisdictions have mandated that manufacturers implement random passwords to enhance security. The process of changing the password is straightforward: access the admin settings, enter a new password, confirm it, and save the changes.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Change Default Admin Password",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.2.6_chunk_9",
      "content": "That's it for this demonstration. In this demo, we configured a network security appliance. We configured the LAN and WAN IP addresses. We changed the WAN DNS. We created a second account on the device. We configured a session timeout. We ended the demo by changing the default admin password to something more secure.",
      "summary": "In this demonstration, key network security concepts were applied by configuring a network security appliance, including setting LAN and WAN IP addresses and updating the WAN DNS. Practical applications included creating a secondary user account, establishing a session timeout for enhanced security, and changing the default admin password to strengthen device protection. These steps illustrate essential practices for securing network infrastructure.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.2.6",
        "title": "Configure Network Security Appliance Access",
        "content_type": "video",
        "filename": "5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.2.6_Configure_Network_Security_Appliance_Access_[video].txt",
        "word_count": 1519,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 9
}