{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.3.1",
    "title": "Screened Subnets",
    "content_type": "video",
    "filename": "5.3.1_Screened_Subnets_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
    "word_count": 1271,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this lesson, we'll discuss screened subnets. A screened subnet allows you to expose an organization's services to the internet or other untrusted network while protecting the internal network. Implementing a screened subnet is part of a layered security approach. Let's look at how a screened subnet works. Let's say you manage networks for a small company that provides driver downloads for their products. These drivers are accessed via a customer portal on your website, which is hosted on an in-house web server. The server resides in the company's internal network. For customers to access this web server and download drivers, this server needs to be exposed to the internet. One way to do this is to place the web server outside the protected network. In other words, on the other side of the perimeter firewall, right here. This would allow users to access the drivers that reside on this web server. However, this implementation would create a significant security issue. This is because once you place the server outside the firewall, you have no control over what happens to it. Every hacker on the internet would be able to access this web server very easily and run all types of exploits on it. As you can see, this isn't a very good idea. However, moving the web server inside the firewall presents another issue. Chances are this firewall allows outbound traffic but blocks all inbound traffic. This makes the web server invisible to the internet, and customers can't access the drivers. To solve this, you could add a rule in the firewall's ACL to allow connections using port 80, HTTP, and port 443, HTTP. With these ports open, users can initiate connections from the internet to the web server. But, again, this has some risks. You've now opened two significant holes in the firewall here, which has the potential for security breaches. Many exploits take advantage of this scenario. An attacker gains access to the web server box through the firewall using these two open ports. The attacker then perpetrates a variety of exploits on the web server, and since this web server is on the same network as the rest of the network, the attacker could compromise the entire network. So, what can be done? One solution is to divide the network into multiple zones of different levels of security. You can create a high-security area and another area within the network that has a lower degree of security. You do this by creating a screened subnet. Let's look at how to do this. First, you'll need to open ports 80 and 443 on the firewall to let internet users initiate connections to and access the web server. We still have our firewall in place. Opening these ports creates an area of low security on the network. The web server with open 80 and 443 ports is in the low-security area directly behind the firewall. To maintain the security of the rest of your network, you need to install a second firewall between this area of low security and your internal network. By doing this, you create a zone of high security for your internal network. Because this web server resides in the low-security area with two ports open in the firewall, the web server resides in the screened subnet. The general rule is that you don't put anything in the screened subnet that doesn't absolutely need to be there. For example, the screened subnet isn't the place to put your payroll or your R&amp;D servers. Only the servers and information accessed by users on the internet should be in the screened subnet. There's still a risk in having this information on the web server. Someone could break in and, for example, replace one of the driver downloads with a modified version with a virus. Be aware of that risk and monitor the screened subnet for it. The second high-security internal firewall behind the firewall keeps the low-security area of the network to this single segment. The internal network is secure behind the second firewall. When planning your firewall rules, a general rule is that you allow traffic originating in the secured internal network into the screened subnet and through to the internet. For example, a user on your internal network should be able to open a web browser and access the internet through the various firewalls. However, you must not allow traffic that originates in the low-security area or the no-security area, which is the internet, to establish a connection with a host in the high-security area. You can also create a screened subnet using a single firewall instead of two. In this scenario, one firewall now has two network connections and two network interfaces installed. One interface connects to the internal high-security network. The second connects to a separate isolated network segment. You configure this firewall with different sets of rules for the different network segments. You establish high-security firewall rules for the internal network, creating the area of high security. You implement lower-security rules, such as allowing traffic through ports 80 and 443 for this network segment where the web server resides. This creates a screened subnet security zone. The lower-security rules for this network segment allow internet connections to the web server on ports 80 and 443. You should harden this server as much as possible because it's sitting in a lower-security area inside the screened subnet. Each of these options has its strengths and weaknesses. The two-firewall system requires more hardware and, therefore, requires you to administer two separate firewall systems. The benefit is that an attack on the firewall has no effect on the internal firewall. Everything on the high-security network in the high-security zone could be functioning just fine while the firewall is experiencing continual attacks. The single-firewall solution with multiple interfaces requires less hardware than the first solution. Therefore, you maintain only a single system. The single-firewall solution allows you to create multiple screened subnets. You can create multiple security zones with the one firewall device by adding additional interfaces. You could have a very high-security zone, a medium-security zone, and a low-security zone. The drawback to this approach is that it introduces a single point of failure. If that firewall goes down, everything else goes down with it. In this lesson, we discussed screened subnets. We first defined what a screened subnet is. We then looked at different ways to create a screened subnet with multiple firewalls or a single firewall with multiple interfaces installed.",
  "chunks": [
    {
      "chunk_id": "5.3.1_chunk_1",
      "content": "In this lesson, we'll discuss screened subnets. A screened subnet allows you to expose an organization's services to the internet or other untrusted network while protecting the internal network. Implementing a screened subnet is part of a layered security approach.",
      "summary": "Screened subnets are a security architecture that enables organizations to safely expose services to the internet while safeguarding the internal network from potential threats. This approach is integral to a layered security strategy, providing an additional barrier against unauthorized access. By effectively managing traffic between trusted and untrusted networks, screened subnets enhance overall cybersecurity posture.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Screened Subnets",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_2",
      "content": "Let's look at how a screened subnet works. Let's say you manage networks for a small company that provides driver downloads for their products. These drivers are accessed via a customer portal on your website, which is hosted on an in-house web server. The server resides in the company's internal network. For customers to access this web server and download drivers, this server needs to be exposed to the internet. One way to do this is to place the web server outside the protected network. In other words, on the other side of the perimeter firewall, right here. This would allow users to access the drivers that reside on this web server. However, this implementation would create a significant security issue. This is because once you place the server outside the firewall, you have no control over what happens to it. Every hacker on the internet would be able to access this web server very easily and run all types of exploits on it. As you can see, this isn't a very good idea. However, moving the web server inside the firewall presents another issue. Chances are this firewall allows outbound traffic but blocks all inbound traffic. This makes the web server invisible to the internet, and customers can't access the drivers. To solve this, you could add a rule in the firewall's ACL to allow connections using port 80, HTTP, and port 443, HTTP. With these ports open, users can initiate connections from the internet to the web server. But, again, this has some risks. You've now opened two significant holes in the firewall here, which has the potential for security breaches. Many exploits take advantage of this scenario. An attacker gains access to the web server box through the firewall using these two open ports. The attacker then perpetrates a variety of exploits on the web server, and since this web server is on the same network as the rest of the network, the attacker could compromise the entire network. So, what can be done? One solution is to divide the network into multiple zones of different levels of security. You can create a high-security area and another area within the network that has a lower degree of security. You do this by creating a screened subnet. Let's look at how to do this.",
      "summary": "The \"Network Boundaries\" section of the CompTIA Security+ course discusses the importance of securing web servers that need to be accessible from the internet while protecting the internal network. It highlights the risks of placing a web server outside the firewall and the challenges of allowing inbound traffic through the firewall without compromising security. A recommended solution is to implement a screened subnet, which divides the network into zones with varying security levels, thereby mitigating potential threats from external attacks.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Network Boundaries",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_3",
      "content": "First, you'll need to open ports 80 and 443 on the firewall to let internet users initiate connections to and access the web server. We still have our firewall in place. Opening these ports creates an area of low security on the network. The web server with open 80 and 443 ports is in the low-security area directly behind the firewall. To maintain the security of the rest of your network, you need to install a second firewall between this area of low security and your internal network. By doing this, you create a zone of high security for your internal network. Because this web server resides in the low-security area with two ports open in the firewall, the web server resides in the screened subnet. The general rule is that you don't put anything in the screened subnet that doesn't absolutely need to be there. For example, the screened subnet isn't the place to put your payroll or your R&amp;D servers. Only the servers and information accessed by users on the internet should be in the screened subnet. There's still a risk in having this information on the web server. Someone could break in and, for example, replace one of the driver downloads with a modified version with a virus. Be aware of that risk and monitor the screened subnet for it.",
      "summary": "The Screened Subnet Creation section emphasizes the importance of network security by introducing a layered approach that involves opening specific ports (80 and 443) on a firewall to allow web server access while maintaining a secure internal network. By placing the web server in a low-security area behind the firewall and implementing a second firewall, a screened subnet is established, which should only contain essential servers accessed by internet users. This setup highlights the need for vigilance against potential risks, such as malware infiltration, and underscores the principle of minimizing sensitive data exposure in the screened subnet.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Screened Subnet Creation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_4",
      "content": "The second high-security internal firewall behind the firewall keeps the low-security area of the network to this single segment. The internal network is secure behind the second firewall. When planning your firewall rules, a general rule is that you allow traffic originating in the secured internal network into the screened subnet and through to the internet. For example, a user on your internal network should be able to open a web browser and access the internet through the various firewalls. However, you must not allow traffic that originates in the low-security area or the no-security area, which is the internet, to establish a connection with a host in the high-security area.",
      "summary": "The Two Firewall Solution emphasizes the importance of implementing a dual-firewall architecture to enhance network security by segmenting high-security and low-security areas. It allows traffic from the secured internal network to access the internet while strictly preventing any inbound connections from less secure zones, such as the internet, to the high-security area. This approach helps maintain a robust defense against potential threats while enabling necessary user access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Two Firewall Solution",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_5",
      "content": "You can also create a screened subnet using a single firewall instead of two. In this scenario, one firewall now has two network connections and two network interfaces installed. One interface connects to the internal high-security network. The second connects to a separate isolated network segment. You configure this firewall with different sets of rules for the different network segments. You establish high-security firewall rules for the internal network, creating the area of high security. You implement lower-security rules, such as allowing traffic through ports 80 and 443 for this network segment where the web server resides. This creates a screened subnet security zone. The lower-security rules for this network segment allow internet connections to the web server on ports 80 and 443. You should harden this server as much as possible because it's sitting in a lower-security area inside the screened subnet.",
      "summary": "A single firewall can effectively create a screened subnet by utilizing two network interfaces: one for a high-security internal network and another for a lower-security segment housing a web server. This configuration allows for distinct firewall rules tailored to each segment, with stringent security measures for the internal network and more permissive rules for the web server, which permits internet traffic on ports 80 and 443. To enhance security, it is crucial to harden the web server within the lower-security area of the screened subnet.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Single Firewall Solution",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_6",
      "content": "Each of these options has its strengths and weaknesses. The two-firewall system requires more hardware and, therefore, requires you to administer two separate firewall systems. The benefit is that an attack on the firewall has no effect on the internal firewall. Everything on the high-security network in the high-security zone could be functioning just fine while the firewall is experiencing continual attacks. The single-firewall solution with multiple interfaces requires less hardware than the first solution. Therefore, you maintain only a single system. The single-firewall solution allows you to create multiple screened subnets. You can create multiple security zones with the one firewall device by adding additional interfaces. You could have a very high-security zone, a medium-security zone, and a low-security zone. The drawback to this approach is that it introduces a single point of failure. If that firewall goes down, everything else goes down with it.",
      "summary": "The \"Two vs. One\" section discusses the trade-offs between using a dual-firewall system and a single-firewall solution with multiple interfaces. A two-firewall setup enhances security by isolating attacks, as the internal firewall remains unaffected, but requires more hardware and administration. Conversely, a single-firewall system is more efficient and allows for multiple security zones, but it poses a risk of a single point of failure, where a malfunction could compromise the entire network.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Two vs. One",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.1_chunk_7",
      "content": "In this lesson, we discussed screened subnets. We first defined what a screened subnet is. We then looked at different ways to create a screened subnet with multiple firewalls or a single firewall with multiple interfaces installed.",
      "summary": "This lesson covers the concept of screened subnets, which enhance network security by using firewalls to segment and control traffic. It explores various configurations, including the use of multiple firewalls or a single firewall with multiple interfaces, to effectively create a secure network environment. Understanding these configurations is crucial for implementing robust security measures in organizational networks.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.1",
        "title": "Screened Subnets",
        "content_type": "video",
        "filename": "5.3.1_Screened_Subnets_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.1_Screened_Subnets_[video].txt",
        "word_count": 1271,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 7
}