{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.3.2",
    "title": "Configuring a Screened Subnet",
    "content_type": "video",
    "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
    "word_count": 571,
    "has_content": true
  },
  "full_content": "In this demonstration, we're going to create a screened subnet on our pfSense security appliance. Be aware that screened subnets are also referred to as demilitarized zones, or DMZs. Often, you will see them referred to as DMZs in software settings with various vendors. So, if we encounter something listed as DMZ, we are referring to a screened subnet. For our current configuration, our device has two connections: LAN and WAN. As mentioned earlier, we are here to configure a screened subnet. I have a few extra optional ports on my pfSense device, and I'm going to configure one of these for the screened subnet. I'll also assign it the IP address 172.16.1.1. Let's get started. The first thing I'll do from our pfSense Dashboard is confirm our current situation. You can see here that I have WAN and LAN interfaces. To add my screened subnet, I'll go to Interfaces &gt; Assignments. On the Interface Assignments page, I'll click the Add button. Here, I can see that OPT1 is displayed. I'll go ahead and click on it. OPT1 isn't a very descriptive name, so let's call it 'DMZ.' Before I forget, I'll check the box here to enable the interface. For IPv4 Configuration Type, I'll choose Static IPv4 from the list. We won't configure IPv6 for this demo. Now, let's scroll down to our Static IPv4 Configuration. As per my diagram, I said I was going to assign it the IP address '172.16.1.1,' so that's what I'll type in. I want to give it a /24 subnet mask. That's all we need to do here. Click Save. Now we can see the changes in our interface. It also says, \"Don't forget to adjust the DHCP Server range if needed after applying.\" Let's go ahead and click on Apply Changes. Let's configure our DHCP Server for our screened subnet. I'll go to Services &gt; DHCP Server. We land on the page for the LAN DHCP Server. Let's go to the DHCP Server for the screened subnet. I'll go ahead and enable DHCP for our screened subnet interface. Now we need to configure the range of IP addresses that our DHCP will hand out. I always leave IPs at the beginning of the range open for static addresses. I can pick something ending in .2 all the way up to .254. I'll set it to '172.16.1.100' and end at '172.16.1.199'. This way, I'll know that anything in the 100s was assigned via DHCP. I'll scroll down and click Save. Now let's go back to our dashboard and verify that our screened subnet interface is showing up. I'll scroll down, and right here, you can see that we have our screened subnet. This is where we can add devices to our screened subnet and configure our firewall for handling traffic going to and from the screened subnet. That's it for this demo. In this demo, we configured a screened subnet.",
  "chunks": [
    {
      "chunk_id": "5.3.2_chunk_1",
      "content": "In this demonstration, we're going to create a screened subnet on our pfSense security appliance. Be aware that screened subnets are also referred to as demilitarized zones, or DMZs. Often, you will see them referred to as DMZs in software settings with various vendors. So, if we encounter something listed as DMZ, we are referring to a screened subnet. For our current configuration, our device has two connections: LAN and WAN. As mentioned earlier, we are here to configure a screened subnet. I have a few extra optional ports on my pfSense device, and I'm going to configure one of these for the screened subnet. I'll also assign it the IP address 172.16.1.1. Let's get started. The first thing I'll do from our pfSense Dashboard is confirm our current situation. You can see here that I have WAN and LAN interfaces. To add my screened subnet, I'll go to Interfaces &gt; Assignments. On the Interface Assignments page, I'll click the Add button.",
      "summary": "In this section, the course demonstrates how to configure a screened subnet, also known as a demilitarized zone (DMZ), using a pfSense security appliance. The process involves assigning an additional interface for the screened subnet, which enhances network security by isolating external-facing services from the internal network. Practical applications include managing traffic between the LAN and WAN while protecting sensitive data from potential threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.2",
        "title": "Configuring a Screened Subnet",
        "content_type": "video",
        "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "word_count": 571,
        "has_content": true
      },
      "section_header": "Configuring a Screened Subnet",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.2_chunk_2",
      "content": "Here, I can see that OPT1 is displayed. I'll go ahead and click on it. OPT1 isn't a very descriptive name, so let's call it 'DMZ.' Before I forget, I'll check the box here to enable the interface. For IPv4 Configuration Type, I'll choose Static IPv4 from the list. We won't configure IPv6 for this demo. Now, let's scroll down to our Static IPv4 Configuration. As per my diagram, I said I was going to assign it the IP address '172.16.1.1,' so that's what I'll type in. I want to give it a /24 subnet mask. That's all we need to do here. Click Save.",
      "summary": "In this section, the course demonstrates how to configure a screened subnet interface, specifically renaming it to 'DMZ' and enabling it. The configuration involves setting a static IPv4 address (172.16.1.1) with a /24 subnet mask, while IPv6 is not utilized in this instance. This practical application emphasizes the importance of proper network segmentation and IP address management in enhancing security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.2",
        "title": "Configuring a Screened Subnet",
        "content_type": "video",
        "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "word_count": 571,
        "has_content": true
      },
      "section_header": "Configure the Screened Subnet Interface",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.2_chunk_3",
      "content": "Now we can see the changes in our interface. It also says, \"Don't forget to adjust the DHCP Server range if needed after applying.\" Let's go ahead and click on Apply Changes. Let's configure our DHCP Server for our screened subnet. I'll go to Services &gt; DHCP Server. We land on the page for the LAN DHCP Server. Let's go to the DHCP Server for the screened subnet. I'll go ahead and enable DHCP for our screened subnet interface. Now we need to configure the range of IP addresses that our DHCP will hand out. I always leave IPs at the beginning of the range open for static addresses. I can pick something ending in .2 all the way up to .254. I'll set it to '172.16.1.100' and end at '172.16.1.199'. This way, I'll know that anything in the 100s was assigned via DHCP. I'll scroll down and click Save.",
      "summary": "In the Configuring DHCP section of the CompTIA Security+ course, learners are guided through the process of setting up a DHCP server for a screened subnet, including enabling DHCP and defining a specific range of IP addresses for dynamic assignment. The instructor emphasizes the importance of reserving the beginning of the IP range for static addresses, ensuring organized network management. This practical application reinforces key security concepts by demonstrating how proper DHCP configuration can enhance network efficiency and control.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.2",
        "title": "Configuring a Screened Subnet",
        "content_type": "video",
        "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "word_count": 571,
        "has_content": true
      },
      "section_header": "Configuring DHCP",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.2_chunk_4",
      "content": "Now let's go back to our dashboard and verify that our screened subnet interface is showing up. I'll scroll down, and right here, you can see that we have our screened subnet. This is where we can add devices to our screened subnet and configure our firewall for handling traffic going to and from the screened subnet.",
      "summary": "In this section, learners are guided through the process of verifying the configuration of a screened subnet interface on a network dashboard. The focus is on adding devices to the screened subnet and configuring firewall settings to manage traffic effectively. This practical application reinforces the importance of monitoring and securing network segments to enhance overall cybersecurity.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.2",
        "title": "Configuring a Screened Subnet",
        "content_type": "video",
        "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "word_count": 571,
        "has_content": true
      },
      "section_header": "Verify Settings",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.3.2_chunk_5",
      "content": "That's it for this demo. In this demo, we configured a screened subnet.",
      "summary": "In this demo, a screened subnet was configured, illustrating a key security concept in network architecture that enhances protection against external threats. The practical application of this setup involves segregating internal networks from untrusted external networks, thereby improving security posture and controlling traffic flow. This configuration is essential for organizations aiming to safeguard sensitive data while allowing necessary access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.2",
        "title": "Configuring a Screened Subnet",
        "content_type": "video",
        "filename": "5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.2_Configuring_a_Screened_Subnet_[video].txt",
        "word_count": 571,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 5
}