{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.4.3",
    "title": "Configuring Firewall Rules",
    "content_type": "video",
    "filename": "5.4.3_Configuring_Firewall_Rules_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.4.3_Configuring_Firewall_Rules_[video].txt",
    "word_count": 1289,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demonstration, we're going to configure firewall rules on a pfSense security appliance. First, we're going to configure a firewall rule to allow both HTTP and HTTPS traffic from the internet, or WAN, through the firewall and to our web server on our screened subnet. The second thing we're going to do is configure a rule to allow all traffic coming from our LAN to get to our screened subnet through the firewall. Be aware that when we are talking about a screened subnet, some vendors may refer to this as a demilitarized zone, or DMZ. I want to verify that I have my screened subnet ready to go. I'll scroll down, and you can see I have my three interfaces here, and they have assigned IPs. Let's create our rules. I'll go to Firewall &gt; Rules, and the first rules I'll configure are the ones from our WAN to our screened subnet to allow HTTP and HTTPS to our web server. I want to go to the DMZ tab here, and down here, I have a few buttons. You'll notice there are two buttons that say Add. This one has the arrow pointing up, and if I pick that one, it'll add the rule to the top of my list. If I click on the one with the arrow pointing down, it'll add the rule to the bottom, so I'll click on that one. For our rule, we want to choose to pass the traffic through the firewall. My other choices are to block it or reject it. If we choose Block, it will just drop the packets as if they never arrived If we choose Reject, the packets are returned to the sender, and the sender can see they were blocked. For security reasons, sometimes you don't want senders to know that your device is even there, and it's better to just block the packets. But if you're troubleshooting issues, reject can be more helpful. Either way, with block or reject, the packets won't reach the destination. The interface that I want to configure is the DMZ. You can see that I have my LAN and WAN here as well. For Address Family, I'll leave it as IPv4. The other choices are IPv6 or both. For Protocol, we're allowing HTTP, which runs on TCP. If I click the dropdown list, you can see all the other protocols that we could choose if we were going to allow some other type of traffic. Our source is going to be from our WAN network. I need to see more options, so I'll click on the Display Advanced button. The Source Port Range is going to be HTTP. I could put in a single port or a range, but we just want HTTP port 80. Since this is going to be my web server, I need to put in the IP address here. First, I'll pick Single host or alias, and now let's pop our diagram back up. Our web server's IP is right here, so let's go back and enter that in. Destination Address will be '172.16.1.5'. We're using HTTP, and the rest of this looks good. Down here, we could log packets handled by this rule. Since this is a web server, we probably don't want to do that since our log would be overwhelmed. If it was FTP, SSH, or other traffic like that, we probably would want to log traffic, but not for normal web requests. We do want to put a description in here because as you create more and more rules, you'll forget what they all do. For this, I'll type in 'HTTP to DMZ from WAN' and click Save. On our next page here, we have to click on Apply Changes for the changes to my firewall to take effect. So, here are my rules so far. I have one that allows my screened subnet out, and this second one is our HTTP rule from the WAN on port 80 the web server on our screened subnet. Now, you might be saying to yourself, \"Doesn't most web traffic use HTTPS these days?\" Well, that answer is certainly yes, so now we need an HTTPS rule. Here's some good news: to save a bit of time and keep from making any errors, we can just copy this rule and change the HTTP port 80 to HTTPS port 443. I'll click here, which is the Copy icon. What this does creates a new rule with the exact settings. I'll scroll down and change my source from HTTP port 80 to HTTPS port 443. For the destination, I'll do the same. Scroll down change the description by just adding the letter 'S'. Click Save. On this page, Click Apply Changes. Down here, you now see our rules for both HTTP and HTTPS. Now let's look at our diagram again. This time, I want to create a rule that allows any traffic from my LAN to get to the screened subnet. Let's go back to our firewall and configure that now. These rules are read from the top down. So, for example, if the first rule says block everything, none of the other rules would ever be seen because that's the very first rule. However, if we made a rule right now that said to block everything and put it at the bottom, our first three rules would still be fine, but everything else would be blocked. By default, everything is blocked with pfSense anyway unless you open it, so we wouldn't really need that sort of rule, but it doesn't hurt anything. So far, our rules don't affect one another, so it really doesn't matter where we put them, but keep all of this in mind when creating rules. We'll just click on Add and use the one that puts it at the bottom of the list. Our Action will be to pass traffic. We'll leave the interface and address family alone. But for protocol, we're going to change this from TCP to Any. This might not be the best practice, but we're allowing any and all traffic from our LAN to reach our screened subnet. Under Source, we'll choose our LAN network from the list. Our destination will be the screened subnet from this list. We don't want to forget a description for this rule. I'll type 'LAN to DMZ Any'. Click Save. As always, Apply Changes. Here's my latest rule. My source is from the LAN on any port to my DMZ on any port. By the way, the asterisk is wildcard, which means any. Over here, the green check mark means it's enabled. That's it for this demo. In this demo, we created firewall rules on our firewall.",
  "chunks": [
    {
      "chunk_id": "5.4.3_chunk_1",
      "content": "In this demonstration, we're going to configure firewall rules on a pfSense security appliance. First, we're going to configure a firewall rule to allow both HTTP and HTTPS traffic from the internet, or WAN, through the firewall and to our web server on our screened subnet. The second thing we're going to do is configure a rule to allow all traffic coming from our LAN to get to our screened subnet through the firewall. Be aware that when we are talking about a screened subnet, some vendors may refer to this as a demilitarized zone, or DMZ.",
      "summary": "In this section, learners will configure firewall rules on a pfSense security appliance to manage traffic effectively. The demonstration includes setting up rules to permit HTTP and HTTPS traffic from the internet to a web server in a screened subnet, as well as allowing all LAN traffic to access the screened subnet. This practical application emphasizes the importance of firewall configurations in securing network segments, often referred to as a demilitarized zone (DMZ).",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.4.3",
        "title": "Configuring Firewall Rules",
        "content_type": "video",
        "filename": "5.4.3_Configuring_Firewall_Rules_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.4.3_Configuring_Firewall_Rules_[video].txt",
        "word_count": 1289,
        "has_content": true
      },
      "section_header": "Configuring Firewall Rules",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.4.3_chunk_2",
      "content": "I want to verify that I have my screened subnet ready to go. I'll scroll down, and you can see I have my three interfaces here, and they have assigned IPs. Let's create our rules. I'll go to Firewall &gt; Rules, and the first rules I'll configure are the ones from our WAN to our screened subnet to allow HTTP and HTTPS to our web server. I want to go to the DMZ tab here, and down here, I have a few buttons. You'll notice there are two buttons that say Add. This one has the arrow pointing up, and if I pick that one, it'll add the rule to the top of my list. If I click on the one with the arrow pointing down, it'll add the rule to the bottom, so I'll click on that one. For our rule, we want to choose to pass the traffic through the firewall. My other choices are to block it or reject it. If we choose Block, it will just drop the packets as if they never arrived If we choose Reject, the packets are returned to the sender, and the sender can see they were blocked. For security reasons, sometimes you don't want senders to know that your device is even there, and it's better to just block the packets. But if you're troubleshooting issues, reject can be more helpful. Either way, with block or reject, the packets won't reach the destination. The interface that I want to configure is the DMZ. You can see that I have my LAN and WAN here as well. For Address Family, I'll leave it as IPv4. The other choices are IPv6 or both. For Protocol, we're allowing HTTP, which runs on TCP. If I click the dropdown list, you can see all the other protocols that we could choose if we were going to allow some other type of traffic. Our source is going to be from our WAN network. I need to see more options, so I'll click on the Display Advanced button. The Source Port Range is going to be HTTP. I could put in a single port or a range, but we just want HTTP port 80. Since this is going to be my web server, I need to put in the IP address here. First, I'll pick Single host or alias, and now let's pop our diagram back up. Our web server's IP is right here, so let's go back and enter that in. Destination Address will be '172.16.1.5'. We're using HTTP, and the rest of this looks good. Down here, we could log packets handled by this rule. Since this is a web server, we probably don't want to do that since our log would be overwhelmed. If it was FTP, SSH, or other traffic like that, we probably would want to log traffic, but not for normal web requests. We do want to put a description in here because as you create more and more rules, you'll forget what they all do. For this, I'll type in 'HTTP to DMZ from WAN' and click Save. On our next page here, we have to click on Apply Changes for the changes to my firewall to take effect. So, here are my rules so far. I have one that allows my screened subnet out, and this second one is our HTTP rule from the WAN on port 80 the web server on our screened subnet. Now, you might be saying to yourself, \"Doesn't most web traffic use HTTPS these days?\" Well, that answer is certainly yes, so now we need an HTTPS rule. Here's some good news: to save a bit of time and keep from making any errors, we can just copy this rule and change the HTTP port 80 to HTTPS port 443. I'll click here, which is the Copy icon. What this does creates a new rule with the exact settings. I'll scroll down and change my source from HTTP port 80 to HTTPS port 443. For the destination, I'll do the same. Scroll down change the description by just adding the letter 'S'. Click Save. On this page, Click Apply Changes. Down here, you now see our rules for both HTTP and HTTPS.",
      "summary": "In this section, the course covers configuring firewall rules to allow HTTP and HTTPS traffic from the WAN to a web server in a screened subnet (DMZ). It emphasizes the importance of choosing between blocking and rejecting packets for security and troubleshooting purposes, while also detailing the steps to create and manage these rules effectively. The practical application includes setting specific IP addresses and ports, as well as the option to log traffic, ensuring a well-documented and functional firewall configuration.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.4.3",
        "title": "Configuring Firewall Rules",
        "content_type": "video",
        "filename": "5.4.3_Configuring_Firewall_Rules_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.4.3_Configuring_Firewall_Rules_[video].txt",
        "word_count": 1289,
        "has_content": true
      },
      "section_header": "Allow HTTP and HTTPS",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.4.3_chunk_3",
      "content": "Now let's look at our diagram again. This time, I want to create a rule that allows any traffic from my LAN to get to the screened subnet. Let's go back to our firewall and configure that now. These rules are read from the top down. So, for example, if the first rule says block everything, none of the other rules would ever be seen because that's the very first rule. However, if we made a rule right now that said to block everything and put it at the bottom, our first three rules would still be fine, but everything else would be blocked. By default, everything is blocked with pfSense anyway unless you open it, so we wouldn't really need that sort of rule, but it doesn't hurt anything. So far, our rules don't affect one another, so it really doesn't matter where we put them, but keep all of this in mind when creating rules. We'll just click on Add and use the one that puts it at the bottom of the list. Our Action will be to pass traffic. We'll leave the interface and address family alone. But for protocol, we're going to change this from TCP to Any. This might not be the best practice, but we're allowing any and all traffic from our LAN to reach our screened subnet. Under Source, we'll choose our LAN network from the list. Our destination will be the screened subnet from this list. We don't want to forget a description for this rule. I'll type 'LAN to DMZ Any'. Click Save. As always, Apply Changes. Here's my latest rule. My source is from the LAN on any port to my DMZ on any port. By the way, the asterisk is wildcard, which means any. Over here, the green check mark means it's enabled.",
      "summary": "In this section, the course demonstrates how to configure firewall rules in pfSense to allow traffic from a Local Area Network (LAN) to a screened subnet (DMZ). It emphasizes the importance of rule order, as rules are processed top-down, and illustrates the process of creating a rule that permits all traffic from the LAN to the DMZ while highlighting best practices for firewall management. The practical application involves setting the action to \"pass,\" selecting the appropriate source and destination, and ensuring the rule is saved and enabled.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.4.3",
        "title": "Configuring Firewall Rules",
        "content_type": "video",
        "filename": "5.4.3_Configuring_Firewall_Rules_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.4.3_Configuring_Firewall_Rules_[video].txt",
        "word_count": 1289,
        "has_content": true
      },
      "section_header": "Allow LAN Traffic to WAN",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.4.3_chunk_4",
      "content": "That's it for this demo. In this demo, we created firewall rules on our firewall.",
      "summary": "In this demo, participants learned how to create and configure firewall rules to enhance network security. Key concepts included understanding the purpose of firewalls, the types of rules that can be implemented, and their practical applications in protecting against unauthorized access and threats. This hands-on experience is essential for effectively managing and securing network environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.4.3",
        "title": "Configuring Firewall Rules",
        "content_type": "video",
        "filename": "5.4.3_Configuring_Firewall_Rules_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.4.3_Configuring_Firewall_Rules_[video].txt",
        "word_count": 1289,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 4
}