{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.5.6",
    "title": "Configure Remote Access non VPN",
    "content_type": "video",
    "filename": "5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
    "word_count": 757,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Remote access is a method that allows you to connect to a computer remotely from another computer. This could be useful if you're logging into your computer at home while you're away, helping a family member, or just requiring access to a server. Some of you may be familiar with a VPN, which stands for Virtual Private Network. This is another means of connecting to a remote network when you're physically not there. These connections require more knowledge to set up, but the non-VPN method we're showing you today doesn't. To get started, we'll open our web browser and type in remotedesktop.google.com. We'd like to access my computer, so let's click on this option here. You'll be required to have a Google account. We already have one, so we're just going to log in. First, we need to provide our email, and after that, input our password. We're not worried about saving the password or this extra pop-up down here, so we'll make these go away. On the left-hand side, we have three options: Remote Access, Remote Support, and Set up via SSH. Remote Access is for accessing another PC, something you'd set up. Remote Support would be for helping someone else, where they'd need to download a link and provide you with a code. The third option is to set up an SSH connection to a Windows or Linux Computer. We're going to walk through the setup for remote access. First, we must ensure we're on the computer requiring remote access and then download this link here. It will download an extension that can be used by both Chrome and Edge, as they're built on the same platform. It may take a bit for this to download, so we're going to fast-forward. Now, you can see the MSI file is downloaded. All we have to do is click Accept &amp; Install. This will start the installation process. The window should pop up to show us where the MSI file was downloaded. Once executed, it will prompt to close some applications before it can be installed. Our install is done, so we can close this window. Now that we have Chrome Remote Desktop installed, we can name the PC we are setting up. By default, it grabs the hostname of the computer. If your hostname wasn't set up previously, you may see a mix of letters and numbers instead of Office-PC like this one. We're going to click Next. For security purposes, you'll be required to set up a PIN. I'm going to set this and then confirm it for a second time. After clicking Start, we should be able to accept one final UAC prompt, and then our Office-PC should be ready to go. You'll notice it says Offline; however, when you refresh the web browser, it's now Online. Now, let's try connecting to this PC from another PC. Okay, we're on our other PC where Chrome Remote Desktop isn't installed. Let's navigate to remotedesktop.google.com and click Access my computer. Login with your previously set up credentials. Once done, we'll see the main screen for our remote desktop menu. In the middle, you can see the computer we just set up for remote access. Let's give it a go and select it. After that, you'll be prompted for a PIN. You can choose to remember it on this device; however, if you're focused on security, you can choose not to remember it. Great, it looks like our remote connection worked. We have access to the desktop and can do everything on it just like you'd be sitting at this desk, whether it's just surfing the internet or even launching different applications, like system information. That's it for this demo. In this demo, we showed you how you can leverage a way to connect to your PC remotely without using a VPN.",
  "chunks": [
    {
      "chunk_id": "5.5.6_chunk_1",
      "content": "Remote access is a method that allows you to connect to a computer remotely from another computer. This could be useful if you're logging into your computer at home while you're away, helping a family member, or just requiring access to a server. Some of you may be familiar with a VPN, which stands for Virtual Private Network. This is another means of connecting to a remote network when you're physically not there. These connections require more knowledge to set up, but the non-VPN method we're showing you today doesn't.",
      "summary": "The \"Configure Remote Access, non-VPN\" section of the CompTIA Security+ course covers methods for remotely connecting to computers without using a Virtual Private Network (VPN). It highlights practical applications such as accessing personal or server computers from different locations and provides simpler alternatives to VPNs for remote connectivity. Understanding these non-VPN methods is essential for effective remote support and access in various scenarios.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.6",
        "title": "Configure Remote Access non VPN",
        "content_type": "video",
        "filename": "5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "word_count": 757,
        "has_content": true
      },
      "section_header": "Configure Remote Access, non-VPN",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.6_chunk_2",
      "content": "To get started, we'll open our web browser and type in remotedesktop.google.com. We'd like to access my computer, so let's click on this option here. You'll be required to have a Google account. We already have one, so we're just going to log in. First, we need to provide our email, and after that, input our password. We're not worried about saving the password or this extra pop-up down here, so we'll make these go away. On the left-hand side, we have three options: Remote Access, Remote Support, and Set up via SSH. Remote Access is for accessing another PC, something you'd set up. Remote Support would be for helping someone else, where they'd need to download a link and provide you with a code. The third option is to set up an SSH connection to a Windows or Linux Computer. We're going to walk through the setup for remote access. First, we must ensure we're on the computer requiring remote access and then download this link here. It will download an extension that can be used by both Chrome and Edge, as they're built on the same platform. It may take a bit for this to download, so we're going to fast-forward. Now, you can see the MSI file is downloaded. All we have to do is click Accept &amp; Install. This will start the installation process. The window should pop up to show us where the MSI file was downloaded. Once executed, it will prompt to close some applications before it can be installed. Our install is done, so we can close this window. Now that we have Chrome Remote Desktop installed, we can name the PC we are setting up. By default, it grabs the hostname of the computer. If your hostname wasn't set up previously, you may see a mix of letters and numbers instead of Office-PC like this one. We're going to click Next. For security purposes, you'll be required to set up a PIN. I'm going to set this and then confirm it for a second time. After clicking Start, we should be able to accept one final UAC prompt, and then our Office-PC should be ready to go. You'll notice it says Offline; however, when you refresh the web browser, it's now Online. Now, let's try connecting to this PC from another PC.",
      "summary": "This section of the CompTIA Security+ course covers the setup of remote access using Google Chrome Remote Desktop. It guides users through logging in with a Google account, installing the necessary extension, and configuring a computer for remote access, including setting a secure PIN for authentication. The practical application emphasizes establishing secure connections for remote support and access, highlighting the importance of user authentication and device management in cybersecurity.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.6",
        "title": "Configure Remote Access non VPN",
        "content_type": "video",
        "filename": "5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "word_count": 757,
        "has_content": true
      },
      "section_header": "Setting up the Connection",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.6_chunk_3",
      "content": "Okay, we're on our other PC where Chrome Remote Desktop isn't installed. Let's navigate to remotedesktop.google.com and click Access my computer. Login with your previously set up credentials. Once done, we'll see the main screen for our remote desktop menu. In the middle, you can see the computer we just set up for remote access. Let's give it a go and select it. After that, you'll be prompted for a PIN. You can choose to remember it on this device; however, if you're focused on security, you can choose not to remember it. Great, it looks like our remote connection worked. We have access to the desktop and can do everything on it just like you'd be sitting at this desk, whether it's just surfing the internet or even launching different applications, like system information.",
      "summary": "This section covers the process of connecting to a remote computer using Chrome Remote Desktop, emphasizing the importance of secure login credentials and PIN management. Users learn to access their remote desktop by navigating to the designated website, logging in, and selecting the computer set up for remote access, all while maintaining security best practices. The practical application allows users to perform tasks remotely as if they were physically present at the desktop.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.6",
        "title": "Configure Remote Access non VPN",
        "content_type": "video",
        "filename": "5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "word_count": 757,
        "has_content": true
      },
      "section_header": "Connecting to a Remote Computer",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.6_chunk_4",
      "content": "That's it for this demo. In this demo, we showed you how you can leverage a way to connect to your PC remotely without using a VPN.",
      "summary": "The demo illustrates a method for remote PC access without relying on a VPN, highlighting alternative connectivity solutions. Key security concepts include understanding remote access protocols and the implications of bypassing traditional VPN security measures. Practical applications involve enhancing accessibility while maintaining security standards in remote work environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.6",
        "title": "Configure Remote Access non VPN",
        "content_type": "video",
        "filename": "5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.6_Configure_Remote_Access_non_VPN_[video].txt",
        "word_count": 757,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 4
}