{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.5.2",
    "title": "Configuring a VPN",
    "content_type": "video",
    "filename": "5.5.2_Configuring_a_VPN_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
    "word_count": 1671,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demonstration, we're going to cover how to configure OpenVPN on a pfSense security appliance. We're already logged into pfSense on the Dashboard page. The first thing I'm going to do is to go to System > Package Manager and select Available Packages. I'm going to type in ‘openvpn' to search for the OpenVPN Client Export package. This will allow us to export our configuration settings to make setting up our clients a lot easier. Click Install and Confirm. This will take about a minute or so to install. Now let's confirm the installation. Success. Now let's go over to VPN > OpenVPN. We'll select Wizard to get started. In the past, setting up a VPN was a bit complicated, but the wizard makes setting up OpenVPN really quick and easy. For the type of server, we're going to select Local User Access. We could also pick LDAP or RADIUS if you have those set up, but we don't. Click Next to continue. Now we need to create a certificate authority. pfSense adds this right in the wizard so you don't have to do it manually somewhere else, which is nice. For the Descriptive name, I'll just enter in \"TestoutCA\". I'll leave these next few fields at the default values and go down to Country Code. Here, I'll enter ‘US'. For State or Province, I'll enter ‘UT' for Utah. For City, I'm in the wonderful town of ‘Pleasant Grove'. For Organization, I'll put ‘TestOut'. Now click on Add new CA to add the Certificate Authority to the server. Now we must create a new server certificate. We just added the Certificate Authority. Next, we need an actual certificate. For Descriptive name, I'll just put ‘Testout'. I'll leave everything with the default values. Country Code, State, City, and Organization are all auto-populated with the correct answers, so I'll just click on Create new certificate. Now let's configure the server information. For our interface, we want to select our WAN. We also have LAN and DMZ. Our WAN is where traffic will typically come from. Our Protocol will be UDP on IPv4 only. You can see we have some other choices in case your setup is different from mine. Our VPN uses the default port of 1194. We'll enter a description for our VPN and just call it ‘TestoutVPN'. We'll leave all the cryptographic settings set to their defaults and skip down to Tunnel Settings. The first thing we must do is enter some virtual network settings for our tunnel network. This will be a virtual network that our clients and server will use to communicate on. I'm going to enter '10.10.20.0/24'. All my VPN clients will get an IP address of 10.10.20.something with a subnet mask of 255.255.255.0. Next is our local network. This is the LAN network that your VPN clients will access. My local LAN network is '10.10.10.0/24'. For concurrent connections, I'll just put in 5. You can enter more or less than that. It just depends on how many VPN users you'll have connecting at one time. Now, once your users connect, they'll need a DNS server. You could put in a public DNS or local DNS. I'll put in the DNS that my LAN uses, which is '10.10.10.1'. This is also the IP address of my pfSense appliance. Scroll down and click Next. Now we need to set up two firewall rules. We need to allow traffic from our VPN clients to our VPN server. We also need to allow traffic from our clients through the VPN to our network. Lucky for us, we don't have to do this manually. OpenVPN understands what we need, and by checking these boxes, OpenVPN will configure those rules for us. Configuring rules is not part of this lesson, but they're certainly a skill you need to know. Click Next to continue. And on this page, click Finish. Let's review what we've done. We have our interface set to WAN. Our protocol and port are set to UDP on port 1194. Our tunnel network looks good. Our encryption is here. And our description is TestoutVPN. Now let's head over to System > User Manager and click on Add. I really don't want my admin user to be the same as one of my VPN users, so I'm going to add a different user here to keep them separate. For the username, I'll enter ‘danafellows'. I'll enter my password and confirm it. I'll just put Dana for the full name. Click Save. Everything looks good, and that's all I need to do here. I'll go back up to VPN > OpenVPN, come down here, and click on the edit icon. For some reason, our server mode changes to Remote Access SSL plus TLS, but we're using Remote Access (User Auth), so we need to confirm that and change it back if needed. It looks like we do, in fact, need to change that. I'll scroll down to the bottom and click on Save. Now it's time to download the client configuration. We'll go to Client Export. On the next page, scroll down to our list of OpenVPN client configuration options. I'll find the one for the Windows Installer and click on it to download the configuration file. Now I'll copy this over to a machine I have on a different network and install the OpenVPN client. I'm now on a machine on my DMZ network. I copied the installation file over, and I'll install it now. I'll click Yes to the User Access Control, click Install to continue, and click through all the rest of these to complete the installation process. Click Finish, and finally, click Close. Now let's double-click to start the OpenVPN client. I'll drag the installation files into the Recycle Bin. I'll move the OpenVPN client, here on the taskbar, to a spot where we can see it better. Right-click on it and choose Connect. My username is automatically populated, so I'll just enter in my password and check the Save password box. Click OK to connect. I get a message that I'm connected, and my Assigned IP is listed here. Now, if you're like me, you might ask yourself, \"How did the client know how to connect to my OpenVPN server out there on the internet?\" Let's take a second to look at the config file. I'll right-click and select Edit Config to open it. It opens in a text file, and here are all the settings that were configured for us. Down here is the IP address of the WAN interface. Now, you might say, \"Hey, that's a private IP address.\" Yes it is. This is a test network, so I'm actually using a private IP range for my WAN. Let's take a look at that for a minute. Here's a diagram of my test network. I accessed my pfSense and OpenVPN settings from this client, over here. The configuration is actually here, on the pfSense. The client over on my DMZ network is the one that initiated the connection to the VPN just a second ago. This client can be anywhere on the internet, but for demo purposes, I placed it on my DMZ. Now let's just confirm a few final things before we wrap up. I'm still on my client on my DMZ. I'm going to open a command prompt to check my IP settings. I'll do an ‘ipconfig /all' and press Enter. I'll scroll up a bit. Here's the IP address of this machine on the DMZ, 172.16.1.101. That is my IP scheme for the DMZ. Now let's scroll down a bit. Remember, we made our tunnel network 10.10.20.0, and right here is an address from that range that's assigned to us. We saw that a few minutes ago, also right after we connected. One final thing. I access the pfSense configuration through a web browser. I have it blocked from being accessed externally. But since we're connected to the LAN through this VPN, let's see if we can access it. I'll open my browser, and in the Address field, I'll enter the IP of the pfSense with the LAN address of 10.10.10.1. When I do that, the Sign In page is displayed, confirming that I have access to LAN resources. That's it for this demo. We configured OpenVPN on pfSense. We installed the client configuration package, set up our certificate, configured OpenVPN server settings, created a user, downloaded and installed the OpenVPN client on a remote host, and confirmed our connection.",
  "chunks": [
    {
      "chunk_id": "5.5.2_chunk_1",
      "content": "In this demonstration, we're going to cover how to configure OpenVPN on a pfSense security appliance. We're already logged into pfSense on the Dashboard page.",
      "summary": "This section demonstrates the configuration of OpenVPN on a pfSense security appliance, focusing on practical steps to establish a secure virtual private network (VPN). Key concepts include understanding VPN protocols, secure remote access, and the importance of encryption in safeguarding data transmission. The practical application of this knowledge enables users to enhance their network security and protect sensitive information from unauthorized access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Configuring a VPN",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_2",
      "content": "The first thing I'm going to do is to go to System > Package Manager and select Available Packages. I'm going to type in ‘openvpn' to search for the OpenVPN Client Export package. This will allow us to export our configuration settings to make setting up our clients a lot easier. Click Install and Confirm. This will take about a minute or so to install. Now let's confirm the installation. Success.",
      "summary": "In this section, users learn to install the OpenVPN Client Export package through the System > Package Manager by searching for 'openvpn' and confirming the installation. This package simplifies the process of exporting configuration settings, facilitating easier client setup. Successful installation is confirmed after a brief wait, enhancing the overall efficiency of VPN client management.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Install OpenVPN Client Export Package",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_3",
      "content": "Now let's go over to VPN > OpenVPN. We'll select Wizard to get started. In the past, setting up a VPN was a bit complicated, but the wizard makes setting up OpenVPN really quick and easy. For the type of server, we're going to select Local User Access. We could also pick LDAP or RADIUS if you have those set up, but we don't. Click Next to continue.",
      "summary": "In this section, learners are introduced to configuring an OpenVPN server using a user-friendly wizard that simplifies the setup process. The tutorial focuses on selecting the Local User Access server type, while also mentioning alternative options like LDAP or RADIUS for environments where those are configured. This practical application emphasizes ease of use in establishing secure VPN connections.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Configure OpenVPN Server Type",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_4",
      "content": "Now we need to create a certificate authority. pfSense adds this right in the wizard so you don't have to do it manually somewhere else, which is nice. For the Descriptive name, I'll just enter in \"TestoutCA\". I'll leave these next few fields at the default values and go down to Country Code. Here, I'll enter ‘US'. For State or Province, I'll enter ‘UT' for Utah. For City, I'm in the wonderful town of ‘Pleasant Grove'. For Organization, I'll put ‘TestOut'. Now click on Add new CA to add the Certificate Authority to the server. Now we must create a new server certificate. We just added the Certificate Authority. Next, we need an actual certificate. For Descriptive name, I'll just put ‘Testout'. I'll leave everything with the default values. Country Code, State, City, and Organization are all auto-populated with the correct answers, so I'll just click on Create new certificate.",
      "summary": "In this section, users learn to configure OpenVPN by creating a Certificate Authority (CA) directly within the pfSense wizard, simplifying the process. By entering relevant details such as the descriptive name, country code, state, city, and organization, users can easily establish a CA. Following this, a new server certificate is created using the CA, ensuring secure communication for the OpenVPN setup.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Configure OpenVPN Certificate",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_5",
      "content": "Now let's configure the server information. For our interface, we want to select our WAN. We also have LAN and DMZ. Our WAN is where traffic will typically come from. Our Protocol will be UDP on IPv4 only. You can see we have some other choices in case your setup is different from mine. Our VPN uses the default port of 1194. We'll enter a description for our VPN and just call it ‘TestoutVPN'. We'll leave all the cryptographic settings set to their defaults and skip down to Tunnel Settings. The first thing we must do is enter some virtual network settings for our tunnel network. This will be a virtual network that our clients and server will use to communicate on. I'm going to enter '10.10.20.0/24'. All my VPN clients will get an IP address of 10.10.20.something with a subnet mask of 255.255.255.0. Next is our local network. This is the LAN network that your VPN clients will access. My local LAN network is '10.10.10.0/24'. For concurrent connections, I'll just put in 5. You can enter more or less than that. It just depends on how many VPN users you'll have connecting at one time. Now, once your users connect, they'll need a DNS server. You could put in a public DNS or local DNS. I'll put in the DNS that my LAN uses, which is '10.10.10.1'. This is also the IP address of my pfSense appliance. Scroll down and click Next.",
      "summary": "In the OpenVPN setup, the server configuration involves selecting the WAN interface for incoming traffic, using UDP on IPv4 with the default port 1194. The virtual tunnel network is established with the IP range 10.10.20.0/24 for clients, while the local LAN network is set to 10.10.10.0/24, allowing up to five concurrent connections. Additionally, a DNS server is configured to facilitate client access, enhancing the overall functionality of the VPN.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "OpenVPN Setup",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_6",
      "content": "Now we need to set up two firewall rules. We need to allow traffic from our VPN clients to our VPN server. We also need to allow traffic from our clients through the VPN to our network. Lucky for us, we don't have to do this manually. OpenVPN understands what we need, and by checking these boxes, OpenVPN will configure those rules for us. Configuring rules is not part of this lesson, but they're certainly a skill you need to know. Click Next to continue. And on this page, click Finish. Let's review what we've done. We have our interface set to WAN. Our protocol and port are set to UDP on port 1194. Our tunnel network looks good. Our encryption is here. And our description is TestoutVPN.",
      "summary": "In this section on firewall rules, the focus is on configuring OpenVPN to allow traffic from VPN clients to the VPN server and from clients through the VPN to the network. While the lesson does not cover manual rule configuration, it emphasizes the importance of understanding firewall rules as a critical skill in cybersecurity. Key settings include using UDP on port 1194 for the protocol and ensuring the tunnel network and encryption are appropriately configured.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Firewall Rules",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_7",
      "content": "Now let's head over to System > User Manager and click on Add. I really don't want my admin user to be the same as one of my VPN users, so I'm going to add a different user here to keep them separate. For the username, I'll enter ‘danafellows'. I'll enter my password and confirm it. I'll just put Dana for the full name. Click Save. Everything looks good, and that's all I need to do here.",
      "summary": "In this section, users learn how to add a new OpenVPN user through the System > User Manager interface, emphasizing the importance of keeping admin and VPN user accounts separate for enhanced security. The process involves entering a unique username, password, and full name, followed by saving the changes to create the new user account. This practical application reinforces best practices in user management and access control within a VPN environment.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Add an OpenVPN User",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_8",
      "content": "I'll go back up to VPN > OpenVPN, come down here, and click on the edit icon. For some reason, our server mode changes to Remote Access SSL plus TLS, but we're using Remote Access (User Auth), so we need to confirm that and change it back if needed. It looks like we do, in fact, need to change that. I'll scroll down to the bottom and click on Save.",
      "summary": "In the Confirm Server Access Mode section, the focus is on verifying and adjusting the server mode settings for OpenVPN to ensure proper configuration for Remote Access (User Auth) instead of the incorrect Remote Access SSL plus TLS. The process involves accessing the VPN settings, confirming the mode, and saving any necessary changes to maintain secure user authentication. This practical application highlights the importance of accurate server configurations in maintaining secure remote access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Confirm Server Access Mode",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_9",
      "content": "Now it's time to download the client configuration. We'll go to Client Export. On the next page, scroll down to our list of OpenVPN client configuration options. I'll find the one for the Windows Installer and click on it to download the configuration file. Now I'll copy this over to a machine I have on a different network and install the OpenVPN client.",
      "summary": "In the Client Download section, users learn how to download the OpenVPN client configuration by navigating to the Client Export page and selecting the appropriate Windows Installer option. The process involves downloading the configuration file and transferring it to a different networked machine for installation. This practical application emphasizes the importance of proper client setup in establishing secure VPN connections.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Client Download",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_10",
      "content": "I'm now on a machine on my DMZ network. I copied the installation file over, and I'll install it now. I'll click Yes to the User Access Control, click Install to continue, and click through all the rest of these to complete the installation process. Click Finish, and finally, click Close. Now let's double-click to start the OpenVPN client. I'll drag the installation files into the Recycle Bin. I'll move the OpenVPN client, here on the taskbar, to a spot where we can see it better. Right-click on it and choose Connect. My username is automatically populated, so I'll just enter in my password and check the Save password box. Click OK to connect. I get a message that I'm connected, and my Assigned IP is listed here. Now, if you're like me, you might ask yourself, \"How did the client know how to connect to my OpenVPN server out there on the internet?\" Let's take a second to look at the config file. I'll right-click and select Edit Config to open it. It opens in a text file, and here are all the settings that were configured for us. Down here is the IP address of the WAN interface. Now, you might say, \"Hey, that's a private IP address.\" Yes it is. This is a test network, so I'm actually using a private IP range for my WAN. Let's take a look at that for a minute. Here's a diagram of my test network. I accessed my pfSense and OpenVPN settings from this client, over here. The configuration is actually here, on the pfSense. The client over on my DMZ network is the one that initiated the connection to the VPN just a second ago. This client can be anywhere on the internet, but for demo purposes, I placed it on my DMZ. Now let's just confirm a few final things before we wrap up.",
      "summary": "This section covers the installation and configuration of the OpenVPN client on a machine within a DMZ network. It demonstrates the installation process, connection to the VPN server, and the importance of the configuration file, which contains essential settings such as the WAN interface IP address. Practical applications include securing remote connections and understanding network architecture through the use of VPN technology.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Install and Run OpenVPN Client",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_11",
      "content": "I'm still on my client on my DMZ. I'm going to open a command prompt to check my IP settings. I'll do an ‘ipconfig /all' and press Enter. I'll scroll up a bit. Here's the IP address of this machine on the DMZ, 172.16.1.101. That is my IP scheme for the DMZ. Now let's scroll down a bit. Remember, we made our tunnel network 10.10.20.0, and right here is an address from that range that's assigned to us. We saw that a few minutes ago, also right after we connected. One final thing. I access the pfSense configuration through a web browser. I have it blocked from being accessed externally. But since we're connected to the LAN through this VPN, let's see if we can access it. I'll open my browser, and in the Address field, I'll enter the IP of the pfSense with the LAN address of 10.10.10.1. When I do that, the Sign In page is displayed, confirming that I have access to LAN resources.",
      "summary": "In this section, the user verifies the successful connection of OpenVPN by checking the IP settings via the command prompt, confirming the assigned IP address from the tunnel network. The ability to access the pfSense configuration through a web browser while connected to the VPN demonstrates the secure access to LAN resources, highlighting practical applications of VPN technology in safeguarding network configurations. This process emphasizes the importance of IP management and secure remote access in cybersecurity practices.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Confirm That OpenVPN is Connected",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.5.2_chunk_12",
      "content": "That's it for this demo. We configured OpenVPN on pfSense. We installed the client configuration package, set up our certificate, configured OpenVPN server settings, created a user, downloaded and installed the OpenVPN client on a remote host, and confirmed our connection.",
      "summary": "In this CompTIA Security+ course section, participants learn to configure OpenVPN on pfSense, including the installation of the client configuration package and certificate setup. Key tasks involve configuring server settings, creating user accounts, and installing the OpenVPN client on a remote host to establish a secure connection. This practical application emphasizes the importance of VPNs in enhancing network security and remote access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.2",
        "title": "Configuring a VPN",
        "content_type": "video",
        "filename": "5.5.2_Configuring_a_VPN_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.2_Configuring_a_VPN_[video].txt",
        "word_count": 1671,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 12
}