{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.6.1",
    "title": "Network Access Control",
    "content_type": "video",
    "filename": "5.6.1_Network_Access_Control_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
    "word_count": 1248,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Network Access Control, or NAC, is a process control that prevents unauthorized access and preserves the integrity of a production network. Depending on the configuration, an endpoint must meet certain criteria in order to join the internal network. In this lesson, we'll discuss the components and steps required for an end device to access an internal network. Before an end device can connect, it must go through several validation checks, and it meet specified criteria. For example, a system may need to be running Windows 10 with update 1907. It may also need to have the latest antivirus latest definitions installed, have Windows firewall enabled, have the latest updates installed, and have automatic updates enabled. If any of this criteria isn't met, the system belongs on a restricted network. A restricted network has equipment with the software, drivers, and updates you need to retrieve the required settings. Once the system is remediated and receives all the updates and system changes, it's safe for it to join the production network. Depending on the company's business market, a compliance model may dictate the level of protection and integrity a network system requires. Compliance industries include the medical, defense, and financial sectors. Each one has government-regulated compliance rules. The basic tenants of NAC include zero-day attack mitigation, role-based controls, traffic encryption, identity management, and policy enforcement. These goals vary widely depending on NAC implementation, configuration, compliance requirements, and industry. To create an effective solution, you have to understand the resources you're protecting and why you're protecting them. Now, network access control is a process, not a product, although several companies implement a product that uses the NAC process. For example, Cisco has a solution called Identity Services Engine, or ISE, while Microsoft has Network Access Protection, or NAP. Each is a framework that provides protection against unauthorized access or rogue system access to a protected network. The distinction between products is vendor-specific, and so is the implementation. Before a device can connect to the production network, it must go through a health check. The health check is configured by system management and may include criteria like antivirus software, firewall configurations, and patches. This health check is performed by software designed solely for this purpose. One way to run this software is using an agent. An agent is a preinstalled software program that performs these health checks at predefined times. One example of how this might work happens when the workstation attempts a connection to the production network. At that time, the agent is activated and goes through its checks to ensure that the workstation meets the minimum requirements to access the production network. Depending on the vendor, it's also possible to perform health checks on demand. This process is agentless, meaning it doesn't require a permanent agent to be preinstalled. Instead, the required software is downloaded and executed at the workstation when it attempts to connect to the network. Access to the production network is only granted if all the prerequisites are met and the health check passes. Network Access Control is a policy-driven construct that maintains network integrity using authentication and authorization policies. NAC can be compartmentalized for different types of devices such as Internet of Things, Bring Your Own Device, or vendors and contractors. NAC defines the prerequisites and identity, or authentication. If a devices meets requirements, NAC provides access to the target information. You can think of NAC as a layered approach to providing network admission and access. Let's see how it works. The first layer defines the tasks required for authentication. The authentication layer defines all the prerequisites a device must meet to access the network. This criteria is detailed in policies that define minimum requirements for the device, such as anti-malware software, OS type, patch level, and so on. Keep in mind that the policies may be different for dissimilar types of devices. For instance, a tablet may be required to be managed by an MDM package or have backup and remote wipe enabled. Likewise, an Internet of Things device might be required to use a secure VLAN. If a device fails authentication, it's forwarded to a remediation network. This network is protected and doesn't have access to any production information or outside areas such as the internet. Instead, the remediation network is preconfigured to contain all the necessary software and procedures to bring a device into compliance. It may have software updates, anti-malware definitions, and other control software. Once a device goes through remediation, it goes through the authentication process again. If it passes, it moves on to the authorization process. The most secure method for ensuring integrity is a zero-trust access model. This is the concept of least privilege, or implicit deny all. With this model, users or devices are only given the permissions they require to do their jobs– no more, no less. The authorization process looks at the authentication information and applies the policies you choose. After the device goes through the authorization process, it's granted access to the production network. This process isn't easy to set up, and it's often set up incorrectly. Several policies must be put into place, and boundary networks must be configured. Everything from connectivity devices to routing and switching must comply with the necessary logic to ensure that this process works. While difficult, it may be absolutely necessary in higher security environments where integrity is required. This is especially true in regulated industries. NAC is a complicated process that requires forethought. The first step is planning. A committee should convene and make decisions that define how NAC will work. Next, roles, identities, and permissions must be defined. Then these polices must be applied. As business needs change, NAC configuration must be reviewed to determine whether it should change, too. That's it for this lesson. In this video, we discussed how Network Access Control is a concept that helps to ensure the integrity of a network system. It provides a more granular approach to providing network access by enforcing minimum requirements applied to devices. You can define items such as anti-malware, OS versions, patch levels, and more. If devices don't meet these requirements, they're redirected to a remediation network. Once they're authenticated, devices are authorized and granted access. This is an ongoing process as business processes change and the organization grows.",
  "chunks": [
    {
      "chunk_id": "5.6.1_chunk_1",
      "content": "Network Access Control, or NAC, is a process control that prevents unauthorized access and preserves the integrity of a production network. Depending on the configuration, an endpoint must meet certain criteria in order to join the internal network. In this lesson, we'll discuss the components and steps required for an end device to access an internal network.",
      "summary": "Network Access Control (NAC) is a security measure that ensures only authorized devices can access a network, thereby maintaining its integrity. This section covers the essential components and criteria that endpoints must meet to gain access to the internal network, highlighting the importance of proper configuration in safeguarding network resources. Practical applications of NAC include enforcing security policies and monitoring device compliance to enhance overall network security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "Network Access Control",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_2",
      "content": "Before an end device can connect, it must go through several validation checks, and it meet specified criteria. For example, a system may need to be running Windows 10 with update 1907. It may also need to have the latest antivirus latest definitions installed, have Windows firewall enabled, have the latest updates installed, and have automatic updates enabled. If any of this criteria isn't met, the system belongs on a restricted network. A restricted network has equipment with the software, drivers, and updates you need to retrieve the required settings. Once the system is remediated and receives all the updates and system changes, it's safe for it to join the production network.",
      "summary": "Before connecting to a network, end devices must pass validation checks that ensure they meet specific security criteria, such as running an updated operating system and having the latest antivirus definitions. If a device fails to meet these requirements, it is placed on a restricted network where it can receive necessary updates and configurations. Once the device is remediated and compliant, it can safely join the production network.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "Admission Criteria",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_3",
      "content": "Depending on the company's business market, a compliance model may dictate the level of protection and integrity a network system requires. Compliance industries include the medical, defense, and financial sectors. Each one has government-regulated compliance rules. The basic tenants of NAC include zero-day attack mitigation, role-based controls, traffic encryption, identity management, and policy enforcement. These goals vary widely depending on NAC implementation, configuration, compliance requirements, and industry. To create an effective solution, you have to understand the resources you're protecting and why you're protecting them.",
      "summary": "Network Access Control (NAC) aims to ensure the security and integrity of network systems by adhering to industry-specific compliance models, particularly in regulated sectors like healthcare, defense, and finance. Key NAC goals include mitigating zero-day attacks, implementing role-based access controls, encrypting traffic, managing identities, and enforcing policies. Effective NAC solutions require a thorough understanding of the resources being protected and the specific compliance requirements of the industry.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "NAC Goals",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_4",
      "content": "Now, network access control is a process, not a product, although several companies implement a product that uses the NAC process. For example, Cisco has a solution called Identity Services Engine, or ISE, while Microsoft has Network Access Protection, or NAP. Each is a framework that provides protection against unauthorized access or rogue system access to a protected network. The distinction between products is vendor-specific, and so is the implementation.",
      "summary": "Network Access Control (NAC) is a process designed to protect networks from unauthorized access, implemented through various vendor-specific solutions. Cisco's Identity Services Engine (ISE) and Microsoft's Network Access Protection (NAP) are examples of frameworks that facilitate this protection. The choice of solution and its implementation can vary significantly between vendors, highlighting the importance of understanding specific technologies in cybersecurity.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "Vendor-Specific Solution",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_5",
      "content": "Before a device can connect to the production network, it must go through a health check. The health check is configured by system management and may include criteria like antivirus software, firewall configurations, and patches. This health check is performed by software designed solely for this purpose. One way to run this software is using an agent. An agent is a preinstalled software program that performs these health checks at predefined times. One example of how this might work happens when the workstation attempts a connection to the production network. At that time, the agent is activated and goes through its checks to ensure that the workstation meets the minimum requirements to access the production network.",
      "summary": "The NAC (Network Access Control) agent is a preinstalled software that conducts health checks on devices before they can connect to a production network, ensuring compliance with security criteria such as antivirus status, firewall settings, and software patches. This process is initiated when a device attempts to connect, allowing the agent to verify that it meets the necessary security requirements. By implementing NAC agents, organizations can enhance their network security by preventing non-compliant devices from accessing sensitive resources.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "NAC Agent",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_6",
      "content": "Depending on the vendor, it's also possible to perform health checks on demand. This process is agentless, meaning it doesn't require a permanent agent to be preinstalled. Instead, the required software is downloaded and executed at the workstation when it attempts to connect to the network. Access to the production network is only granted if all the prerequisites are met and the health check passes.",
      "summary": "The NAC (Network Access Control) agentless approach allows for on-demand health checks without the need for a permanent agent installation on workstations. Instead, necessary software is temporarily downloaded and executed during the connection attempt, ensuring that access to the production network is granted only if all security prerequisites are satisfied. This method enhances network security by verifying device compliance before allowing network access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "NAC Agentless",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_7",
      "content": "Network Access Control is a policy-driven construct that maintains network integrity using authentication and authorization policies. NAC can be compartmentalized for different types of devices such as Internet of Things, Bring Your Own Device, or vendors and contractors. NAC defines the prerequisites and identity, or authentication. If a devices meets requirements, NAC provides access to the target information. You can think of NAC as a layered approach to providing network admission and access. Let's see how it works. The first layer defines the tasks required for authentication. The authentication layer defines all the prerequisites a device must meet to access the network. This criteria is detailed in policies that define minimum requirements for the device, such as anti-malware software, OS type, patch level, and so on. Keep in mind that the policies may be different for dissimilar types of devices. For instance, a tablet may be required to be managed by an MDM package or have backup and remote wipe enabled. Likewise, an Internet of Things device might be required to use a secure VLAN. If a device fails authentication, it's forwarded to a remediation network. This network is protected and doesn't have access to any production information or outside areas such as the internet. Instead, the remediation network is preconfigured to contain all the necessary software and procedures to bring a device into compliance. It may have software updates, anti-malware definitions, and other control software. Once a device goes through remediation, it goes through the authentication process again. If it passes, it moves on to the authorization process. The most secure method for ensuring integrity is a zero-trust access model. This is the concept of least privilege, or implicit deny all. With this model, users or devices are only given the permissions they require to do their jobs– no more, no less. The authorization process looks at the authentication information and applies the policies you choose. After the device goes through the authorization process, it's granted access to the production network. This process isn't easy to set up, and it's often set up incorrectly. Several policies must be put into place, and boundary networks must be configured. Everything from connectivity devices to routing and switching must comply with the necessary logic to ensure that this process works. While difficult, it may be absolutely necessary in higher security environments where integrity is required. This is especially true in regulated industries.",
      "summary": "Network Access Control (NAC) is a policy-driven framework that ensures network integrity through authentication and authorization processes tailored for various device types, including IoT and BYOD. It employs a layered approach where devices must meet specific security prerequisites, such as having up-to-date anti-malware and OS patches, to gain access; non-compliant devices are directed to a remediation network for compliance. The implementation of a zero-trust access model enhances security by granting the least privilege necessary, making NAC essential in high-security environments and regulated industries.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "How NAC Works",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_8",
      "content": "NAC is a complicated process that requires forethought. The first step is planning. A committee should convene and make decisions that define how NAC will work. Next, roles, identities, and permissions must be defined. Then these polices must be applied. As business needs change, NAC configuration must be reviewed to determine whether it should change, too.",
      "summary": "Network Access Control (NAC) implementation involves careful planning and the establishment of a committee to define operational parameters. Key steps include defining roles, identities, and permissions, followed by the application of these policies. As business requirements evolve, it is essential to regularly review and adjust the NAC configuration to ensure it remains effective.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "Next Steps",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.6.1_chunk_9",
      "content": "That's it for this lesson. In this video, we discussed how Network Access Control is a concept that helps to ensure the integrity of a network system. It provides a more granular approach to providing network access by enforcing minimum requirements applied to devices. You can define items such as anti-malware, OS versions, patch levels, and more. If devices don't meet these requirements, they're redirected to a remediation network. Once they're authenticated, devices are authorized and granted access. This is an ongoing process as business processes change and the organization grows.",
      "summary": "Network Access Control (NAC) is a crucial concept in cybersecurity that ensures network integrity by enforcing minimum security requirements for devices seeking access. It involves assessing factors such as anti-malware status, operating system versions, and patch levels; devices that do not comply are redirected to a remediation network. This process is dynamic, adapting to evolving business needs and organizational growth to maintain a secure network environment.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.6.1",
        "title": "Network Access Control",
        "content_type": "video",
        "filename": "5.6.1_Network_Access_Control_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.6.1_Network_Access_Control_[video].txt",
        "word_count": 1248,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 9
}