{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.9.1",
    "title": "Switch Features",
    "content_type": "video",
    "filename": "5.9.1_Switch_Features_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
    "word_count": 1979,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this lesson, I'm going to discuss switches and some of their features. This isn't meant to be an exhaustive discussion of switch configurations. Instead, I'll cover topics that can affect your network security. As you probably already know, a switch is a connectivity device that provides communication between different network devices. Switches often use a wired communication medium such as twisted pair and fiber optic to carry the signaling to and from their connected devices. Switches are full-duplex discretionary interconnects that send information only to the intended recipient. I'll explain all of this further in this lesson. First, let's talk about how a switch works. Every device that connects to a network, whether wired or wireless, has a unique identifier called a Media Access Control address, or MAC address. The MAC address is a 48-bit number separated into six 2-byte numbers. The first 24 bits represent the device manufacturer. In this example, 18-66-DA represents Dell, Inc. The last 24 bits are a random sequential number assigned by the manufacturer to ensure that each device has a unique MAC address. When referencing the OSI model, a MAC address is a layer 2 address and the data that traverses the wire is called a frame. The switch keeps track of the MAC address to which it's connected. Inside every switch is a table of MAC addresses and the port the device is plugged into. This is called the MAC address table. As data traverses the switch, it builds this table based on the frames passing through it. This process continues until all devices connected to the switch are accounted for and the MAC address table is complete. When the MAC address table is complete, the switch can send data directly to the appropriate end device since the table defines which port each device is connected to. It's also important to know that switches are full-duplex devices. This means they can send and receive data simultaneously. This, along with the data separation by port, means that the chance of an Ethernet collision happening is reduced significantly and speed and efficiency are increased. Switches are classified as being either unmanaged or managed. An unmanaged switch is often found in homes and small office networks and provides the ability to connect all your devices. Unmanaged switches, on the other hand, aren't configurable. This is just fine for smaller networks that really don't have a need for much sophistication. But larger networks do need additional capabilities. This is where you'll require a managed switch. Managed switches usually have a web-based or command line interface that lets you configure how the switch functions. For example, a switch's configuration tools let you create and manage virtual LANs, or VLANs. VLANs segment data into different zones. This segmentation might be required for such things as voice, surveillance, and storage. Or it could simply separate zone data for additional resiliency and privacy. Managed switches also support link aggregation, which provides the ability to combine multiple switch ports in parallel to increase total available bandwidth. This is often used when connecting to devices with multiple NICs that provide things like file and storage services. You can also configure a switch for port security. This lets you define things like which devices and how many can be attached to a single port. A managed switch has many additional benefits that go beyond the scope of this course. But the basic takeaway here is most organizations use managed switches since they can be configured and provide better security. Another related topic is switch aggregation. Let's look at that a little closer. Often, when you create a switching solution, it's necessary to employ multiple switches throughout a building. There are several reasons for this. The most prevalent is the need to have close proximity to end devices. Ethernet specifications provide for a maximum length of 100 meters between a switch and an endpoint, assuming there are no breaks in the connection such as a wall plate or patch panel. Often, we place wiring closets throughout a building so the 100-meter limit isn't violated. Normally, an access level switch is placed in the wiring closet to connect a system that's configured for VLANs, port security, and voice over IP. Depending on the number of connections you're dealing with, you might deploy multiple switches for this purpose. These switches are then connected to an upstream switch. The upstream switch is usually much faster and more efficient. Often, the connections between the upstream switch and the access switches are fiber optic, which doesn't have the same distance limitations as a twisted pair of Ethernet cables. In addition, fiber-optic connections are much faster than twisted-pair Ethernet connections. When you make your decision on the type of switch to purchase, you'll have to choose between a layer 2 and layer 3 switch. While you use both switches to connect end devices to a network, they each have different features. For example, as the name implies, a layer 2 switch operates at the second layer of the OSI model, which is the Data Link layer. This means the switch understands the connected end devices' physical or MAC addresses. At this level, data passing through switches are known as frames. The port used to send data to an end device is determined by that device's MAC address. A layer 3 switch operates at the third layer of the OSI model, which is the Network layer. These types of switches can perform the same functions as layer 2 switches. But in addition, a layer 3 switch is aware of the end device's IP address. At the Network layer, the data passing through the switch is known as a packet. A layer 3 switch is also capable of limited IP routing, meaning that layer 3 routers are often used to route packets to and from different VLANs. In practice, Layer 3 switches aren't intended for connecting end devices. Instead, we typically use them for upstream switches. Now that you understand the basic functions of a switch, let's discuss switch security. Just like any network device, threat actors try to exploit any weakness they can. Switches are no exception. Attackers can use a variety of techniques to compromise switches to gain access to a system. As such, it's important for system administrators to take precautions and disable switch functions that aren't in use and to monitor switch activity. Three security issues to look out for are MAC flooding, switch spoofing, and ARP poisoning. Let's look at each. We went over how a switch maintains a table of MAC addresses and the ports to which they're connected. A switch maintains enough memory to store that data and not much more. Knowing this, an attacker might try to flood the switch with bogus MAC addresses. This pushes the legitimate MAC address out and fills up the switch's memory. In effect, this breaks the switch. When the memory is full, the switch reverts to an open state where data is sent to all connected devices. This means that any device connected to the switch is able to capture all data coming out of it. After launching a successful MAC flooding attack, a malicious user can use a packet analyzer to capture sensitive data being transmitted between computers. This wouldn't be possible were the switch operating normally. Now, let's look at switch spoofing. As we've already discussed, VLANs are used in most organizations to segregate data. Basically, a single network can be broken into smaller chucks using VLAN segmentation. While this is a good practice, it can potentially lead to problems if not done correctly. An attacker could use a less secure segment to access a more secure one. We often configure switches to host multiple VLANs so that end devices that are connected to the right VLAN can communicate with other devices on their individual segment. Switches eventually do need to communicate with other switches, though. To do this, the switches must be able to transfer information across all VLANs. Someone needs to configure a port as a trunk port, which is then connected to the receiving switch's trunk port. By default, trunk ports have access to all VLANs and pass traffic for multiple VLANs across the same physical link. The attacker takes advantage of this by using Dynamic Trunking Protocol messages, or DTP messages, to spoof itself as a switch. After they accomplish this, the attacker is able to capture all data for all the attached VLANs. One way to prevent a switch spoofing attack is for you to turn off trunking on all ports except the ones that require it. In addition, you should disable DTP on ports that do require trunking, and manually enable the trunking yourself. The last switch security issue we'll discuss is known as ARP poisoning. Address Resolution Protocol, or ARP, associates a device's MAC address with the IP address assigned to it. To aid in this process, an ARP table is created and stored in a switch's memory for easy lookup. Knowing this, attackers send commands to the switch to overwrite the switch's ARP table contents by replacing a good, known MAC address with the attacker's device's MAC address. As a result, data that was intended for the legitimate device is now sent to the attacker's device. In many cases, the attacker captures the data and sends it on to its rightful owner. This is known as an on-path attack. ARP poisoning attacks are difficult to mitigate. If an attacker has access to the internal network, there's little an administrator can do. Specialized training might be a good idea to help you avoid this type of attack. When you work over the internet, you should try to use virtual private networks, or VPNs. VPNs use an encrypted tunnel that largely blocks your activity from ARP spoofing. That's it for this lesson. This lesson introduced many features we have available on modern switches. We discussed how a switch works, how you can aggregate switches, and the differences between a layer 2 and a layer 3 switch. We ended this lesson by discussing three potential security concerns, which are MAC flooding, switch spoofing, and ARP poisoning.",
  "chunks": [
    {
      "chunk_id": "5.9.1_chunk_1",
      "content": "In this lesson, I'm going to discuss switches and some of their features. This isn't meant to be an exhaustive discussion of switch configurations. Instead, I'll cover topics that can affect your network security. As you probably already know, a switch is a connectivity device that provides communication between different network devices. Switches often use a wired communication medium such as twisted pair and fiber optic to carry the signaling to and from their connected devices. Switches are full-duplex discretionary interconnects that send information only to the intended recipient. I'll explain all of this further in this lesson.",
      "summary": "This lesson focuses on the role of switches in network security, highlighting their function as connectivity devices that facilitate communication between network devices using wired mediums like twisted pair and fiber optic cables. It emphasizes the importance of understanding switch features, such as full-duplex communication and targeted information delivery, which can significantly impact network security. The discussion aims to provide practical insights into how switch configurations can influence overall network protection.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Switch Features",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_2",
      "content": "First, let's talk about how a switch works. Every device that connects to a network, whether wired or wireless, has a unique identifier called a Media Access Control address, or MAC address. The MAC address is a 48-bit number separated into six 2-byte numbers. The first 24 bits represent the device manufacturer. In this example, 18-66-DA represents Dell, Inc. The last 24 bits are a random sequential number assigned by the manufacturer to ensure that each device has a unique MAC address. When referencing the OSI model, a MAC address is a layer 2 address and the data that traverses the wire is called a frame. The switch keeps track of the MAC address to which it's connected. Inside every switch is a table of MAC addresses and the port the device is plugged into. This is called the MAC address table. As data traverses the switch, it builds this table based on the frames passing through it. This process continues until all devices connected to the switch are accounted for and the MAC address table is complete. When the MAC address table is complete, the switch can send data directly to the appropriate end device since the table defines which port each device is connected to. It's also important to know that switches are full-duplex devices. This means they can send and receive data simultaneously. This, along with the data separation by port, means that the chance of an Ethernet collision happening is reduced significantly and speed and efficiency are increased.",
      "summary": "A switch operates by using unique Media Access Control (MAC) addresses to identify devices on a network, maintaining a MAC address table that maps each address to its corresponding port. This enables the switch to efficiently direct data frames to the appropriate devices, minimizing collisions and enhancing network speed due to its full-duplex capability. Understanding how switches function is crucial for effective network management and security in a cybersecurity context.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "How a Switch Works",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_3",
      "content": "Switches are classified as being either unmanaged or managed. An unmanaged switch is often found in homes and small office networks and provides the ability to connect all your devices. Unmanaged switches, on the other hand, aren't configurable. This is just fine for smaller networks that really don't have a need for much sophistication. But larger networks do need additional capabilities. This is where you'll require a managed switch. Managed switches usually have a web-based or command line interface that lets you configure how the switch functions. For example, a switch's configuration tools let you create and manage virtual LANs, or VLANs. VLANs segment data into different zones. This segmentation might be required for such things as voice, surveillance, and storage. Or it could simply separate zone data for additional resiliency and privacy. Managed switches also support link aggregation, which provides the ability to combine multiple switch ports in parallel to increase total available bandwidth. This is often used when connecting to devices with multiple NICs that provide things like file and storage services. You can also configure a switch for port security. This lets you define things like which devices and how many can be attached to a single port. A managed switch has many additional benefits that go beyond the scope of this course. But the basic takeaway here is most organizations use managed switches since they can be configured and provide better security.",
      "summary": "Switches are categorized as unmanaged or managed, with unmanaged switches being simple, non-configurable devices suitable for small networks. In contrast, managed switches offer advanced features such as configuration options for virtual LANs (VLANs), link aggregation for increased bandwidth, and port security to control device connections, making them essential for larger networks that require enhanced security and functionality. Most organizations prefer managed switches due to their configurability and superior security capabilities.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Unmanaged vs. Managed Switches",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_4",
      "content": "Another related topic is switch aggregation. Let's look at that a little closer. Often, when you create a switching solution, it's necessary to employ multiple switches throughout a building. There are several reasons for this. The most prevalent is the need to have close proximity to end devices. Ethernet specifications provide for a maximum length of 100 meters between a switch and an endpoint, assuming there are no breaks in the connection such as a wall plate or patch panel. Often, we place wiring closets throughout a building so the 100-meter limit isn't violated. Normally, an access level switch is placed in the wiring closet to connect a system that's configured for VLANs, port security, and voice over IP. Depending on the number of connections you're dealing with, you might deploy multiple switches for this purpose. These switches are then connected to an upstream switch. The upstream switch is usually much faster and more efficient. Often, the connections between the upstream switch and the access switches are fiber optic, which doesn't have the same distance limitations as a twisted pair of Ethernet cables. In addition, fiber-optic connections are much faster than twisted-pair Ethernet connections.",
      "summary": "Switch aggregation involves the use of multiple switches within a building to maintain optimal connectivity to end devices, adhering to Ethernet's 100-meter distance limitation. Access switches are typically deployed in wiring closets to support configurations like VLANs, port security, and VoIP, while they connect to a faster upstream switch, often via fiber optic cables that overcome distance constraints and offer higher speeds. This setup enhances network performance and scalability in complex environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Switch Aggregation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_5",
      "content": "When you make your decision on the type of switch to purchase, you'll have to choose between a layer 2 and layer 3 switch. While you use both switches to connect end devices to a network, they each have different features. For example, as the name implies, a layer 2 switch operates at the second layer of the OSI model, which is the Data Link layer. This means the switch understands the connected end devices' physical or MAC addresses. At this level, data passing through switches are known as frames. The port used to send data to an end device is determined by that device's MAC address. A layer 3 switch operates at the third layer of the OSI model, which is the Network layer. These types of switches can perform the same functions as layer 2 switches. But in addition, a layer 3 switch is aware of the end device's IP address. At the Network layer, the data passing through the switch is known as a packet. A layer 3 switch is also capable of limited IP routing, meaning that layer 3 routers are often used to route packets to and from different VLANs. In practice, Layer 3 switches aren't intended for connecting end devices. Instead, we typically use them for upstream switches.",
      "summary": "Layer 2 switches operate at the Data Link layer of the OSI model, utilizing MAC addresses to manage data frames between connected devices. In contrast, Layer 3 switches function at the Network layer, recognizing IP addresses and capable of limited IP routing, making them suitable for inter-VLAN communication. While both types of switches connect devices, Layer 3 switches are primarily used for upstream connections rather than directly connecting end devices.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Layer 2 vs. Layer 3",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_6",
      "content": "Now that you understand the basic functions of a switch, let's discuss switch security. Just like any network device, threat actors try to exploit any weakness they can. Switches are no exception. Attackers can use a variety of techniques to compromise switches to gain access to a system. As such, it's important for system administrators to take precautions and disable switch functions that aren't in use and to monitor switch activity. Three security issues to look out for are MAC flooding, switch spoofing, and ARP poisoning. Let's look at each.",
      "summary": "Switch security is crucial as attackers can exploit vulnerabilities in network switches to gain unauthorized access. Key security issues include MAC flooding, switch spoofing, and ARP poisoning, which can compromise network integrity. System administrators should disable unused switch functions and actively monitor switch activity to mitigate these risks.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Switch Security Issues",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_7",
      "content": "We went over how a switch maintains a table of MAC addresses and the ports to which they're connected. A switch maintains enough memory to store that data and not much more. Knowing this, an attacker might try to flood the switch with bogus MAC addresses. This pushes the legitimate MAC address out and fills up the switch's memory. In effect, this breaks the switch. When the memory is full, the switch reverts to an open state where data is sent to all connected devices. This means that any device connected to the switch is able to capture all data coming out of it. After launching a successful MAC flooding attack, a malicious user can use a packet analyzer to capture sensitive data being transmitted between computers. This wouldn't be possible were the switch operating normally.",
      "summary": "MAC flooding is a technique used by attackers to overwhelm a network switch by flooding it with fake MAC addresses, which fills its memory and forces it into a fail-open state. This allows all data traffic to be broadcasted to every device connected to the switch, enabling the attacker to capture sensitive information using a packet analyzer. Understanding this vulnerability highlights the importance of implementing security measures, such as port security and VLANs, to protect against such attacks.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "MAC Flooding",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_8",
      "content": "Now, let's look at switch spoofing. As we've already discussed, VLANs are used in most organizations to segregate data. Basically, a single network can be broken into smaller chucks using VLAN segmentation. While this is a good practice, it can potentially lead to problems if not done correctly. An attacker could use a less secure segment to access a more secure one. We often configure switches to host multiple VLANs so that end devices that are connected to the right VLAN can communicate with other devices on their individual segment. Switches eventually do need to communicate with other switches, though. To do this, the switches must be able to transfer information across all VLANs. Someone needs to configure a port as a trunk port, which is then connected to the receiving switch's trunk port. By default, trunk ports have access to all VLANs and pass traffic for multiple VLANs across the same physical link. The attacker takes advantage of this by using Dynamic Trunking Protocol messages, or DTP messages, to spoof itself as a switch. After they accomplish this, the attacker is able to capture all data for all the attached VLANs. One way to prevent a switch spoofing attack is for you to turn off trunking on all ports except the ones that require it. In addition, you should disable DTP on ports that do require trunking, and manually enable the trunking yourself.",
      "summary": "Switch spoofing is a security vulnerability that arises when attackers exploit VLAN configurations to gain unauthorized access to more secure network segments by impersonating switches using Dynamic Trunking Protocol (DTP) messages. To mitigate this risk, it is essential to disable trunking on all unnecessary ports and manually configure trunking on required ports while also disabling DTP. Proper VLAN segmentation and switch configuration are critical for maintaining network security and preventing data breaches.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Switch Spoofing",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_9",
      "content": "The last switch security issue we'll discuss is known as ARP poisoning. Address Resolution Protocol, or ARP, associates a device's MAC address with the IP address assigned to it. To aid in this process, an ARP table is created and stored in a switch's memory for easy lookup. Knowing this, attackers send commands to the switch to overwrite the switch's ARP table contents by replacing a good, known MAC address with the attacker's device's MAC address. As a result, data that was intended for the legitimate device is now sent to the attacker's device. In many cases, the attacker captures the data and sends it on to its rightful owner. This is known as an on-path attack. ARP poisoning attacks are difficult to mitigate. If an attacker has access to the internal network, there's little an administrator can do. Specialized training might be a good idea to help you avoid this type of attack. When you work over the internet, you should try to use virtual private networks, or VPNs. VPNs use an encrypted tunnel that largely blocks your activity from ARP spoofing.",
      "summary": "ARP poisoning is a security vulnerability where attackers manipulate a switch's ARP table to redirect data intended for a legitimate device to their own device, facilitating an on-path attack. This type of attack is challenging to mitigate, especially within internal networks, highlighting the importance of specialized training for network administrators. To protect against ARP spoofing, using virtual private networks (VPNs) is recommended, as they create encrypted tunnels that shield user activity from such threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "ARP Poisoning",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.1_chunk_10",
      "content": "That's it for this lesson. This lesson introduced many features we have available on modern switches. We discussed how a switch works, how you can aggregate switches, and the differences between a layer 2 and a layer 3 switch. We ended this lesson by discussing three potential security concerns, which are MAC flooding, switch spoofing, and ARP poisoning.",
      "summary": "This lesson covered the functionalities of modern switches, including the operation and aggregation of switches, as well as the distinctions between layer 2 and layer 3 switches. Key security concerns addressed include MAC flooding, switch spoofing, and ARP poisoning, highlighting the importance of understanding these vulnerabilities for effective network security management. Practical applications involve implementing security measures to mitigate these risks in network environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.1",
        "title": "Switch Features",
        "content_type": "video",
        "filename": "5.9.1_Switch_Features_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.1_Switch_Features_[video].txt",
        "word_count": 1979,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 10
}