{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.9.2",
    "title": "Securing Network Switches",
    "content_type": "video",
    "filename": "5.9.2_Securing_Network_Switches_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
    "word_count": 1473,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this lesson, I'll discuss several of the best practices you can implement to help secure your network switches. I'll also cover additional topics that further lock down a switch and add additional controls to make it more secure and less susceptible to an attack. These topics include port security, DHCP snooping, and dynamic ARP inspection. The first best practice in securing a switch is to change the switch's default credentials. When doing so, choose a username that's not too easy to guess and a complex password using lower and uppercase characters, numbers, and non-alphanumeric symbols. You should enable secure shell, or SSH, for remote access and also disable telnet. Telnet uses cleartext for usernames and passwords, which isn't good. When it comes to securing a switch, Simple Network Management Protocol, or SNMP, is a powerful ally when you configure it correctly. When it's left unconfigured, though, it presents a security vulnerability that can simply be avoided by disabling it. In the unlikely event there are switch ports left open with no connection, ensure those ports are disabled to prevent unwanted connections. In addition, you should add a warning banner that states that unauthorized switch configuration access is prohibited. The last best practice is to enable logging. This allows administrators to see any major or minor events a switch experiences. You can also use a logging server to store, archive, and consolidate logging for the enterprise. Now, let's shift gears to port security. It's up to the switch manufacturer to define how switch security is implemented and the command syntax that's used for setup and configuration. But you can use port security as more granular approach to switch security. Port security configurations can limit the number of devices allowed per port, limit hardware address connections, and define what happens when the port experiences a violation of these settings. For example, you could set it to shut down after a breach. An important note here is that on many switches, port security can't be configured on trunk, EtherChannel, or port analyzer ports. Since organizations face constant battles with finding open switch connections in a growing workforce, one solution is to add an intermediate switch. In this case, a small switch is placed in a small office that allows several connections, and then that switch is connected to the upstream switch. If the number of devices is limited on the upstream switch and set to one, only the first device that tries to connect is allowed a connection. When the second device tries to connect, the switch denies the connection and the second device won't connect to the network You can also configure switch ports to only accept connections from specific MAC addresses. For example, let's configure port 1 for the MAC address ending in BA, and port 2 for the MAC address ending in 45. Assuming the devices connected to those ports match the required MAC address, they're allowed to connect. While this is a good defense, it's difficult to maintain and very simple to defeat if one device is swapped out for another. The port for that device will need to be reconfigured if a new computer is bought or the network card is changed. Likewise, it's very easy to spoof a MAC address on a given system, rendering MAC address security ineffective. When a port security rule violation occurs, the switch may react differently depending on its configuration. This might be implemented differently by different switch manufacturers, but the actions are usually closely related. For the least restrictive action, the port simply drops frames from the offending device. The port or interface remains operational and nothing is reported in the logs. Another setting tells the switch to not only drop the frame but send an alert and log the offending operation. The third, most restrictive violation disables the port when a violation is detected. This requires intervention to re-enable the port and is the default violation mode. There are several additional measures you can take to protect network switches. Many are common sense precautions, such as physical security and the best practices listed earlier in this lesson. Let's discuss two additional security configurations you might consider. First, is DHCP snooping. DHCP, as a service, dynamically distributes network parameters, such as IP addresses and default gateways to network devices. For example, when you first start a workstation, it automatically requests and receives the IP information from a DHCP server. In this type of environment, the DHCP server is known as a trusted device, in the same way that routers, firewalls, and file servers are trusted. A trusted device simply means that it's managed by an administrator in your company. Since most organizations use DHCP for dynamic IP address allocation, attackers often try to place a rogue DHCP server on the network in an attempt to provide end devices with forged IP address information to introduce vulnerabilities onto the network. DHCP snooping attempts to prevent this from occurring. But for DHCP snooping to work, it must be enabled on your devices. While the actual configuration for DHCP snooping is beyond the scope of this lesson, it's important to learn which process to use to enable and configure DHCP snooping in your infrastructure. Know that the configuration process will vary by manufacturer. Once configured, the DHCP snooping process detects, blocks, and drops DHCP packets when the DHCP information comes from an untrusted source. This information is also logged so further actions can be taken to locate and eradicate the rouge DHCP server. Another security feature available on many switches is called dynamic ARP inspection. This feature rejects invalid or malicious ARP packets, which can help prevent on-path attacks. An on-path attack is when an attacker secretly relays or alters the communication between two parties who believe they're directly communicating with each other. So how does an attacker implement a on-path attack? In normal operations, ARP tables are used to identify end devices. Once identified, communications can flow between the devices. So an attacker assumes the identity of both endpoints and inserts themself in the middle of the communication. Let's see how that works. First, they poison the ARP cache of end device B and tell B that he or she is A. Then they tell A that he or she is B. Once completed, the original connection between A and B is replaced with A sending information to M and M forwarding the information to B, and vice versa. At this point, M sees all the communication traffic between A and B. He or she can log the information or change it depending on the intent. Adding dynamic ARP inspection can help to prevent this type of attack. To do this, first configure DHCP snooping on your switch as we just discussed. Next, you need to enable dynamic ARP inspection, or DAI. Once DAI is enabled and configured, only trusted sources can affect the ARP table. So now the switch drops the ARP packet when an untrusted source, in this case the attacker, tries to poison the ARP table. That's because the sender's MAC address and sender's IP address don't match an entry in the DHCP snooping database. That's it for this lesson. In this lesson, we discussed several best practices to ensure switch security. Next, we talked about how port security can be used to prevent unauthorized access to a network. We also discussed how you can use DHCP snooping in conjunction with dynamic ARP inspection to thwart rogue DHCP servers.",
  "chunks": [
    {
      "chunk_id": "5.9.2_chunk_1",
      "content": "In this lesson, I'll discuss several of the best practices you can implement to help secure your network switches. I'll also cover additional topics that further lock down a switch and add additional controls to make it more secure and less susceptible to an attack. These topics include port security, DHCP snooping, and dynamic ARP inspection.",
      "summary": "This lesson focuses on best practices for securing network switches, emphasizing techniques such as port security, DHCP snooping, and dynamic ARP inspection. These measures enhance switch security by controlling access and mitigating potential attacks, ensuring a more robust network infrastructure. Implementing these strategies is crucial for protecting sensitive data and maintaining network integrity.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Secure Network Switches",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_2",
      "content": "The first best practice in securing a switch is to change the switch's default credentials. When doing so, choose a username that's not too easy to guess and a complex password using lower and uppercase characters, numbers, and non-alphanumeric symbols. You should enable secure shell, or SSH, for remote access and also disable telnet. Telnet uses cleartext for usernames and passwords, which isn't good. When it comes to securing a switch, Simple Network Management Protocol, or SNMP, is a powerful ally when you configure it correctly. When it's left unconfigured, though, it presents a security vulnerability that can simply be avoided by disabling it. In the unlikely event there are switch ports left open with no connection, ensure those ports are disabled to prevent unwanted connections. In addition, you should add a warning banner that states that unauthorized switch configuration access is prohibited. The last best practice is to enable logging. This allows administrators to see any major or minor events a switch experiences. You can also use a logging server to store, archive, and consolidate logging for the enterprise.",
      "summary": "To secure a switch, it's essential to change default credentials to a complex username and password, enable SSH for secure remote access, and disable telnet to protect against cleartext vulnerabilities. Proper configuration of SNMP is crucial, and any unused switch ports should be disabled to prevent unauthorized access. Additionally, implementing a warning banner and enabling logging will help monitor switch activity and enhance overall security management.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Best Practices",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_3",
      "content": "Now, let's shift gears to port security. It's up to the switch manufacturer to define how switch security is implemented and the command syntax that's used for setup and configuration. But you can use port security as more granular approach to switch security. Port security configurations can limit the number of devices allowed per port, limit hardware address connections, and define what happens when the port experiences a violation of these settings. For example, you could set it to shut down after a breach. An important note here is that on many switches, port security can't be configured on trunk, EtherChannel, or port analyzer ports.",
      "summary": "Port security is a critical aspect of switch security that allows for granular control over device connections by limiting the number of devices per port and defining responses to violations, such as shutting down the port. The implementation and configuration syntax for port security are determined by the switch manufacturer, and it is important to note that port security cannot be applied to trunk, EtherChannel, or port analyzer ports. This feature enhances network security by preventing unauthorized access and ensuring only designated devices can connect.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Port Security",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_4",
      "content": "Since organizations face constant battles with finding open switch connections in a growing workforce, one solution is to add an intermediate switch. In this case, a small switch is placed in a small office that allows several connections, and then that switch is connected to the upstream switch. If the number of devices is limited on the upstream switch and set to one, only the first device that tries to connect is allowed a connection. When the second device tries to connect, the switch denies the connection and the second device won't connect to the network",
      "summary": "Limiting devices per port is a security measure that helps organizations manage network access by restricting the number of devices that can connect to a switch. By implementing an intermediate switch in smaller offices and configuring the upstream switch to allow only one connection, any additional devices attempting to connect are denied access. This approach enhances network security by preventing unauthorized devices from joining the network.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Limit Devices per Port",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_5",
      "content": "You can also configure switch ports to only accept connections from specific MAC addresses. For example, let's configure port 1 for the MAC address ending in BA, and port 2 for the MAC address ending in 45. Assuming the devices connected to those ports match the required MAC address, they're allowed to connect. While this is a good defense, it's difficult to maintain and very simple to defeat if one device is swapped out for another. The port for that device will need to be reconfigured if a new computer is bought or the network card is changed. Likewise, it's very easy to spoof a MAC address on a given system, rendering MAC address security ineffective.",
      "summary": "Configuring switch ports to accept only specific MAC addresses enhances network security by restricting access to authorized devices. However, this method poses challenges in maintenance and is vulnerable to MAC address spoofing, making it less effective against determined attackers. Consequently, while MAC address filtering can be a useful security measure, it should be supplemented with additional security practices for robust protection.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Secure with MAC address",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_6",
      "content": "When a port security rule violation occurs, the switch may react differently depending on its configuration. This might be implemented differently by different switch manufacturers, but the actions are usually closely related. For the least restrictive action, the port simply drops frames from the offending device. The port or interface remains operational and nothing is reported in the logs. Another setting tells the switch to not only drop the frame but send an alert and log the offending operation. The third, most restrictive violation disables the port when a violation is detected. This requires intervention to re-enable the port and is the default violation mode.",
      "summary": "Port security violations occur when a device connected to a switch breaches established security rules, prompting various responses based on the switch's configuration. The least restrictive action involves dropping frames from the offending device without logging the incident, while more stringent responses include alerting administrators and logging the violation or completely disabling the port, which requires manual reactivation. Understanding these configurations is crucial for maintaining network security and ensuring prompt responses to potential threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Port Security Violations",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_7",
      "content": "There are several additional measures you can take to protect network switches. Many are common sense precautions, such as physical security and the best practices listed earlier in this lesson. Let's discuss two additional security configurations you might consider.",
      "summary": "The \"Additional Security Concerns\" section emphasizes the importance of enhancing network switch protection through practical measures, including physical security and adherence to established best practices. It highlights the necessity of implementing specific security configurations to further safeguard network infrastructure. These strategies aim to mitigate risks and bolster overall network security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Additional Security Concerns",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_8",
      "content": "First, is DHCP snooping. DHCP, as a service, dynamically distributes network parameters, such as IP addresses and default gateways to network devices. For example, when you first start a workstation, it automatically requests and receives the IP information from a DHCP server. In this type of environment, the DHCP server is known as a trusted device, in the same way that routers, firewalls, and file servers are trusted. A trusted device simply means that it's managed by an administrator in your company. Since most organizations use DHCP for dynamic IP address allocation, attackers often try to place a rogue DHCP server on the network in an attempt to provide end devices with forged IP address information to introduce vulnerabilities onto the network. DHCP snooping attempts to prevent this from occurring. But for DHCP snooping to work, it must be enabled on your devices. While the actual configuration for DHCP snooping is beyond the scope of this lesson, it's important to learn which process to use to enable and configure DHCP snooping in your infrastructure. Know that the configuration process will vary by manufacturer. Once configured, the DHCP snooping process detects, blocks, and drops DHCP packets when the DHCP information comes from an untrusted source. This information is also logged so further actions can be taken to locate and eradicate the rouge DHCP server.",
      "summary": "DHCP snooping is a security feature that protects networks by preventing rogue DHCP servers from distributing fraudulent IP address information to devices. It designates trusted devices, such as managed DHCP servers, and blocks DHCP packets from untrusted sources, thereby mitigating potential vulnerabilities. Proper configuration of DHCP snooping is essential and varies by device manufacturer, with logging capabilities to aid in identifying and addressing threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "DHCP Snooping",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_9",
      "content": "Another security feature available on many switches is called dynamic ARP inspection. This feature rejects invalid or malicious ARP packets, which can help prevent on-path attacks. An on-path attack is when an attacker secretly relays or alters the communication between two parties who believe they're directly communicating with each other. So how does an attacker implement a on-path attack? In normal operations, ARP tables are used to identify end devices. Once identified, communications can flow between the devices. So an attacker assumes the identity of both endpoints and inserts themself in the middle of the communication. Let's see how that works. First, they poison the ARP cache of end device B and tell B that he or she is A. Then they tell A that he or she is B. Once completed, the original connection between A and B is replaced with A sending information to M and M forwarding the information to B, and vice versa. At this point, M sees all the communication traffic between A and B. He or she can log the information or change it depending on the intent. Adding dynamic ARP inspection can help to prevent this type of attack. To do this, first configure DHCP snooping on your switch as we just discussed. Next, you need to enable dynamic ARP inspection, or DAI. Once DAI is enabled and configured, only trusted sources can affect the ARP table. So now the switch drops the ARP packet when an untrusted source, in this case the attacker, tries to poison the ARP table. That's because the sender's MAC address and sender's IP address don't match an entry in the DHCP snooping database.",
      "summary": "Dynamic ARP Inspection (DAI) is a security feature on switches that prevents on-path attacks by rejecting invalid ARP packets, thereby protecting the integrity of communications between devices. Attackers typically exploit ARP tables to impersonate endpoints and intercept traffic, but DAI mitigates this risk by ensuring that only trusted sources can modify the ARP table, based on a DHCP snooping database. By implementing DAI, organizations can enhance their network security and safeguard sensitive communications from interception and manipulation.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Dynamic ARP Inspection",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.2_chunk_10",
      "content": "That's it for this lesson. In this lesson, we discussed several best practices to ensure switch security. Next, we talked about how port security can be used to prevent unauthorized access to a network. We also discussed how you can use DHCP snooping in conjunction with dynamic ARP inspection to thwart rogue DHCP servers.",
      "summary": "This lesson covers essential best practices for securing network switches, emphasizing the importance of port security to prevent unauthorized access. It also highlights the use of DHCP snooping and dynamic ARP inspection as effective measures to protect against rogue DHCP servers, enhancing overall network security. These concepts are crucial for maintaining a secure and reliable network infrastructure.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.2",
        "title": "Securing Network Switches",
        "content_type": "video",
        "filename": "5.9.2_Securing_Network_Switches_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.2_Securing_Network_Switches_[video].txt",
        "word_count": 1473,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 10
}