{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.9.6",
    "title": "Hardening a Switch",
    "content_type": "video",
    "filename": "5.9.6_Hardening_a_Switch_[video].txt",
    "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
    "word_count": 2203,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demonstration we'll look at various methods to harden a managed switch. In this case we're using a Cisco Small Business Managed Switch and are logged into the management interface using Internet Explorer. We're authenticated as the Admin User so we can make changes. In this demonstration we'll look at port security, management access, and access control using access control lists, ACLs. To begin, let's look at port security. When hardening a switch, one of the first things we want to do is shut down any unused ports. Click on Configure Port Settings, which will take us directly to the Port Settings page under Port Management. On this page we can select one of the unused ports. You'll notice we have several ports here that are either down and unused, or up and used. The ones that are unused are currently down. We want to make sure they're administratively down, meaning they have to be turned on before they can be used. Let's take a look at Port Two. It's down. Let's scroll to the bottom of the page and click Edit. On this page you'll notice that the Administrative Status of this port is actually up, even though it's operationally down. This means there's nothing plugged into it. To make sure that this port remains down and is not used without permission, we'll set the Administrative Status as Down. Click Apply, Close. To set all other unused ports as Administratively Down, we'll select Port Two then click Copy Settings. In the Copy Settings window we can list all the ports that we want to be down. In this case, we'll type Three, Six, and Eight through 28. Go ahead and click Apply. All of those ports are now administratively down. Let's look at Port Three for confirmation. Select Port Three and click Edit. You'll notice on this page that the status Administratively Down. So, the status that we copied from Port Two went to the rest of the ports. Click Close. By setting the ports that we're not using to Administratively Down, those ports will come up at a down state each time the switch starts up. At the end we'll make sure that we save our Configuration File to the Startup Configuration. Next, we also want to enable port security. To do that, we'll open the Security Tab and click on Port Security. Under this tab we can configure locking mechanism for each of these ports. We'll click on Port One and select Edit. On this page you'll notice that we can lock the port, meaning we're going to only allow certain MAC addresses to pass traffic through this port. A Classic Lock means that the first device you connect to that port will be remembered and allowed to pass traffic through this port. You can also select Limited Dynamic Lock, which gives you a variable number from one to 256. Let's change this to four. Now, if you connect a hub to a specific port on the switch and connect four devices to that, you can allow all four of those devices to talk through that port. No additional devices would be allowed to pass traffic. We'll go ahead and select the Classic Lock. That will give us one device, and the device will be locked in. If you try to connect a device that is not supposed to be on that port, the Action on Violation determines what happens. The default is to discard the packet. If you connect any other device to the port, the traffic will be ignored. You can also forward the traffic, or you can shut down the port. That's a little drastic for our purposes. However, if you're extremely cautious about your security and you don't want anybody connecting a device you don't know about, being able to shut down the port is one of the most secure things that you can do. We'll go ahead and select Discard if it's a device that we aren't sure about. If somebody plugs in a device that's not locked in you can also trap the MAC addresses of the offending device. We've enabled locking for Port One, as well as the classic lock. We're going to discard the frames of any other devices that come onto that port. We'll go ahead and click Apply, Close. Once again, we can take the settings that we've created for Port One and apply them to the rest of the ports. Scroll down to the bottom and select Copy Settings. In this case, we'll select all of the ports, or Two through 28, and click Apply. You'll see that the settings that we've created for port security now apply to all 28 ports. The next piece that we would like to cover is management access. We'll go to Management Access Method and click Access Profiles. In this case, the only profile that's on the machine is the Console Profile, which is the default. We're going to add a new access profile, so click Add. We'll call this access profile Management. In this Management Profile the very first rule, or Rule One that we want to have will deny all management. We'll go ahead and select Deny and specify all different management methods, and apply it to all interfaces. That will be our first and main rule. We'll go ahead and click Apply, Close. Now that we've created our Management Profile, we can select Profile Rules. It can seem a little confusing that you create a Management Profile then add a rule to it. We'll go ahead and select our Management Profile, and add another rule. It looks very similar to the page we just used. For Rule Number Two, we want to allow HTTP access. We want to select all interfaces, but we also only want to allow traffic from a specific workstation or IP address. We'll specify that 192.168.1.200 will be the only workstation allowed to access this port. We'll also input the network mask by typing 255.255.255.0. Alternatively, we can use the prefix length and use the prefix instead. We'll go ahead and click Apply, Close. We now have a management access rule that denies all traffic, and one access rule which allows us to access the HTTP interface from one specific workstation. But, we're not done yet. We need to go back to Access Profiles and set the Active Profile. Right now, we don't have an active management profile. Go ahead and select Management. This denies all types of management interfaces with this switch, except for the HTTP access from the one workstation that we have selected. We're not going to click Apply this time. If we do, we'll probably be locked out of the switch, and we want to make sure that we have access to complete this demo. Let's go to the next section, and look at firmware updates. Under Administration, File Management we can select Upgrade, Backup Firmware. Part of hardening the device or a computer of any kind is to make sure you have the latest software and patches. You can use browse to select the latest firmware and download it. In this particular switch, you have to select the Active Image once you've loaded the firmware. You can select Image One or the new image, Image Two, and apply it. Next you'll need to reboot the switch. Once you do that the switch will come back with the latest and greatest software and the best enhancements. This allows you to have the best possible security for this switch. Upgrading firmware for the switch as well as applying patches to any computer is a key element to hardening the switch. The last aspect of hardening the switch is access control using the ACLs. Let's select Access Control. On this switch, we have various methods of access control. We can use a MAC based ACL. We can use an IPV4 based ACL. And we can also use an IPV6 based ACL. We'll set up a MAC based ACL. In this case, we don't have an access control list, so we'll go ahead and create one. We want to make sure that nobody can attach game consoles or connect any game to our switch. Type Games as the name of our ACL. Click Apply, Close. We have the ACL, but to put access control entries, ACE, into this access control list, we need to click the MAC Based ACE Table. It has a slightly different interface, but let's click Add to add an entry to this page. For our first access control entry, Entry One, we're going to select Deny. We'll select Any for the Destination MAC address. Under Source MAC Address, we're going to select User Defined and put in the address, one of the game consoles, or the prefix of the MAC address, which is used for all devices of the same manufacturer. We'll go ahead and enter 00041F followed by six ones. Under Source MAC Wildcard Mask we'll enter six zeroes followed by six ones. This says that we only care about the first six digits of the MAC Address. This is preventing any device from the same manufacturer from being connected. We'll go ahead and click Apply. That creates our first entry into the Access Control List Entry Table. We'll add one more just for demonstration purposes. We'll go ahead and create Priority Two. Once again, we're going to select Deny, and specify the Destination MAC Address as Any. We're going to specify the Source MAC Address value as 005042 followed by six ones. We'll do the same Source MAC Wildcard Mask, or six zeroes followed by six ones. Click Apply, Close to create our access control entries. We could add more for any of the game console types that are out there, or any other device that we want to prohibit from using our network. We can also add anything we want to allow on the network. Now that we've created the MAC Based ACL Table, and have created the entries in that table, we need to make sure that the ports have a binding to that table. We'll go ahead and click on ACL Binding. Select Port One, scroll down, and click Edit. We want to apply this MAC based ACL, so we'll select that and then select Games, which we just created. If there were additional ones, we could choose from them as well. We'll go ahead and click Apply, Close. Just as we've done in the previous portions of this demonstration, we'll select Port One. The GE One interface, and click on Copy Settings. We'll enter two through 28 and click Apply. That gave us a successful binding of the Games ACL to all of the ports in our interface. One final thing that you will always want to do when you've made configuration changes to your switch is to save the Running Configuration to the Startup Configuration. On this switch, simply click Save at the top. It will blink when there have been changes. Select Running Configuration as the Source File Name. And set the Destination File Name as Startup Configuration, then click Apply. In this demonstration we've examined the idea of port security. We've looked at management access to our switch. And we've also looked at restricting certain traffic to the switch using ACLs.",
  "chunks": [
    {
      "chunk_id": "5.9.6_chunk_1",
      "content": "In this demonstration we'll look at various methods to harden a managed switch. In this case we're using a Cisco Small Business Managed Switch and are logged into the management interface using Internet Explorer. We're authenticated as the Admin User so we can make changes. In this demonstration we'll look at port security, management access, and access control using access control lists, ACLs.",
      "summary": "This section covers the hardening of a managed switch, specifically using a Cisco Small Business Managed Switch. Key topics include implementing port security, managing access controls, and utilizing access control lists (ACLs) to enhance security. Practical applications focus on configuring these settings through the management interface to protect the network from unauthorized access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Hardening a Switch",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_2",
      "content": "To begin, let's look at port security. When hardening a switch, one of the first things we want to do is shut down any unused ports. Click on Configure Port Settings, which will take us directly to the Port Settings page under Port Management. On this page we can select one of the unused ports. You'll notice we have several ports here that are either down and unused, or up and used. The ones that are unused are currently down. We want to make sure they're administratively down, meaning they have to be turned on before they can be used. Let's take a look at Port Two. It's down. Let's scroll to the bottom of the page and click Edit. On this page you'll notice that the Administrative Status of this port is actually up, even though it's operationally down. This means there's nothing plugged into it. To make sure that this port remains down and is not used without permission, we'll set the Administrative Status as Down. Click Apply, Close. To set all other unused ports as Administratively Down, we'll select Port Two then click Copy Settings. In the Copy Settings window we can list all the ports that we want to be down. In this case, we'll type Three, Six, and Eight through 28. Go ahead and click Apply. All of those ports are now administratively down. Let's look at Port Three for confirmation. Select Port Three and click Edit. You'll notice on this page that the status Administratively Down. So, the status that we copied from Port Two went to the rest of the ports. Click Close. By setting the ports that we're not using to Administratively Down, those ports will come up at a down state each time the switch starts up. At the end we'll make sure that we save our Configuration File to the Startup Configuration.",
      "summary": "The \"Configure Port Settings\" section of the CompTIA Security+ course focuses on enhancing switch security by managing port configurations. It emphasizes the importance of shutting down unused ports to prevent unauthorized access, demonstrating how to set ports to an \"Administratively Down\" status to ensure they remain inactive. The practical application includes copying settings across multiple ports and saving the configuration to maintain security during switch restarts.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Configure Port Settings",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_3",
      "content": "Next, we also want to enable port security. To do that, we'll open the Security Tab and click on Port Security. Under this tab we can configure locking mechanism for each of these ports. We'll click on Port One and select Edit. On this page you'll notice that we can lock the port, meaning we're going to only allow certain MAC addresses to pass traffic through this port. A Classic Lock means that the first device you connect to that port will be remembered and allowed to pass traffic through this port. You can also select Limited Dynamic Lock, which gives you a variable number from one to 256. Let's change this to four. Now, if you connect a hub to a specific port on the switch and connect four devices to that, you can allow all four of those devices to talk through that port. No additional devices would be allowed to pass traffic. We'll go ahead and select the Classic Lock. That will give us one device, and the device will be locked in. If you try to connect a device that is not supposed to be on that port, the Action on Violation determines what happens. The default is to discard the packet. If you connect any other device to the port, the traffic will be ignored. You can also forward the traffic, or you can shut down the port. That's a little drastic for our purposes. However, if you're extremely cautious about your security and you don't want anybody connecting a device you don't know about, being able to shut down the port is one of the most secure things that you can do. We'll go ahead and select Discard if it's a device that we aren't sure about. If somebody plugs in a device that's not locked in you can also trap the MAC addresses of the offending device. We've enabled locking for Port One, as well as the classic lock. We're going to discard the frames of any other devices that come onto that port. We'll go ahead and click Apply, Close. Once again, we can take the settings that we've created for Port One and apply them to the rest of the ports. Scroll down to the bottom and select Copy Settings. In this case, we'll select all of the ports, or Two through 28, and click Apply. You'll see that the settings that we've created for port security now apply to all 28 ports.",
      "summary": "In the CompTIA Security+ course, the section on enabling port security emphasizes the importance of controlling network access by configuring locking mechanisms for switch ports. Users can implement Classic Lock, which allows only the first connected device, or Limited Dynamic Lock, permitting a specified number of devices. Additionally, the course covers actions on violation, such as discarding packets from unauthorized devices or shutting down ports for enhanced security, and demonstrates how to apply these settings across multiple ports efficiently.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Enable Port Security",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_4",
      "content": "The next piece that we would like to cover is management access. We'll go to Management Access Method and click Access Profiles. In this case, the only profile that's on the machine is the Console Profile, which is the default. We're going to add a new access profile, so click Add. We'll call this access profile Management. In this Management Profile the very first rule, or Rule One that we want to have will deny all management. We'll go ahead and select Deny and specify all different management methods, and apply it to all interfaces. That will be our first and main rule. We'll go ahead and click Apply, Close. Now that we've created our Management Profile, we can select Profile Rules. It can seem a little confusing that you create a Management Profile then add a rule to it. We'll go ahead and select our Management Profile, and add another rule. It looks very similar to the page we just used. For Rule Number Two, we want to allow HTTP access. We want to select all interfaces, but we also only want to allow traffic from a specific workstation or IP address. We'll specify that 192.168.1.200 will be the only workstation allowed to access this port. We'll also input the network mask by typing 255.255.255.0. Alternatively, we can use the prefix length and use the prefix instead. We'll go ahead and click Apply, Close. We now have a management access rule that denies all traffic, and one access rule which allows us to access the HTTP interface from one specific workstation. But, we're not done yet. We need to go back to Access Profiles and set the Active Profile. Right now, we don't have an active management profile. Go ahead and select Management. This denies all types of management interfaces with this switch, except for the HTTP access from the one workstation that we have selected. We're not going to click Apply this time. If we do, we'll probably be locked out of the switch, and we want to make sure that we have access to complete this demo.",
      "summary": "The Management Access section of the CompTIA Security+ course focuses on creating and configuring access profiles to control management access to network devices. It emphasizes the importance of establishing a default deny rule for all management methods while allowing specific access, such as HTTP, from designated IP addresses. This practical application ensures secure management access, preventing unauthorized connections while maintaining necessary administrative capabilities.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Management Access",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_5",
      "content": "Let's go to the next section, and look at firmware updates. Under Administration, File Management we can select Upgrade, Backup Firmware. Part of hardening the device or a computer of any kind is to make sure you have the latest software and patches. You can use browse to select the latest firmware and download it. In this particular switch, you have to select the Active Image once you've loaded the firmware. You can select Image One or the new image, Image Two, and apply it. Next you'll need to reboot the switch. Once you do that the switch will come back with the latest and greatest software and the best enhancements. This allows you to have the best possible security for this switch. Upgrading firmware for the switch as well as applying patches to any computer is a key element to hardening the switch.",
      "summary": "Firmware updates are essential for hardening devices and ensuring optimal security by applying the latest software and patches. The process involves selecting and downloading the latest firmware, choosing the active image, and rebooting the device to implement the updates. Regularly upgrading firmware enhances device performance and security, making it a critical practice in cybersecurity management.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Firmware Updates",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_6",
      "content": "The last aspect of hardening the switch is access control using the ACLs. Let's select Access Control. On this switch, we have various methods of access control. We can use a MAC based ACL. We can use an IPV4 based ACL. And we can also use an IPV6 based ACL. We'll set up a MAC based ACL. In this case, we don't have an access control list, so we'll go ahead and create one. We want to make sure that nobody can attach game consoles or connect any game to our switch. Type Games as the name of our ACL. Click Apply, Close. We have the ACL, but to put access control entries, ACE, into this access control list, we need to click the MAC Based ACE Table. It has a slightly different interface, but let's click Add to add an entry to this page. For our first access control entry, Entry One, we're going to select Deny. We'll select Any for the Destination MAC address. Under Source MAC Address, we're going to select User Defined and put in the address, one of the game consoles, or the prefix of the MAC address, which is used for all devices of the same manufacturer. We'll go ahead and enter 00041F followed by six ones. Under Source MAC Wildcard Mask we'll enter six zeroes followed by six ones. This says that we only care about the first six digits of the MAC Address. This is preventing any device from the same manufacturer from being connected. We'll go ahead and click Apply. That creates our first entry into the Access Control List Entry Table. We'll add one more just for demonstration purposes. We'll go ahead and create Priority Two. Once again, we're going to select Deny, and specify the Destination MAC Address as Any. We're going to specify the Source MAC Address value as 005042 followed by six ones. We'll do the same Source MAC Wildcard Mask, or six zeroes followed by six ones. Click Apply, Close to create our access control entries. We could add more for any of the game console types that are out there, or any other device that we want to prohibit from using our network. We can also add anything we want to allow on the network. Now that we've created the MAC Based ACL Table, and have created the entries in that table, we need to make sure that the ports have a binding to that table. We'll go ahead and click on ACL Binding. Select Port One, scroll down, and click Edit. We want to apply this MAC based ACL, so we'll select that and then select Games, which we just created. If there were additional ones, we could choose from them as well. We'll go ahead and click Apply, Close. Just as we've done in the previous portions of this demonstration, we'll select Port One. The GE One interface, and click on Copy Settings. We'll enter two through 28 and click Apply. That gave us a successful binding of the Games ACL to all of the ports in our interface. One final thing that you will always want to do when you've made configuration changes to your switch is to save the Running Configuration to the Startup Configuration. On this switch, simply click Save at the top. It will blink when there have been changes. Select Running Configuration as the Source File Name. And set the Destination File Name as Startup Configuration, then click Apply.",
      "summary": "This section on Access Control using ACLs focuses on implementing security measures on a switch by creating and managing Access Control Lists (ACLs) to restrict unauthorized devices, such as game consoles, from connecting to the network. It covers the creation of MAC-based ACLs, adding Access Control Entries (ACEs) to specify which devices to deny access, and binding these ACLs to specific switch ports. Finally, it emphasizes the importance of saving configuration changes to ensure that security settings persist after a reboot.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Access Control using ACLs",
      "timestamp_range": ""
    },
    {
      "chunk_id": "5.9.6_chunk_7",
      "content": "In this demonstration we've examined the idea of port security. We've looked at management access to our switch. And we've also looked at restricting certain traffic to the switch using ACLs.",
      "summary": "This demonstration covers the concept of port security, emphasizing the management of access to network switches. It highlights the use of Access Control Lists (ACLs) to restrict specific traffic, enhancing overall network security. Practical applications include configuring switches to prevent unauthorized access and controlling data flow within the network.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.6",
        "title": "Hardening a Switch",
        "content_type": "video",
        "filename": "5.9.6_Hardening_a_Switch_[video].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.6_Hardening_a_Switch_[video].txt",
        "word_count": 2203,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 7
}