{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.2.5",
    "title": "Biometrics and Authentication Technologies",
    "content_type": "video",
    "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
    "word_count": 756,
    "has_content": true
  },
  "full_content": "In this lesson, we'll look at biometrics and some of the other technologies used for multifactor authentication. Remember, authentication is the process of verifying a claimed identity. And to verify an identity, we need a unique piece of information that could only come from one person. Biometric authentication has come a long way. You're probably familiar with fingerprint and retina scans, but did you know that people can also be identified by their iris, facial structure, and even by their gait when they walk? Biometric authentication requires capturing and storing a unique physical attribute in a biometric system. The initial capture is called enrollment. Subsequent authentication attempts are then tested against the stored biometric template. A few key parameters can determine whether an attribute is viable. First, the physical attribute should be universal – something that everyone has. Second, the attribute should be unique. It should be measurable and so distinctive that it can be used to tell people apart. Third, the attribute should be permanent – in other words, it should hold up to aging. For example, a person's face might change considerably over time, but their fingerprint or retina will stay the same. Fourth, the attribute must be collectable. In other words, how easy is it to acquire this measurable attribute? If collecting the measurement is difficult or invasive, it probably won't work. Lastly, the attribute must be difficult to duplicate. For example, if the attribute is the person's voice, it might be possible to evade the system using an audio recording. But if the attribute is the person's retina, then it's much more difficult to circumvent. If errors do occur, they can be labeled as a false positive or a false negative. A false positive occurs when the biometric system returns a positive match and identifies an unauthorized user as a legitimate user. A false negative occurs when the biometric system returns a negative match when a legitimate user tries to authenticate. Now let's look at some other technologies that are used for authentication. You've probably already used a lot of these methods. To provide an extra layer of security for their employees, some organizations use authenticator applications for their remote employees. An authenticator app, typically installed on a smartphone, provides a 6- to 8-digit code. Every 30 seconds, that code changes. The employee enter their username and password along with the code from the authenticator app, providing additional verification that you are who you say you are. A similar method that you may have used is a one-time password. Some banks use this method to allow ATM withdrawals without using a debit card or to let customers access their accounts from the internet. An application or token creates a one-time password. This password will only work for a single login. After that, the password expires. The password also expires if it isn't used withing a short period of time. These one-time passwords can be sent to the users several ways. For example, the one-time password can be sent using the Short Message Service, or SMS. When this option is selected, an SMS message with a one-time code or password is sent to your previously verified phone number. This code can then be used to verify your identify and complete your login. Similarly, if you chose to receive your code through the phone, you'll get a phone call and an automated voice will provide you with a one-time code or password. Push notification authentication can also be used to grant access to an account. For example, when you log in to your account, you'll enter your username, but instead of a password, you receive an access request notification on your mobile device. You can then view the authentication details and approve or deny access, typically with a simple press of a button. One advantage of using this authentication method is that you don't have to remember passwords. However, this method only works with the services provided by a specific company. As a result, there are a limited number of applications that integrate with their services. This makes them unavailable to organizations that use enterprise-level and proprietary solutions. That's it for this lesson. In this lesson, we looked at biometric systems and several other authentication technologies used for multifactor authentication.",
  "chunks": [
    {
      "chunk_id": "4.2.5_chunk_1",
      "content": "In this lesson, we'll look at biometrics and some of the other technologies used for multifactor authentication. Remember, authentication is the process of verifying a claimed identity. And to verify an identity, we need a unique piece of information that could only come from one person.",
      "summary": "This section covers biometrics and advanced authentication methods, emphasizing the importance of multifactor authentication in verifying identities. It highlights the necessity of unique personal information, such as fingerprints or facial recognition, to ensure secure access. Practical applications include enhancing security protocols in various systems by combining biometric data with other authentication factors.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Biometrics and Advanced Authentication",
      "timestamp_range": "00:00-00:20"
    },
    {
      "chunk_id": "4.2.5_chunk_2",
      "content": "Biometric authentication has come a long way. You're probably familiar with fingerprint and retina scans, but did you know that people can also be identified by their iris, facial structure, and even by their gait when they walk? Biometric authentication requires capturing and storing a unique physical attribute in a biometric system. The initial capture is called enrollment. Subsequent authentication attempts are then tested against the stored biometric template. A few key parameters can determine whether an attribute is viable. First, the physical attribute should be universal – something that everyone has. Second, the attribute should be unique. It should be measurable and so distinctive that it can be used to tell people apart. Third, the attribute should be permanent – in other words, it should hold up to aging. For example, a person's face might change considerably over time, but their fingerprint or retina will stay the same. Fourth, the attribute must be collectable. In other words, how easy is it to acquire this measurable attribute? If collecting the measurement is difficult or invasive, it probably won't work. Lastly, the attribute must be difficult to duplicate. For example, if the attribute is the person's voice, it might be possible to evade the system using an audio recording. But if the attribute is the person's retina, then it's much more difficult to circumvent. If errors do occur, they can be labeled as a false positive or a false negative. A false positive occurs when the biometric system returns a positive match and identifies an unauthorized user as a legitimate user. A false negative occurs when the biometric system returns a negative match when a legitimate user tries to authenticate.",
      "summary": "Biometric authentication utilizes unique physical attributes, such as fingerprints, retina scans, and facial structures, to verify identity through a process that begins with enrollment and continues with subsequent authentication attempts. Key criteria for effective biometric attributes include universality, uniqueness, permanence, collectability, and resistance to duplication. Understanding the potential for false positives and false negatives is crucial for evaluating the reliability of biometric systems in security applications.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Biometrics",
      "timestamp_range": "00:20-02:04"
    },
    {
      "chunk_id": "4.2.5_chunk_3",
      "content": "Now let's look at some other technologies that are used for authentication. You've probably already used a lot of these methods.",
      "summary": "The Authentication Technologies section of the CompTIA Security+ course explores various methods used to verify user identities, including passwords, biometrics, and multi-factor authentication. It emphasizes the importance of implementing robust authentication mechanisms to enhance security and protect sensitive information. Practical applications include configuring and managing these technologies in real-world scenarios to mitigate unauthorized access.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Authentication Technologies",
      "timestamp_range": "02:04-02:11"
    },
    {
      "chunk_id": "4.2.5_chunk_4",
      "content": "To provide an extra layer of security for their employees, some organizations use authenticator applications for their remote employees. An authenticator app, typically installed on a smartphone, provides a 6- to 8-digit code. Every 30 seconds, that code changes. The employee enter their username and password along with the code from the authenticator app, providing additional verification that you are who you say you are.",
      "summary": "Authenticator applications enhance security for remote employees by generating a time-sensitive 6- to 8-digit code that changes every 30 seconds. When logging in, users must enter their username and password along with this code, adding an extra layer of verification to confirm their identity. This practice is crucial for protecting sensitive information and mitigating unauthorized access.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Authenticator Applications",
      "timestamp_range": "02:11-02:35"
    },
    {
      "chunk_id": "4.2.5_chunk_5",
      "content": "A similar method that you may have used is a one-time password. Some banks use this method to allow ATM withdrawals without using a debit card or to let customers access their accounts from the internet. An application or token creates a one-time password. This password will only work for a single login. After that, the password expires. The password also expires if it isn't used withing a short period of time.",
      "summary": "One-time passwords (OTPs) are a security measure used by banks and other institutions to enhance account access and transaction security. Generated by an application or token, these passwords are valid for a single login session and expire shortly after creation if not used. This method helps prevent unauthorized access by ensuring that each password is unique and time-sensitive.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "One-Time Password",
      "timestamp_range": "02:35-02:57"
    },
    {
      "chunk_id": "4.2.5_chunk_6",
      "content": "These one-time passwords can be sent to the users several ways. For example, the one-time password can be sent using the Short Message Service, or SMS. When this option is selected, an SMS message with a one-time code or password is sent to your previously verified phone number. This code can then be used to verify your identify and complete your login.",
      "summary": "The Short Message Service (SMS) is utilized for sending one-time passwords (OTPs) to users' verified phone numbers as a method of identity verification. This process enhances security by requiring users to input a unique code received via SMS to complete their login. Implementing SMS-based OTPs is a practical application of multi-factor authentication, bolstering access control measures.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Short message service (SMS)",
      "timestamp_range": "02:57-03:19"
    },
    {
      "chunk_id": "4.2.5_chunk_7",
      "content": "Similarly, if you chose to receive your code through the phone, you'll get a phone call and an automated voice will provide you with a one-time code or password.",
      "summary": "In this section, the course discusses the use of phone calls as a method for delivering one-time codes or passwords for authentication purposes. It highlights the importance of this approach in enhancing security by providing a secondary verification method. Practical applications include using phone-based codes for secure access to accounts and systems.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Phone Call",
      "timestamp_range": "03:19-03:27"
    },
    {
      "chunk_id": "4.2.5_chunk_8",
      "content": "Push notification authentication can also be used to grant access to an account. For example, when you log in to your account, you'll enter your username, but instead of a password, you receive an access request notification on your mobile device. You can then view the authentication details and approve or deny access, typically with a simple press of a button. One advantage of using this authentication method is that you don't have to remember passwords. However, this method only works with the services provided by a specific company. As a result, there are a limited number of applications that integrate with their services. This makes them unavailable to organizations that use enterprise-level and proprietary solutions.",
      "summary": "Push notification authentication enhances account security by allowing users to approve or deny access requests via notifications on their mobile devices, eliminating the need for passwords. While this method simplifies the login process, its applicability is limited to specific services offered by certain companies, which may restrict its use in enterprise environments with diverse or proprietary solutions. Overall, it represents a modern approach to authentication, balancing convenience with security.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Push Notification Authentication",
      "timestamp_range": "03:27-04:07"
    },
    {
      "chunk_id": "4.2.5_chunk_9",
      "content": "That's it for this lesson. In this lesson, we looked at biometric systems and several other authentication technologies used for multifactor authentication.",
      "summary": "This lesson covered biometric systems and various authentication technologies integral to multifactor authentication (MFA). Key concepts included the effectiveness and implementation of biometrics, such as fingerprint and facial recognition, alongside other authentication methods to enhance security. Practical applications emphasized the importance of combining multiple authentication factors to strengthen access control and protect sensitive information.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.2.5",
        "title": "Biometrics and Authentication Technologies",
        "content_type": "video",
        "filename": "4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.2.5_Biometrics_and_Authentication_Technologies_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "04:07-04:17"
    }
  ],
  "num_chunks": 9
}