{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.5.3",
    "title": "Configure Account Policies and UAC Settings",
    "content_type": "video",
    "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
    "word_count": 988,
    "has_content": true
  },
  "full_content": "In this demonstration, we'll show you actions you can take to harden Windows authentication. First, we'll configure account policies that will be applied to all the users in the domain. Then, we'll enforce UAC settings. An easy way to enforce UAC settings is to make the configuration changes to a GPO in the domain. When you use a GPO, settings are automatically enforced on each workstation whenever a user logs in to the domain. Using Group Policy, you make the changes once, instead of having to do it manually on each workstation. Let's go to Tools > Group Policy Management and right-click Default Domain Policy. Click Edit. That opens the Group Policy Management Editor. Then, let's go to Computer Configuration > Policies > Window Settings > Security Settings > Account Policies > Password Policy. Here, you see the password policies that are available. First, let's change the minimum password length from seven characters to a more secure 10 characters. The value you choose for many of these settings depends on your environment, the organization, and how you want to balance security with ease of use for the users. If you set the password policy too high, it might be difficult for users to manage. We'll set the password length at 10 because that's a reasonable number of characters for a password. Now, let's go to Enforce Password History. The value is set to 24. This means the system keeps a 24-password history. That prevents users from repeating recent passwords. This policy makes sure that users can't reuse a password until they have made 24 different password changes. Click OK. That's fine where it's set. Let's change our maximum password age. We're going to change that to 30 days. A minimum password age of one day means the user could change the password every day. Some users might try changing the password every day, so they get back to an old password after 24 days of passwords changes. We don't want to allow that. Let's change the minimum password age to 10 days. That means users have to keep a password for 10 days. Now, let's look at password complexity requirements. These are basic complexity requirements that Windows has defined. In most cases when you click the Explain tab, it'll provide more information about the policy setting. Here you can see all the password requirements that Windows has set. So, we'll click OK. After configuring password policies, let's configure the account lockout policies. If we go here, the first one we'll look at is the account lockout threshold. You can see that it's currently set to 0 invalid logon attempts. Let's double-click it. Zero invalid logon attempts mean it's not enabled. It's defined, but a policy set at zero is, by definition, not enabled. Let's change this to 3. That means, after three invalid password entries, the account will lock. Click OK. If you look, this automatically sets the other two values for the account lockout policy to 10 minutes each. Let's go into these. The Account Lockout duration determines the length of time before a locked account will automatically be unlocked. The Reset Account Lockout Counter determines how long an invalid password attempt will be counted toward the Account Lockout Threshold. 10 minutes is fine for both of these settings, so I'm going to leave them as-is. The next thing we'll look at is the User Account Control. If we go to Local Policies > Security Options, we can look at the UAC settings. A word of caution – configuring the UAC incorrectly can cause some real problems. It can generate excessive elevation prompts, it can cause applications not to install correctly, and be a source of frustration for your users and your help desk. For this video, we're going to go through each of these settings and configure the group policy according to how the UAC behaves by default. It's always a good idea to put new settings into a new group policy object. So, let's close this and go back to the Group Policy Management. We'll go into the Group Policy Objects folder and right click, then select New to create a new GPO. We'll call this UAC Settings. We'll edit this GPO and go to Computer Configuration, Policies, Windows Settings, Security Settings, Local Policies, Security Settings, and scroll down to the bottom. You can read more about what each of these settings do in the description. Here is how we are going to configure them for this video. Admin Approval Mode for the Built-in Administrator account will be enabled. Allow UIAccess applications to prompt for elevation without using the Secure Desktop will be disabled. Behavior of the elevation prompt for administrators in Admin Approval Mode will be set to \"Prompt for consent for non-Windows binaries\". Behavior of the elevation prompt for standard users will be set to \"Prompt for credentials on the secure desktop\". Detect application installations and prompt for elevation will be enabled. Only elevate executables that are signed and validated will be disabled. Only elevate UIAccess applications that are installed in secure locations will be enabled. Run all administrators in Admin Approval Mode will be enabled. Switch to the secure desktop when prompting for elevation will be enabled. And last, virtualize file and registry write failures to per-user locations will be enabled. Now that I have the GPO configured the way I want, I just need to apply it to an OU, and all the computers beneath that OU will inherit the settings from it. That concludes this demo. In this demonstration, we hardened Windows authentication.",
  "chunks": [
    {
      "chunk_id": "4.5.3_chunk_1",
      "content": "In this demonstration, we'll show you actions you can take to harden Windows authentication. First, we'll configure account policies that will be applied to all the users in the domain. Then, we'll enforce UAC settings. An easy way to enforce UAC settings is to make the configuration changes to a GPO in the domain. When you use a GPO, settings are automatically enforced on each workstation whenever a user logs in to the domain. Using Group Policy, you make the changes once, instead of having to do it manually on each workstation.",
      "summary": "This section focuses on enhancing Windows authentication security through the implementation of account policies and User Account Control (UAC) settings. By configuring these settings via Group Policy Objects (GPO), administrators can ensure consistent enforcement across all domain workstations, streamlining the process and reducing the risk of security vulnerabilities. This approach emphasizes the importance of centralized management in maintaining robust security practices within an organization.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Account Policies and UAC Settings",
      "timestamp_range": "00:00-00:40"
    },
    {
      "chunk_id": "4.5.3_chunk_2",
      "content": "Let's go to Tools > Group Policy Management and right-click Default Domain Policy. Click Edit. That opens the Group Policy Management Editor. Then, let's go to Computer Configuration > Policies > Window Settings > Security Settings > Account Policies > Password Policy. Here, you see the password policies that are available.",
      "summary": "The Password Policies section of the CompTIA Security+ course covers the configuration of password settings through the Group Policy Management Editor in Windows environments. It emphasizes the importance of implementing strong password policies to enhance security, detailing how to navigate to and edit these settings under Account Policies. Practical applications include setting requirements for password complexity, length, and expiration to protect against unauthorized access.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Password Policies",
      "timestamp_range": "00:40-01:16"
    },
    {
      "chunk_id": "4.5.3_chunk_3",
      "content": "First, let's change the minimum password length from seven characters to a more secure 10 characters. The value you choose for many of these settings depends on your environment, the organization, and how you want to balance security with ease of use for the users. If you set the password policy too high, it might be difficult for users to manage. We'll set the password length at 10 because that's a reasonable number of characters for a password.",
      "summary": "The course emphasizes the importance of establishing a minimum password length to enhance security, recommending a standard of 10 characters for optimal balance between security and user manageability. It highlights that the chosen password policy should reflect the specific needs of the organization and its environment, ensuring that while security is prioritized, user convenience is also considered. This approach fosters a more secure authentication process without overwhelming users.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Minimum Password Length",
      "timestamp_range": "01:16-01:44"
    },
    {
      "chunk_id": "4.5.3_chunk_4",
      "content": "Now, let's go to Enforce Password History. The value is set to 24. This means the system keeps a 24-password history. That prevents users from repeating recent passwords. This policy makes sure that users can't reuse a password until they have made 24 different password changes. Click OK. That's fine where it's set.",
      "summary": "The Enforce Password History policy is designed to enhance security by maintaining a history of the last 24 passwords used by a user, preventing them from reusing recent passwords. This practice encourages the creation of unique passwords and reduces the risk of unauthorized access due to password reuse. Implementing this policy is a critical step in establishing robust password management within an organization.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Password History",
      "timestamp_range": "01:44-02:07"
    },
    {
      "chunk_id": "4.5.3_chunk_5",
      "content": "Let's change our maximum password age. We're going to change that to 30 days. A minimum password age of one day means the user could change the password every day. Some users might try changing the password every day, so they get back to an old password after 24 days of passwords changes. We don't want to allow that. Let's change the minimum password age to 10 days. That means users have to keep a password for 10 days.",
      "summary": "This section covers the configuration of password policies, specifically focusing on setting a maximum password age of 30 days and a minimum password age of 10 days. The maximum age ensures that passwords are regularly updated for security, while the minimum age prevents users from frequently cycling back to previous passwords within a short timeframe. These practices help enhance overall security by promoting stronger password management.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Maximum Password Age",
      "timestamp_range": "02:07-02:42"
    },
    {
      "chunk_id": "4.5.3_chunk_6",
      "content": "Now, let's look at password complexity requirements. These are basic complexity requirements that Windows has defined. In most cases when you click the Explain tab, it'll provide more information about the policy setting. Here you can see all the password requirements that Windows has set. So, we'll click OK.",
      "summary": "The Password Complexity section of the CompTIA Security+ course outlines the essential requirements for creating secure passwords as defined by Windows. It emphasizes the importance of adhering to these complexity policies to enhance security, including guidelines on password length, character variety, and overall strength. Understanding these requirements is crucial for implementing effective password management practices in organizational settings.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Password Complexity",
      "timestamp_range": "02:42-03:03"
    },
    {
      "chunk_id": "4.5.3_chunk_7",
      "content": "After configuring password policies, let's configure the account lockout policies. If we go here, the first one we'll look at is the account lockout threshold. You can see that it's currently set to 0 invalid logon attempts. Let's double-click it. Zero invalid logon attempts mean it's not enabled. It's defined, but a policy set at zero is, by definition, not enabled. Let's change this to 3. That means, after three invalid password entries, the account will lock. Click OK. If you look, this automatically sets the other two values for the account lockout policy to 10 minutes each. Let's go into these.",
      "summary": "The Account Lockout Policies section of the CompTIA Security+ course focuses on configuring security measures to protect user accounts from unauthorized access. It emphasizes setting an account lockout threshold, where an account will be locked after a specified number of invalid login attempts, such as three, and automatically adjusts the lockout duration to 10 minutes. This practical application enhances security by mitigating the risk of brute-force attacks on user accounts.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Account Lockout Policies",
      "timestamp_range": "03:03-03:49"
    },
    {
      "chunk_id": "4.5.3_chunk_8",
      "content": "The Account Lockout duration determines the length of time before a locked account will automatically be unlocked. The Reset Account Lockout Counter determines how long an invalid password attempt will be counted toward the Account Lockout Threshold. 10 minutes is fine for both of these settings, so I'm going to leave them as-is.",
      "summary": "The Account Lockout Duration specifies how long a locked account remains inaccessible before it is automatically unlocked, while the Reset Account Lockout Counter defines the timeframe for counting invalid password attempts towards the Account Lockout Threshold. Setting both parameters to 10 minutes is generally effective for maintaining security while minimizing user disruption. These configurations are essential for balancing security measures against user experience in account management.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Reset Account Lockout Counter and Account Lockout Duration",
      "timestamp_range": "03:49-04:09"
    },
    {
      "chunk_id": "4.5.3_chunk_9",
      "content": "The next thing we'll look at is the User Account Control. If we go to Local Policies > Security Options, we can look at the UAC settings. A word of caution – configuring the UAC incorrectly can cause some real problems. It can generate excessive elevation prompts, it can cause applications not to install correctly, and be a source of frustration for your users and your help desk. For this video, we're going to go through each of these settings and configure the group policy according to how the UAC behaves by default. It's always a good idea to put new settings into a new group policy object. So, let's close this and go back to the Group Policy Management. We'll go into the Group Policy Objects folder and right click, then select New to create a new GPO. We'll call this UAC Settings. We'll edit this GPO and go to Computer Configuration, Policies, Windows Settings, Security Settings, Local Policies, Security Settings, and scroll down to the bottom. You can read more about what each of these settings do in the description. Here is how we are going to configure them for this video. Admin Approval Mode for the Built-in Administrator account will be enabled. Allow UIAccess applications to prompt for elevation without using the Secure Desktop will be disabled. Behavior of the elevation prompt for administrators in Admin Approval Mode will be set to \"Prompt for consent for non-Windows binaries\". Behavior of the elevation prompt for standard users will be set to \"Prompt for credentials on the secure desktop\". Detect application installations and prompt for elevation will be enabled. Only elevate executables that are signed and validated will be disabled. Only elevate UIAccess applications that are installed in secure locations will be enabled. Run all administrators in Admin Approval Mode will be enabled. Switch to the secure desktop when prompting for elevation will be enabled. And last, virtualize file and registry write failures to per-user locations will be enabled. Now that I have the GPO configured the way I want, I just need to apply it to an OU, and all the computers beneath that OU will inherit the settings from it.",
      "summary": "This section covers the configuration of User Account Control (UAC) settings within Group Policy, emphasizing the importance of correct setup to avoid issues like excessive elevation prompts and installation failures. Key configurations include enabling Admin Approval Mode for the built-in Administrator account, adjusting elevation prompt behaviors for both administrators and standard users, and ensuring secure application installations. Properly managing these settings helps enhance security while minimizing user frustration and support requests.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "User Account Control Settings",
      "timestamp_range": "04:09-06:53"
    },
    {
      "chunk_id": "4.5.3_chunk_10",
      "content": "That concludes this demo. In this demonstration, we hardened Windows authentication.",
      "summary": "In this demonstration, the focus was on hardening Windows authentication to enhance security measures. Key concepts included implementing strong password policies, enabling multi-factor authentication, and configuring account lockout settings to protect against unauthorized access. Practical applications involved adjusting system settings and using security tools to reinforce the integrity of user authentication processes.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.5.3",
        "title": "Configure Account Policies and UAC Settings",
        "content_type": "video",
        "filename": "4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.5.3_Configure_Account_Policies_and_UAC_Settings_[video].txt",
        "word_count": 988,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "06:53-06:58"
    }
  ],
  "num_chunks": 10
}