{
  "metadata": {
    "chapter_num": "3",
    "section_num": "3.1.12",
    "title": "Cryptographic Attacks",
    "content_type": "video",
    "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
    "word_count": 756,
    "has_content": true
  },
  "full_content": "No matter how many barriers we put in place to protect our data, hackers will always try to figure out a way to get around them and steal valuable information. In this video, we're going to look at some common cryptographic attacks and what the future of cryptography might look like. Encrypted data is usually secure, but there are no guarantees in the security world. By using new, targeted, or sophisticated attacks, hackers might be able to decrypt data you thought was safe. Some of the more common attacks are dictionary attacks, collision attacks, birthday attacks, and downgrade attacks. A dictionary attack is a type of brute force attack that is used quite often. In this attack, the hacker has a huge list of words and phrases that are used to guess a decryption key. These attacks work well against weak passwords, such as password123. Using longer and uncommon passphrases is the key to beating dictionary attacks. Another type of attack is the collision attack. A collision attack tries to find two inputs that produce the same hash value. This type of attack is often used on digital signatures. For example, we have a hacker that creates two different documents that have an identical hash value. With this type of attach, the hacker wants to get Travis to accept the second document by making it seem that it came from Craig. The first document is sent to Craig, who agrees with what the document says, so he signs it and sends it back. The hacker then takes Craig's signature from that document, attaches it to a bad document, and sends that to Travis. Because the documents have the same hash, Travis' software is unable to detect that there's anything wrong, and it looks totally legitimate. The problem with this attack is the difficulty of generating two documents that have the same hash. A birthday attack combines a collision attack and a brute force attack. This attack's name is taken from the birthday probability math problem. If you have 30 people are in a room, the chance that someone has the same birthday as you is about 8 percent. But the probability that any two people in the room have the same birthday is 70 percent. This is because we're not looking for an exact match, just any match. This concept can be used to create two documents with the same hash, as in the collision attack example. Another popular attack is the downgrade attack. Downgrade attacks force the system to use an older, less secure protocol for communication. A common example of this attack is SSL exploitation. Many servers have both SSL and TLS installed on them. If a client can't use TLS, then the server can revert to SSL. A hacker can set up their computer to only use SSL, which will then allow them to launch SSL-based attacks on the server. In this attack, the hacker intercepts the HTTPS packets and reverts them to HTTP packets. If the server isn't configured properly, it'll respond using HTTP, which allows the hacker to see everything being sent back and forth. To combat these attacks, it's imperative that servers don't support older, less secure protocols. Proper server configuration is the key to stopping these types of attacks. Now let's look ahead to what's coming in the security world. The future of computers and cryptography lies in quantum computing. Classic computing works by processing bits, or 0s and 1s. These bits represent the electrical signals of on and off. Quantum computing uses qubits, which can exist as both a 1 and 0 at the same time. Quantum computing is so much more powerful than today's computing. This increased computing power means that today's encryption standards can be hacked easily and quickly. An encryption key that might take years to crack with today's computers can take days or even hours with quantum computers. To combat the inevitable increase of quantum computing, researchers have already started work on post-quantum cryptography. These new methods will be used to ensure the safety of our data. That wraps up this lesson. In this video, we covered different types of cryptographic attacks, including dictionary, collision, birthday, and downgrade attacks. Then we looked at the future of cryptography, which involves quantum computing and post-quantum cryptography.",
  "chunks": [
    {
      "chunk_id": "3.1.12_chunk_1",
      "content": "No matter how many barriers we put in place to protect our data, hackers will always try to figure out a way to get around them and steal valuable information. In this video, we're going to look at some common cryptographic attacks and what the future of cryptography might look like.",
      "summary": "Cryptographic Attacks: No matter how many barriers we put in place to protect our data, hackers will always try to figure out a way to get around them and steal valuable information. In this video, we're going to look at some common cryptographic attacks and what the future of cryptography might look like.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Cryptographic Attacks",
      "timestamp_range": "00:00-00:19"
    },
    {
      "chunk_id": "3.1.12_chunk_2",
      "content": "Encrypted data is usually secure, but there are no guarantees in the security world. By using new, targeted, or sophisticated attacks, hackers might be able to decrypt data you thought was safe. Some of the more common attacks are dictionary attacks, collision attacks, birthday attacks, and downgrade attacks.",
      "summary": "Cryptographic Attacks: Encrypted data is usually secure, but there are no guarantees in the security world. By using new, targeted, or sophisticated attacks, hackers might be able to decrypt data you thought was safe.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Cryptographic Attacks",
      "timestamp_range": "00:19-00:38"
    },
    {
      "chunk_id": "3.1.12_chunk_3",
      "content": "A dictionary attack is a type of brute force attack that is used quite often. In this attack, the hacker has a huge list of words and phrases that are used to guess a decryption key. These attacks work well against weak passwords, such as password123. Using longer and uncommon passphrases is the key to beating dictionary attacks.",
      "summary": "Dictionary Attack: A dictionary attack is a type of brute force attack that is used quite often. In this attack, the hacker has a huge list of words and phrases that are used to guess a decryption key.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Dictionary Attack",
      "timestamp_range": "00:38-00:59"
    },
    {
      "chunk_id": "3.1.12_chunk_4",
      "content": "Another type of attack is the collision attack. A collision attack tries to find two inputs that produce the same hash value. This type of attack is often used on digital signatures. For example, we have a hacker that creates two different documents that have an identical hash value. With this type of attach, the hacker wants to get Travis to accept the second document by making it seem that it came from Craig. The first document is sent to Craig, who agrees with what the document says, so he signs it and sends it back. The hacker then takes Craig's signature from that document, attaches it to a bad document, and sends that to Travis. Because the documents have the same hash, Travis' software is unable to detect that there's anything wrong, and it looks totally legitimate. The problem with this attack is the difficulty of generating two documents that have the same hash.",
      "summary": "Collision Attack: A collision attack tries to find two inputs that produce the same hash value. This type of attack is often used on digital signatures.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Collision Attack",
      "timestamp_range": "00:59-01:50"
    },
    {
      "chunk_id": "3.1.12_chunk_5",
      "content": "A birthday attack combines a collision attack and a brute force attack. This attack's name is taken from the birthday probability math problem. If you have 30 people are in a room, the chance that someone has the same birthday as you is about 8 percent. But the probability that any two people in the room have the same birthday is 70 percent. This is because we're not looking for an exact match, just any match. This concept can be used to create two documents with the same hash, as in the collision attack example.",
      "summary": "Birthday Attack: A birthday attack combines a collision attack and a brute force attack. This attack's name is taken from the birthday probability math problem.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Birthday Attack",
      "timestamp_range": "01:50-02:21"
    },
    {
      "chunk_id": "3.1.12_chunk_6",
      "content": "Another popular attack is the downgrade attack. Downgrade attacks force the system to use an older, less secure protocol for communication. A common example of this attack is SSL exploitation. Many servers have both SSL and TLS installed on them. If a client can't use TLS, then the server can revert to SSL. A hacker can set up their computer to only use SSL, which will then allow them to launch SSL-based attacks on the server. In this attack, the hacker intercepts the HTTPS packets and reverts them to HTTP packets. If the server isn't configured properly, it'll respond using HTTP, which allows the hacker to see everything being sent back and forth. To combat these attacks, it's imperative that servers don't support older, less secure protocols. Proper server configuration is the key to stopping these types of attacks. Now let's look ahead to what's coming in the security world. The future of computers and cryptography lies in quantum computing.",
      "summary": "Downgrade Attack: Downgrade attacks force the system to use an older, less secure protocol for communication. A hacker can set up their computer to only use SSL, which will then allow them to launch SSL-based attacks on the server.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Downgrade Attack",
      "timestamp_range": "02:21-03:23"
    },
    {
      "chunk_id": "3.1.12_chunk_7",
      "content": "Classic computing works by processing bits, or 0s and 1s. These bits represent the electrical signals of on and off. Quantum computing uses qubits, which can exist as both a 1 and 0 at the same time. Quantum computing is so much more powerful than today's computing. This increased computing power means that today's encryption standards can be hacked easily and quickly. An encryption key that might take years to crack with today's computers can take days or even hours with quantum computers.",
      "summary": "Quantum Cryptography: This increased computing power means that today's encryption standards can be hacked easily and quickly. An encryption key that might take years to crack with today's computers can take days or even hours with quantum computers.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Quantum Cryptography",
      "timestamp_range": "03:23-03:54"
    },
    {
      "chunk_id": "3.1.12_chunk_8",
      "content": "To combat the inevitable increase of quantum computing, researchers have already started work on post-quantum cryptography. These new methods will be used to ensure the safety of our data.",
      "summary": "To combat the inevitable increase of quantum computing, researchers have already started work on post-quantum cryptography. These new methods will be used to ensure the safety of our data.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Post-Quantum Cryptography",
      "timestamp_range": "03:54-04:05"
    },
    {
      "chunk_id": "3.1.12_chunk_9",
      "content": "That wraps up this lesson. In this video, we covered different types of cryptographic attacks, including dictionary, collision, birthday, and downgrade attacks. Then we looked at the future of cryptography, which involves quantum computing and post-quantum cryptography.",
      "summary": "In this video, we covered different types of cryptographic attacks, including dictionary, collision, birthday, and downgrade attacks. Then we looked at the future of cryptography, which involves quantum computing and post-quantum cryptography.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.12",
        "title": "Cryptographic Attacks",
        "content_type": "video",
        "filename": "3.1.12_Cryptographic_Attacks_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.12_Cryptographic_Attacks_[video].txt",
        "word_count": 756,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "04:05-04:20"
    }
  ],
  "num_chunks": 9,
  "document_summary": "Cryptographic Attacks (video): Encrypted data is usually secure, but there are no guarantees in the security world. By using new, targeted, or sophisticated attacks, hackers might be able to decrypt data you thought was safe. This increased computing power means that today's encryption standards can be hacked easily and quickly."
}