{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.1.3",
    "title": "Hardening an Operating System",
    "content_type": "video",
    "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
    "word_count": 1307,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Let's take a look at some general strategies for hardening an operating system. Here we are on a domain controller running Windows Server. Let's go to Tools and go to Active Directory Users and Computers. There are a lot of options here for locking things down. The default user is the administrative user, and that's a very well-known account. It's built into the system, so a lot of people understand what it is and what it does. One thing you might consider doing is renaming the account in Properties, or you could create a new account for the administrator. Be aware that the Administrator account has many groups assigned to it, such as domain admins, enterprise admins, and schema admins. By default, the Domain Admins group grants the rights to configure group policies. Samantha Carter has been promoted to a junior administrator, so we need to elevate her permissions for this new role. We can go to Properties, Member Of, and then Add. Type 'domain admins' and hit OK. Then you can disable the administrative account and just use this account, which won't be well known to people outside of your system. If you do disable the administrative account, be aware that it's the original admin account, and it's the only one that you can't lock with account lockout. So be careful about disabling it. You don't want to get locked out of your system or your server. You'll also want to change passwords. Windows Server requires you to enter a complex password right after you've installed the operating system. You'll need to change any default account names and passwords and use complex passwords. To change your password, you just right-click on the account and go to Reset Password. That's relatively simple. You'll also notice that there are a lot of built-in groups in Active Directory. The Users container, on the left, contains all of the built-in groups that come on your server by default. These groups can help you control what users can access and what they can do. For example, when you add somebody to the Backup Operators group, that user has the power to back up and restore files. Let's go ahead and go to our Group Policy in Group Policy Manager. Go to Tools, and then we'll go to Group Policy Management. We're going to go to Domain Controllers and the Domain Controller default policy. Right-click. Edit. These are all the Group Policies that affect our domain controller. Over here, under Computer Configuration, we're going to go to Policies &gt; Windows Settings &gt; Security Settings. You can see settings that you've enabled to lock down the domain controller behavior. We're going to look under Security Settings. We're going to look at Local Policies, specifically User Rights Management. Under here, on the right-hand side, we're going to go to Back Up Files and Directories, and you can see that right here. This is basically the built-in groups that can back up files and do backups in the directories. We have administrators, backup operators, and server operators. We can add users to this group if we want to. Let's also go down to Restore Files and Directories. Here are the same groups. They all have that same access. All three of these, administrators, backup operators, and server operators, can back up and restore files on your system. That's something to be aware of. If I give someone Backup Operator rights, they'll be able to restore and back up any files on the system. On the left side, there are also security options. For security options, we don't care who's logged on. They affect everyone. Scroll down to Interactive Logon. Let's do Interactive Logon. Don't require Ctrl + Alt + Del right here. This option reduces your security posture because the malware can take advantage of the fact that the Ctrl + Alt + Del box isn't there. Having Ctrl + Alt + Del can prevent some malware. If this is enabled, it could open your system to some problems. But you can only set this across the board for every user. You can't define which user can do this; this setting applies to everyone. In this case, we don't want to do this. We're going to hit Cancel. Notice that it didn't ask us which user or which group to apply this to, since it affects everyone. Other hardening strategies include installing only required software on the systems. With Windows Server, we have the concept of roles. Server Manager is quite a bit different as well. Here, we're going to go to Add Roles and Features. We can also see Remove Roles and Features. It has a wizard to get you started. We'll just click through a few. This is very different from older versions of Windows Server, but you can do role-based or feature-based installation, or Remote Desktop Service installation. We're just going to do role-based. Select the server you want it to be on. I'm going to select my server. You can see the server roles that you can add. If we go on one more, you can see features. Windows Server only installs binaries for any service that you want to run on the server. This helps reduce the attack surface. You won't have a bunch of programs open by default. You have to go in, enable them, and turn them on. One major difference between older servers and newer servers is that the security configuration wizard has been completely removed, so features are secured by default. You should use Group Policy Manager or Microsoft Security Compliance Manager to control specific security settings. We can also go to our services on Server Manager by selecting Tools and then Services. It's a good practice to disable or turn off at least the startup behavior of any services that you're not requiring on this particular machine. Microsoft will start up services related to the roles you've installed, but often, there may be extra services that aren't required for the operation of your system. You can go through and look at all the services that are started automatically. For example, there's a service called SSDP that we're going to look at. SSDP Discovery is a universal plug-and-play type of hardware on your system. It's universal plug-and-play for network devices. At one time, there were some flaws in it, and it's automatically disabled by default. You'll want to be careful not to disable a service that may be critical. Always do your research first. That's it for this demo. In this demo, we discussed some strategies you can use to harden your Windows Server operating system.",
  "chunks": [
    {
      "chunk_id": "8.1.3_chunk_1",
      "content": "Let's take a look at some general strategies for hardening an operating system. Here we are on a domain controller running Windows Server. Let's go to Tools and go to Active Directory Users and Computers. There are a lot of options here for locking things down. The default user is the administrative user, and that's a very well-known account. It's built into the system, so a lot of people understand what it is and what it does.",
      "summary": "This section focuses on strategies for hardening an operating system, specifically using Windows Server as an example. Key concepts include securing the default administrative account, which is widely recognized and targeted, and utilizing tools like Active Directory to implement various security measures. Practical applications involve configuring user permissions and settings to enhance system security against unauthorized access.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Hardening an Operating System",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_2",
      "content": "One thing you might consider doing is renaming the account in Properties, or you could create a new account for the administrator. Be aware that the Administrator account has many groups assigned to it, such as domain admins, enterprise admins, and schema admins. By default, the Domain Admins group grants the rights to configure group policies. Samantha Carter has been promoted to a junior administrator, so we need to elevate her permissions for this new role. We can go to Properties, Member Of, and then Add. Type 'domain admins' and hit OK. Then you can disable the administrative account and just use this account, which won't be well known to people outside of your system.",
      "summary": "In managing administrator accounts, it's advisable to either rename the default administrator account or create a new one to enhance security. The Domain Admins group, which includes significant permissions like configuring group policies, can be utilized to elevate a user's privileges, as demonstrated by granting Samantha Carter junior administrator rights. Disabling the default administrative account further obscures it from potential attackers, reinforcing system security.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Administrator Account",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_3",
      "content": "If you do disable the administrative account, be aware that it's the original admin account, and it's the only one that you can't lock with account lockout. So be careful about disabling it. You don't want to get locked out of your system or your server.",
      "summary": "Disabling the original administrative account can pose significant risks, as it is the only account that cannot be locked out due to account lockout policies. Caution is advised when managing this account to avoid being locked out of critical systems or servers. Proper understanding of account management is essential for maintaining security and accessibility in IT environments.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Disabling Administrator",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_4",
      "content": "You'll also want to change passwords. Windows Server requires you to enter a complex password right after you've installed the operating system. You'll need to change any default account names and passwords and use complex passwords. To change your password, you just right-click on the account and go to Reset Password. That's relatively simple.",
      "summary": "Changing passwords is a crucial security practice, especially after installing Windows Server, which mandates complex passwords. It's important to modify default account names and passwords to enhance security. The process of changing a password is straightforward, involving a right-click on the account and selecting \"Reset Password.\"",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Change Passwords",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_5",
      "content": "You'll also notice that there are a lot of built-in groups in Active Directory. The Users container, on the left, contains all of the built-in groups that come on your server by default. These groups can help you control what users can access and what they can do. For example, when you add somebody to the Backup Operators group, that user has the power to back up and restore files.",
      "summary": "The Built-in Groups section of the CompTIA Security+ course highlights the default groups in Active Directory, which are essential for managing user permissions and access control. These groups, such as Backup Operators, enable administrators to assign specific capabilities, like file backup and restoration, to users efficiently. Understanding these built-in groups is crucial for implementing effective security policies within an organization.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Built-in Groups",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_6",
      "content": "Let's go ahead and go to our Group Policy in Group Policy Manager. Go to Tools, and then we'll go to Group Policy Management. We're going to go to Domain Controllers and the Domain Controller default policy. Right-click. Edit. These are all the Group Policies that affect our domain controller. Over here, under Computer Configuration, we're going to go to Policies &gt; Windows Settings &gt; Security Settings.",
      "summary": "The Group Policies section of the CompTIA Security+ course focuses on managing security settings for domain controllers through the Group Policy Management tool. It emphasizes the importance of configuring policies under Computer Configuration to enhance security measures within a network. Practical applications include editing default policies to enforce security protocols and manage user permissions effectively.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Group Policies",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_7",
      "content": "You can see settings that you've enabled to lock down the domain controller behavior. We're going to look under Security Settings. We're going to look at Local Policies, specifically User Rights Management. Under here, on the right-hand side, we're going to go to Back Up Files and Directories, and you can see that right here. This is basically the built-in groups that can back up files and do backups in the directories. We have administrators, backup operators, and server operators. We can add users to this group if we want to. Let's also go down to Restore Files and Directories. Here are the same groups. They all have that same access. All three of these, administrators, backup operators, and server operators, can back up and restore files on your system. That's something to be aware of. If I give someone Backup Operator rights, they'll be able to restore and back up any files on the system.",
      "summary": "The Domain Controller Behavior section focuses on configuring security settings related to user rights management, specifically for backup and restoration capabilities. It highlights the roles of built-in groups—administrators, backup operators, and server operators—who have permissions to back up and restore files and directories. Understanding these settings is crucial for managing access control and ensuring data security within a networked environment.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Domain Controller Behavior",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_8",
      "content": "On the left side, there are also security options. For security options, we don't care who's logged on. They affect everyone. Scroll down to Interactive Logon. Let's do Interactive Logon. Don't require Ctrl + Alt + Del right here. This option reduces your security posture because the malware can take advantage of the fact that the Ctrl + Alt + Del box isn't there. Having Ctrl + Alt + Del can prevent some malware. If this is enabled, it could open your system to some problems. But you can only set this across the board for every user. You can't define which user can do this; this setting applies to everyone. In this case, we don't want to do this. We're going to hit Cancel. Notice that it didn't ask us which user or which group to apply this to, since it affects everyone.",
      "summary": "The Security Options section emphasizes the importance of system-wide security settings, particularly focusing on Interactive Logon configurations. Disabling the requirement for Ctrl + Alt + Del can weaken security by making systems more vulnerable to malware, as this feature helps prevent unauthorized access. These settings apply universally to all users, highlighting the need for careful consideration when configuring security options to maintain a robust security posture.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Security Options",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_9",
      "content": "Other hardening strategies include installing only required software on the systems. With Windows Server, we have the concept of roles. Server Manager is quite a bit different as well. Here, we're going to go to Add Roles and Features. We can also see Remove Roles and Features. It has a wizard to get you started. We'll just click through a few. This is very different from older versions of Windows Server, but you can do role-based or feature-based installation, or Remote Desktop Service installation. We're just going to do role-based. Select the server you want it to be on. I'm going to select my server. You can see the server roles that you can add. If we go on one more, you can see features. Windows Server only installs binaries for any service that you want to run on the server. This helps reduce the attack surface. You won't have a bunch of programs open by default. You have to go in, enable them, and turn them on. One major difference between older servers and newer servers is that the security configuration wizard has been completely removed, so features are secured by default.",
      "summary": "In the Server Roles section of the CompTIA Security+ course, learners explore hardening strategies for Windows Server, emphasizing the importance of installing only necessary software to minimize the attack surface. The course introduces the Server Manager's role-based and feature-based installation processes, highlighting the removal of the security configuration wizard in newer versions, which ensures that features are secured by default. This approach enhances security by requiring administrators to actively enable and configure services, thereby reducing potential vulnerabilities.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Server Roles",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_10",
      "content": "You should use Group Policy Manager or Microsoft Security Compliance Manager to control specific security settings. We can also go to our services on Server Manager by selecting Tools and then Services. It's a good practice to disable or turn off at least the startup behavior of any services that you're not requiring on this particular machine. Microsoft will start up services related to the roles you've installed, but often, there may be extra services that aren't required for the operation of your system. You can go through and look at all the services that are started automatically. For example, there's a service called SSDP that we're going to look at. SSDP Discovery is a universal plug-and-play type of hardware on your system. It's universal plug-and-play for network devices. At one time, there were some flaws in it, and it's automatically disabled by default. You'll want to be careful not to disable a service that may be critical. Always do your research first.",
      "summary": "In the CompTIA Security+ course, the importance of managing services through tools like Group Policy Manager and Microsoft Security Compliance Manager is emphasized to enhance system security. It is recommended to disable unnecessary startup services to minimize vulnerabilities, while cautioning against disabling critical services without proper research. An example discussed is the SSDP Discovery service, which, despite being disabled by default due to past flaws, illustrates the need for careful consideration when managing system services.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Services",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.3_chunk_11",
      "content": "That's it for this demo. In this demo, we discussed some strategies you can use to harden your Windows Server operating system.",
      "summary": "In this demo, we explored various strategies for hardening Windows Server operating systems to enhance security. Key topics included implementing security updates, configuring firewalls, and managing user permissions effectively. These practical applications aim to protect the server from vulnerabilities and unauthorized access, ensuring a more secure operating environment.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.3",
        "title": "Hardening an Operating System",
        "content_type": "video",
        "filename": "8.1.3_Hardening_an_Operating_System_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.3_Hardening_an_Operating_System_[video].txt",
        "word_count": 1307,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 11
}