{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.1.4",
    "title": "Managing Automatic Updates",
    "content_type": "video",
    "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
    "word_count": 1129,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this demonstration, we're going to talk about configuring Windows Update. As you probably know, every now and then, the Windows operating system goes out to Microsoft's site over the internet and checks whether there are any updates available for the operating system. To manage updates on a Windows system, you need to come down to your Windows icon. Go to Settings and then Windows Update. On the Windows Update screen, I can see the current status of my updates. Right here, you can see when my device was last updated. To be sure my system is up to date, I can go here and select Check for updates. When I do that, Windows tells me it's up to date. Under Advanced Options, we next have the option to pause Windows updates for seven days. When I select this option, it'll pause my updates. And up here, you can see when the updates will resume. I don't want to pause my updates, so I'll click on Resume updates. This option allows us to set the active hours on our system. A long time ago, when dinosaurs roamed the earth, there was nothing worse than working on a term paper and having Windows spontaneously decide it was a great time to install an update. The system would log you off, and hopefully, you'd have a saved copy of your work. If not, you might have to start all over. So, this option lets you set active hours to let the device know when you typically work on your system. This is to avoid updating when you're in the middle of something without checking with you first. I like to work a lot, so I'll put in 16 hours. I'd like to change this to 7:00 a.m. until about 11:00 p.m. Here, I can select Update History. When I do, this Window appears, and I can see the name of the updates and the date they were installed. If I need to know more about what an update is, I can click one of the links, and it takes me to the Microsoft Knowledge Base site for that particular update. Below there are two options to be aware of. One is Uninstall updates, and the other is Recovery options. The Uninstall updates open another window where you can uninstall certain updates. However, some updates can't be removed from Windows. Recovery options take you to where you can do a system reset, which isn't part of this demo. Let's go back a few clicks. Under Advanced Options, we do other things, like tell Windows to give us updates for other Microsoft products when we update. For example, I might want Office to be updated when updates run. Here, we can tell Windows not to download when connected to metered connections. If we're connected to a cellular network and paying for bandwidth, we might not want to do that. Right now, that's off, and I'm going to leave it that way. Here, you can tell Windows to restart as soon as possible when a restart is required to install an update. If you have this turned on, it'll warn you before restarting. You can tell Windows to show a notification when your PC requires a restart to finish an update by turning this On. Okay, now let's move on to our delivery options. We're going to talk about a more advanced topic for a moment. It's possible to set up an update server on your local network and configure your workstations to get your updates from that server. This is a good option if you have a lot of workstations. Instead of having all these workstations in your organization download the same files redundantly from Microsoft, wasting bandwidth, we'd want to download those updates once to the update server. Then all the systems on your network would get the updates from that local server. Windows is taking that concept and making it more of a peer-to-peer model instead of a client-server model. Essentially, what we can do is get our updates from Microsoft directly. We can also get updates from other workstations on our network that have already downloaded that same update. We can turn that functionality off or on right here. By default, it's turned On. One option is only the PCs on my local network, which is selected by default. That's a pretty good idea. If you're a little more trusting, you can also get updates from computers out on the internet. This option scares me since I have no idea what I'd be getting from other computers, so I don't usually select it. Right below this, we have Advanced options. Here, we can change the default settings for how much bandwidth we'll allow Windows to use for downloading and uploading updates on the system. We'll click back a few times, which wraps up Windows Update. One last topic we need to cover before we end this demonstration: how to include device updates with Windows Update. This is usually a very good idea. The ironic thing is that finding this option can be challenging because when Windows releases featured updates, they often make things harder and harder to locate. That's what happened to the device update options. First, we need to go to Bluetooth &amp; devices settings. Now, go to Devices, More devices, and printer settings. I'm going to right-click the PC icon. From the menu, I'm going to select Device installation settings on this system. Here, it says, Do you want to automatically download manufacturers' apps and custom icons available for your devices? This is set to Yes by default. I wanted to confirm that, so I'll leave it alone. That's it for this demonstration. In this demo, we explained the process of managing Windows Update.",
  "chunks": [
    {
      "chunk_id": "8.1.4_chunk_1",
      "content": "In this demonstration, we're going to talk about configuring Windows Update. As you probably know, every now and then, the Windows operating system goes out to Microsoft's site over the internet and checks whether there are any updates available for the operating system. To manage updates on a Windows system, you need to come down to your Windows icon. Go to Settings and then Windows Update. On the Windows Update screen, I can see the current status of my updates. Right here, you can see when my device was last updated. To be sure my system is up to date, I can go here and select Check for updates. When I do that, Windows tells me it's up to date. Under Advanced Options, we next have the option to pause Windows updates for seven days. When I select this option, it'll pause my updates. And up here, you can see when the updates will resume. I don't want to pause my updates, so I'll click on Resume updates.",
      "summary": "This section covers the configuration of Windows Update, emphasizing the importance of keeping the operating system current by regularly checking for updates through the Settings menu. Users can view the update status, manually check for updates, and utilize advanced options to pause updates temporarily if needed. Proper management of Windows updates is crucial for maintaining system security and performance.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Configure Windows Update on Windows",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_2",
      "content": "This option allows us to set the active hours on our system. A long time ago, when dinosaurs roamed the earth, there was nothing worse than working on a term paper and having Windows spontaneously decide it was a great time to install an update. The system would log you off, and hopefully, you'd have a saved copy of your work. If not, you might have to start all over. So, this option lets you set active hours to let the device know when you typically work on your system. This is to avoid updating when you're in the middle of something without checking with you first. I like to work a lot, so I'll put in 16 hours. I'd like to change this to 7:00 a.m. until about 11:00 p.m.",
      "summary": "The \"Active Hours\" feature allows users to specify times when their system should avoid automatic updates, preventing interruptions during critical work periods. By setting active hours, users can ensure that updates do not disrupt their productivity, thereby minimizing the risk of data loss or workflow interruptions. This practical application enhances user control over system maintenance and improves overall efficiency.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Active Hours",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_3",
      "content": "Here, I can select Update History. When I do, this Window appears, and I can see the name of the updates and the date they were installed. If I need to know more about what an update is, I can click one of the links, and it takes me to the Microsoft Knowledge Base site for that particular update. Below there are two options to be aware of. One is Uninstall updates, and the other is Recovery options. The Uninstall updates open another window where you can uninstall certain updates. However, some updates can't be removed from Windows. Recovery options take you to where you can do a system reset, which isn't part of this demo. Let's go back a few clicks.",
      "summary": "The Update History section allows users to view installed updates, including their names and installation dates, with links to the Microsoft Knowledge Base for further information. Users can uninstall certain updates through the provided option, although some updates are non-removable. Additionally, recovery options are available for system resets, enhancing overall system management and security.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Update History",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_4",
      "content": "Under Advanced Options, we do other things, like tell Windows to give us updates for other Microsoft products when we update. For example, I might want Office to be updated when updates run. Here, we can tell Windows not to download when connected to metered connections. If we're connected to a cellular network and paying for bandwidth, we might not want to do that. Right now, that's off, and I'm going to leave it that way. Here, you can tell Windows to restart as soon as possible when a restart is required to install an update. If you have this turned on, it'll warn you before restarting. You can tell Windows to show a notification when your PC requires a restart to finish an update by turning this On.",
      "summary": "The Advanced Options section of the CompTIA Security+ course covers Windows update settings, allowing users to manage updates for Microsoft products like Office and control download behavior on metered connections. It emphasizes the importance of configuring restart notifications and options for timely updates while minimizing bandwidth usage. Practical applications include ensuring system security through regular updates without incurring unexpected data costs.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Advanced Options",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_5",
      "content": "Okay, now let's move on to our delivery options. We're going to talk about a more advanced topic for a moment. It's possible to set up an update server on your local network and configure your workstations to get your updates from that server. This is a good option if you have a lot of workstations. Instead of having all these workstations in your organization download the same files redundantly from Microsoft, wasting bandwidth, we'd want to download those updates once to the update server. Then all the systems on your network would get the updates from that local server. Windows is taking that concept and making it more of a peer-to-peer model instead of a client-server model. Essentially, what we can do is get our updates from Microsoft directly. We can also get updates from other workstations on our network that have already downloaded that same update. We can turn that functionality off or on right here. By default, it's turned On. One option is only the PCs on my local network, which is selected by default. That's a pretty good idea. If you're a little more trusting, you can also get updates from computers out on the internet. This option scares me since I have no idea what I'd be getting from other computers, so I don't usually select it. Right below this, we have Advanced options. Here, we can change the default settings for how much bandwidth we'll allow Windows to use for downloading and uploading updates on the system. We'll click back a few times, which wraps up Windows Update.",
      "summary": "The delivery options section discusses the setup of a local update server to streamline the update process for multiple workstations, reducing bandwidth usage by allowing them to download updates from a single source instead of directly from Microsoft. It also introduces a peer-to-peer model where workstations can share updates among themselves, with configurable settings for bandwidth usage and the option to receive updates from external computers, though caution is advised regarding the latter. This approach enhances efficiency and control over system updates in a networked environment.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Delivery Options",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_6",
      "content": "One last topic we need to cover before we end this demonstration: how to include device updates with Windows Update. This is usually a very good idea. The ironic thing is that finding this option can be challenging because when Windows releases featured updates, they often make things harder and harder to locate. That's what happened to the device update options. First, we need to go to Bluetooth &amp; devices settings. Now, go to Devices, More devices, and printer settings. I'm going to right-click the PC icon. From the menu, I'm going to select Device installation settings on this system. Here, it says, Do you want to automatically download manufacturers' apps and custom icons available for your devices? This is set to Yes by default. I wanted to confirm that, so I'll leave it alone.",
      "summary": "The section on Device Updates in Windows Update emphasizes the importance of including device updates to enhance system security and functionality. It guides users through the often-challenging process of accessing device update settings within the Windows interface, specifically through the Bluetooth & devices settings. By ensuring that the option to automatically download manufacturers' apps and custom icons is enabled, users can maintain optimal device performance and security.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Device Updates in Windows Update",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.1.4_chunk_7",
      "content": "That's it for this demonstration. In this demo, we explained the process of managing Windows Update.",
      "summary": "The demonstration covered the management of Windows Update, highlighting its importance in maintaining system security and performance. Key concepts included the configuration of update settings, scheduling, and troubleshooting update issues to ensure devices remain protected against vulnerabilities. Practical applications involve implementing best practices for regular updates to safeguard organizational networks.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.1.4",
        "title": "Managing Automatic Updates",
        "content_type": "video",
        "filename": "8.1.4_Managing_Automatic_Updates_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.1.4_Managing_Automatic_Updates_[video].txt",
        "word_count": 1129,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 7
}