{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.4.4",
    "title": "Configuring a Wireless Connection",
    "content_type": "video",
    "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
    "word_count": 1085,
    "has_content": true
  },
  "full_content": "Transcript close interactive script Connecting to Wi-Fi is something pretty much everyone does these days, but there are some additional settings that many users are not aware of. In this demonstration, we are going to go and see where you can configure these additional settings. I have a PC that has a USB Wi-Fi adapter. When click on the taskbar you can see we are not connected to any networks. Our Wi-Fi adapter is on however its just not connected to anything. When we click this arrow, we are shown the available wireless networks around this area. To connect to a wireless network, I find the SSID, which is right here. I can click it once and I'm able to click Connect. From here, I'm prompted for the passphrase. We have that set up to be LearningIsCool. I can then click here to verify that I typed it in correctly and click Next. Great were connected and ready to go. Let's look at our wireless profiles. To see these, we need to go to <b>Start </b>&gt;<b>Settings</b>&gt; <b>Network &amp; Internet</b>&gt;<b>Wi-Fi</b>&gt; <b>Manage Known Networks</b>. Once you successfully connect to a wireless, the computer creates what's called a profile. The profile identifies wireless networks that have been connected to it in the past. These profiles are saved so you can connect to the same network again later. Click on the profile to change its properties about the connection. The first thing I can do is tell this to connect automatically to this wireless. If it's one that you want to use as your default, you might want to have this turned to On. If you pay for bandwidth, you might want to tell this connection that you're on a metered connection. This will help prevent things such as Windows Update from downloading large files while connected. This is nice because you can then avoid charges for data you didn't plan on using. Let's click up here and go back. You might want to add a wireless network profile manually. This might be if you're connecting to a wireless network and there is no SSID broadcast. To do this, we select Add a new network. We can then enter our network name here. I'll put in Testout_Hidden and for Security type, I'll select WPA2-Personal from the list. I need to enter a security key which will be the same LearningIsCool. I then have the option to connect automatically and also to connect even if this network isn't broadcasting. I'll click Save here at the bottom, and we've added a network manually. Since were already connected to an existing network we will have to go back down to your Wi-Fi connected and click connect on the Testout_Hidden. Once doing so it will connect to this network now. Keep note you may only want to update what Wi-Fi networks you want to connect to automatically if there are many around the same location. To remove a network you no longer want, you select the Wi-Fi connection that you want to remove and Right Click to select the Forget option. This doesn't show you a confirmation dialog, so pay attention and make sure you're removing the right one. This can also be done in the Manage known networks. Mobile Hotspot is a feature that allows you to create a hotspot on your computer. Instead of you connecting to a hotspot you are making this computer the hotspot. An example could be having one computer plugged into a wired internet connection and then the same computer provided wireless to share the internet connection. Not only can it make a hotspot off a wired connection it can reshare a wireless connection too. In our task bar there is a quick option to turn on mobile hotspot. After clicking on it our mobile hotspot will be active. In order to see more settings for this we must go to or Network&amp; internet settings. Were already in our settings so we will take a look at it from here. The setting were looking for is Mobile hotspot. The settings here provide key information such as the password for this Mobile hotspot. If we select edit were able to change the Network name and password if need be. If you're on your battery this setting here for Power saving will be helpful because it will automatically shut Mobile hotspot off once it notices no devices are connecting to it. The last thing I would like to point out is this hotspot is only limited to 8 devices so if you have more devices then that then this setup will not work for you. A lot of the available features for a wireless adapter are still available however it may be hidden for the public eye. A regular user may not be concerned about them, but we are. Open the search and type cmd. This will bring up the option to open the command prompt. In our command prompt let's type in \"netsh wlan show wirelesscapabilities\". Press enter. This list will show us what is supported by the wireless adapter and what is not. For example, ANQP Service Information Discovery was the previous option listed in windows 10 for hotspot 2.0. its not listed in our settings on this Windows install however its still supported by the wireless adapter. That's it for this demo. In this demo, we looked at how to connect to a wireless network in Windows. We then looked at Mobile hotspot and supported capabilities of a wireless adapter.",
  "chunks": [
    {
      "chunk_id": "8.4.4_chunk_1",
      "content": "Connecting to Wi-Fi is something pretty much everyone does these days, but there are some additional settings that many users are not aware of. In this demonstration, we are going to go and see where you can configure these additional settings.",
      "summary": "The \"Configure a Wireless Connection\" section of the CompTIA Security+ course covers essential settings for establishing secure Wi-Fi connections, emphasizing the importance of understanding and configuring advanced options beyond basic connectivity. Participants will learn practical applications for enhancing wireless security, including encryption protocols and network settings to mitigate vulnerabilities. This knowledge is crucial for safeguarding personal and organizational data in increasingly wireless environments.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Configure a Wireless Connection",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_2",
      "content": "I have a PC that has a USB Wi-Fi adapter. When click on the taskbar you can see we are not connected to any networks. Our Wi-Fi adapter is on however its just not connected to anything. When we click this arrow, we are shown the available wireless networks around this area. To connect to a wireless network, I find the SSID, which is right here. I can click it once and I'm able to click Connect. From here, I'm prompted for the passphrase. We have that set up to be LearningIsCool. I can then click here to verify that I typed it in correctly and click Next. Great were connected and ready to go.",
      "summary": "This section demonstrates how to connect a PC with a USB Wi-Fi adapter to a wireless network by selecting the appropriate SSID from available networks and entering the correct passphrase. It emphasizes the importance of verifying the passphrase for successful connectivity. Understanding this process is crucial for ensuring secure and reliable access to wireless networks in various environments.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Connect to a Wireless from a Client",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_3",
      "content": "Let's look at our wireless profiles. To see these, we need to go to <b>Start </b>&gt;<b>Settings</b>&gt; <b>Network &amp; Internet</b>&gt;<b>Wi-Fi</b>&gt; <b>Manage Known Networks</b>. Once you successfully connect to a wireless, the computer creates what's called a profile. The profile identifies wireless networks that have been connected to it in the past. These profiles are saved so you can connect to the same network again later. Click on the profile to change its properties about the connection. The first thing I can do is tell this to connect automatically to this wireless. If it's one that you want to use as your default, you might want to have this turned to On. If you pay for bandwidth, you might want to tell this connection that you're on a metered connection. This will help prevent things such as Windows Update from downloading large files while connected. This is nice because you can then avoid charges for data you didn't plan on using. Let's click up here and go back.",
      "summary": "In the CompTIA Security+ course, the section on viewing wireless profiles explains how to access and manage saved Wi-Fi connections on a computer. Users can modify settings such as automatic connection preferences and metered connection options to control data usage and avoid unexpected charges. Understanding these profiles is essential for maintaining secure and efficient network connections.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "View Wireless Profiles",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_4",
      "content": "You might want to add a wireless network profile manually. This might be if you're connecting to a wireless network and there is no SSID broadcast. To do this, we select Add a new network. We can then enter our network name here. I'll put in Testout_Hidden and for Security type, I'll select WPA2-Personal from the list. I need to enter a security key which will be the same LearningIsCool. I then have the option to connect automatically and also to connect even if this network isn't broadcasting. I'll click Save here at the bottom, and we've added a network manually. Since were already connected to an existing network we will have to go back down to your Wi-Fi connected and click connect on the Testout_Hidden. Once doing so it will connect to this network now. Keep note you may only want to update what Wi-Fi networks you want to connect to automatically if there are many around the same location.",
      "summary": "To manually add a wireless network, select \"Add a new network,\" enter the SSID (e.g., Testout_Hidden), choose the security type (e.g., WPA2-Personal), and input the security key. You can also set the connection to occur automatically and even when the network isn't broadcasting. After saving, connect to the newly added network from your Wi-Fi settings, ensuring to manage automatic connections for multiple nearby networks.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Add a Wireless Network Manually",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_5",
      "content": "To remove a network you no longer want, you select the Wi-Fi connection that you want to remove and Right Click to select the Forget option. This doesn't show you a confirmation dialog, so pay attention and make sure you're removing the right one. This can also be done in the Manage known networks.",
      "summary": "To remove an unwanted wireless network, right-click on the desired Wi-Fi connection and select the \"Forget\" option, which does not provide a confirmation dialog, so caution is advised. Alternatively, this action can be performed through the \"Manage known networks\" settings. Understanding this process is essential for maintaining network security and managing connections effectively.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Remove a Wireless Network",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_6",
      "content": "Mobile Hotspot is a feature that allows you to create a hotspot on your computer. Instead of you connecting to a hotspot you are making this computer the hotspot. An example could be having one computer plugged into a wired internet connection and then the same computer provided wireless to share the internet connection. Not only can it make a hotspot off a wired connection it can reshare a wireless connection too. In our task bar there is a quick option to turn on mobile hotspot. After clicking on it our mobile hotspot will be active. In order to see more settings for this we must go to or Network&amp; internet settings. Were already in our settings so we will take a look at it from here. The setting were looking for is Mobile hotspot. The settings here provide key information such as the password for this Mobile hotspot. If we select edit were able to change the Network name and password if need be. If you're on your battery this setting here for Power saving will be helpful because it will automatically shut Mobile hotspot off once it notices no devices are connecting to it. The last thing I would like to point out is this hotspot is only limited to 8 devices so if you have more devices then that then this setup will not work for you.",
      "summary": "The Mobile Hotspot feature allows users to transform their computer into a wireless hotspot, sharing either a wired or existing wireless internet connection with other devices. Users can easily activate and configure settings, such as network name and password, through the Network & Internet settings, with an option for power saving to automatically disable the hotspot when not in use. However, the hotspot is limited to a maximum of eight connected devices.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Mobile Hotspot",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_7",
      "content": "A lot of the available features for a wireless adapter are still available however it may be hidden for the public eye. A regular user may not be concerned about them, but we are. Open the search and type cmd. This will bring up the option to open the command prompt. In our command prompt let's type in \"netsh wlan show wirelesscapabilities\". Press enter. This list will show us what is supported by the wireless adapter and what is not. For example, ANQP Service Information Discovery was the previous option listed in windows 10 for hotspot 2.0. its not listed in our settings on this Windows install however its still supported by the wireless adapter.",
      "summary": "This section emphasizes the importance of understanding the hidden features of wireless adapters, which can be accessed through the command prompt using the command \"netsh wlan show wirelesscapabilities.\" Users can discover supported functionalities, such as ANQP Service Information Discovery for hotspot 2.0, even if they are not visible in the standard settings. This knowledge is crucial for optimizing wireless security and performance.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "View Wireless adapter features",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.4_chunk_8",
      "content": "That's it for this demo. In this demo, we looked at how to connect to a wireless network in Windows. We then looked at Mobile hotspot and supported capabilities of a wireless adapter.",
      "summary": "In this demo, we explored the process of connecting to a wireless network using Windows, highlighting essential steps for secure access. Additionally, we examined the functionality of mobile hotspots and the capabilities of wireless adapters, emphasizing their practical applications in enhancing connectivity and security in various environments.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.4",
        "title": "Configuring a Wireless Connection",
        "content_type": "video",
        "filename": "8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.4_Configuring_a_Wireless_Connection_[video].txt",
        "word_count": 1085,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 8
}