{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.4.2",
    "title": "Wireless Installation",
    "content_type": "video",
    "filename": "8.4.2_Wireless_Installation_[video].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
    "word_count": 705,
    "has_content": true
  },
  "full_content": "Transcript close interactive script When you set up a wireless network, you can't just put up a bunch of wireless access points and call it a day. There are different installation considerations you'll need to look at before installing your devices. The first step is to understand and define the usage needs of your wireless network. Once you know them, it's time to conduct a site survey. In this lesson, we're going to discuss the site survey process. A site survey ensures that the wireless network will perform as desired. It examines the physical layout and barriers of the location, which lets you determine where to install the access points. Multiple site surveys will be completed during the installation process. There are three different types of site surveys performed at different times in the installation process: passive surveys, active surveys, and predictive surveys. If a survey isn't conducted properly, your network won't perform, and that will cost a lot more time and money than performing surveys correctly. To conduct a survey, you'll need to use a Wi-Fi analyzer. A dedicated Wi-Fi analyzer tool can provide an in-depth look at the wireless signals in the area being tested. There are also several Wi-Fi analyzers programs you can run from a laptop, tablet, or smartphone. Before you perform a survey, you need a diagram or map of your location. It's important to make sure that the map is properly scaled and labeled so you can get a proper reading. Many analyzer tools allow you to import the map so you can overlay the survey results. The initial survey is a passive survey. This survey is performed without the analyzer connecting to any specific wireless access point. It's just in a listen-only mode. Temporary WAPs are placed, and the surveyor walks around with the analyzer to measure signal strength and interference levels. Once the passive survey has been completed, a heat map is generated. A heat map shows Wi-Fi signal strength. They usually show strong signals in green, medium levels in yellow, and weak spots in red. You may need to perform multiple passive surveys to determine the best placement for your access points. You also need to make sure that the WAPs are installed in secure locations so people can't physically access them. Once you've figured out where to install the WAPs and installed them, you should conduct an active survey. During an active survey, you'll first connect the Wi-Fi analyzer to the access points to measure the network strength and look for any weak spots. Then you'll walk through the entire location again to thoroughly test every inch. You can also generate heat maps again to visually represent problem areas. You also need to check for channel overlapping. If neighboring access points are set to overlapping channels, you'll end up dealing with performance issues and network drops as devices move between the different WAPs. The last type of site survey is a predictive survey. Predictive surveys use software programs to load the building blueprints and determines where to install the WAPs. This can be done remotely and doesn't require someone to walk through the location to test everything. A predictive survey isn't as precise as a passive or active survey, but it can cost less and take less time. That's it for this lesson. In this lesson, we talked about the process of installing a wireless network. Before we can do anything, we need to know the usage needs of the network. Then you can perform passive, active, and predictive site surveys to determine how to install your WAPs.",
  "chunks": [
    {
      "chunk_id": "8.4.2_chunk_1",
      "content": "When you set up a wireless network, you can't just put up a bunch of wireless access points and call it a day. There are different installation considerations you'll need to look at before installing your devices. The first step is to understand and define the usage needs of your wireless network. Once you know them, it's time to conduct a site survey. In this lesson, we're going to discuss the site survey process.",
      "summary": "In the Wireless Installation section of the CompTIA Security+ course, learners are introduced to the critical steps for setting up a secure and effective wireless network. Key concepts include defining the network's usage needs and conducting a thorough site survey to assess the optimal placement of wireless access points. This foundational knowledge ensures that the network is both functional and secure, addressing potential coverage and interference issues.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Wireless Installation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.2_chunk_2",
      "content": "A site survey ensures that the wireless network will perform as desired. It examines the physical layout and barriers of the location, which lets you determine where to install the access points. Multiple site surveys will be completed during the installation process. There are three different types of site surveys performed at different times in the installation process: passive surveys, active surveys, and predictive surveys. If a survey isn't conducted properly, your network won't perform, and that will cost a lot more time and money than performing surveys correctly. To conduct a survey, you'll need to use a Wi-Fi analyzer. A dedicated Wi-Fi analyzer tool can provide an in-depth look at the wireless signals in the area being tested. There are also several Wi-Fi analyzers programs you can run from a laptop, tablet, or smartphone. Before you perform a survey, you need a diagram or map of your location. It's important to make sure that the map is properly scaled and labeled so you can get a proper reading. Many analyzer tools allow you to import the map so you can overlay the survey results.",
      "summary": "Site surveys are essential for optimizing wireless network performance by assessing the physical layout and barriers of a location to determine optimal access point placement. There are three types of surveys—passive, active, and predictive—each conducted at different stages of installation, and using a Wi-Fi analyzer is crucial for accurate data collection. Properly executed surveys can save time and costs by ensuring the network operates effectively, and utilizing a scaled and labeled map enhances the accuracy of the results.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Site Surveys",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.2_chunk_3",
      "content": "The initial survey is a passive survey. This survey is performed without the analyzer connecting to any specific wireless access point. It's just in a listen-only mode. Temporary WAPs are placed, and the surveyor walks around with the analyzer to measure signal strength and interference levels. Once the passive survey has been completed, a heat map is generated. A heat map shows Wi-Fi signal strength. They usually show strong signals in green, medium levels in yellow, and weak spots in red. You may need to perform multiple passive surveys to determine the best placement for your access points. You also need to make sure that the WAPs are installed in secure locations so people can't physically access them. Once you've figured out where to install the WAPs and installed them, you should conduct an active survey.",
      "summary": "A passive survey involves analyzing wireless signal strength and interference without connecting to any access points, using a listening mode to gather data. Temporary wireless access points (WAPs) are deployed, and a heat map is created to visualize signal strength, indicating optimal placement for permanent installations. Ensuring WAPs are securely located is crucial, and subsequent active surveys can further refine network performance.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Passive Survey",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.2_chunk_4",
      "content": "During an active survey, you'll first connect the Wi-Fi analyzer to the access points to measure the network strength and look for any weak spots. Then you'll walk through the entire location again to thoroughly test every inch. You can also generate heat maps again to visually represent problem areas. You also need to check for channel overlapping. If neighboring access points are set to overlapping channels, you'll end up dealing with performance issues and network drops as devices move between the different WAPs.",
      "summary": "An active survey involves connecting a Wi-Fi analyzer to access points to assess network strength and identify weak spots, followed by a comprehensive walkthrough of the location to ensure thorough testing. This process includes generating heat maps to visually highlight problem areas and checking for channel overlapping, which can lead to performance issues and connectivity drops as devices transition between different wireless access points (WAPs). Practical applications of this survey help optimize network performance and enhance overall security.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Active Survey",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.2_chunk_5",
      "content": "The last type of site survey is a predictive survey. Predictive surveys use software programs to load the building blueprints and determines where to install the WAPs. This can be done remotely and doesn't require someone to walk through the location to test everything. A predictive survey isn't as precise as a passive or active survey, but it can cost less and take less time.",
      "summary": "A predictive survey utilizes software to analyze building blueprints for optimal Wireless Access Point (WAP) placement, allowing for remote assessments without physical site visits. While it may lack the precision of passive or active surveys, it offers a cost-effective and time-efficient solution for planning wireless networks. This method is particularly useful for organizations looking to streamline their deployment processes.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Predictive Survey",
      "timestamp_range": ""
    },
    {
      "chunk_id": "8.4.2_chunk_6",
      "content": "That's it for this lesson. In this lesson, we talked about the process of installing a wireless network. Before we can do anything, we need to know the usage needs of the network. Then you can perform passive, active, and predictive site surveys to determine how to install your WAPs.",
      "summary": "This lesson covers the essential steps for installing a wireless network, emphasizing the importance of understanding the network's usage needs. It introduces the concepts of passive, active, and predictive site surveys, which are critical for determining optimal placement of Wireless Access Points (WAPs) to ensure effective coverage and performance. Practical application of these surveys helps in designing a robust wireless network tailored to specific requirements.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.4.2",
        "title": "Wireless Installation",
        "content_type": "video",
        "filename": "8.4.2_Wireless_Installation_[video].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.4.2_Wireless_Installation_[video].txt",
        "word_count": 705,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 6
}