{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.5.2",
    "title": "Wireless Attack Facts",
    "content_type": "text",
    "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
    "word_count": 1885,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Wireless attacks Rogue access points RFID/NFC attacks Wireless Attacks Wireless networks present particular security challenges and are frequently the vector for various types of attacks. Many organizations have set up and configured wireless networks, and if not configured properly, these networks can be susceptible to attack. Wi-Fi Attack Description Wireless denial-of-service A wireless denial-of-service (DoS) attack is usually designed to prevent clients from connecting to the legitimate access point. A wireless network can be disrupted by interference from other radio sources. These are often unintentional, but it is also possible for an attacker to purposefully jam the legitimate network by setting up a rogue access point with a stronger signal. Wireless DoS can also target clients. In the normal course of operations, an access point and client use management frames to control connections. A exploits the lack of encryption in management frame traffic to send spoofed frames. One type of disassociation attack injects management frames that spoof the MAC address of a single victim station in a disassociation notification, causing it to be disconnected from the network. Another variant of the attack broadcasts spoofed frames to disconnect all stations. As well as trying to redirect connections to an evil twin, a disassociation attack might also be used in conjunction with a replay attack aimed at recovering the network key. Wireless replay and key recovery Wireless authentication is vulnerable to various types of replay attacks that aim to capture the hashes used when a wireless station associates with an access point. Once the hash is captured, it can be subjected to offline brute force and dictionary cracking. A KRACK attack uses a replay mechanism that targets the WPA and WPA2 4-way handshake. KRACK is effective regardless of whether the authentication mechanism is personal or enterprise. It is important to ensure both clients and access points are fully patched against such attacks. Evil twin attack Rogue APs placed by an attacker can be used to run an evil twin attack. In this attack: The rogue AP is configured to mimic the legitimate network. The attacker uses a jamming or disassociation attack to knock users off the legitimate network. When users reconnect to the network, they connect to the attacker’s AP. The attacker can monitor and capture all data that moves through the rogue AP. To protect against this attack, conduct a radio frequency (RF) noise analysis to detect a malicious rogue AP that uses jamming to force wireless clients to connect to it instead of legitimate APs. Initialization vector (IV) attack An initialization vector is a seed value used in encryption. The seed value and the key are used in an encryption algorithm to generate additional keys or to encrypt data. Wired Equivalent Privacy (WEP) encryption reuses initialization vectors. The reuse of IVs makes it easy for attackers to crack them. This is known as an IV attack. Be aware that: The WEP IV is 24-bits, and the key is 40-bits. This allows for approximately 16 million IVs. An IV is repeated at least once every 4096 packets. Hackers developed programs that flood the network with packets, allowing them to  find matching IVs quickly. Once enough IVs are obtained, the attacker can decrypt the encryption key. WEP encryption can be cracked in as little as 1-2 minutes. Due to the vulnerabilities of WEP, you should no longer use it. Newer standards, such as WPA2 and WPA3, do not use IVs in the encryption process. Jamming attack With wireless networks, interference is a signal that corrupts or destroys the wireless signal sent by APs and other wireless devices. Non-malicious interference includes the following: Electromagnetic interference (EMI) is interference caused by motors, heavy machinery, and fluorescent lights. Radiofrequency interference (RFI) is interference on the radio channel. It is caused by nearby wireless devices using the same channel, cordless phones, or microwave ovens. Adjacent channels on wireless APs have a small degree of overlap. To avoid interference with other wireless APs within the same vicinity, use channels that don't overlap neighboring wireless APs. Some interference is malicious in nature and designed to disrupt wireless network communications. Malicious interference is sometimes referred to as jamming. In a jamming attack, a transmitter is tuned to the same frequency and the same type of modulation as the wireless network. The jamming signal overrides the legitimate wireless network radio signals at the receiving devices. The following list describes different types of jamming signals that can be used to disrupt a Wi-Fi network. Spark jamming is the most effective type of Wi-Fi interference attack. It repeatedly blasts receiving equipment with high-intensity, short-duration RF (radio frequency) bursts at a rapid pace. Experienced RF signal technicians can usually identify this type of attack quickly because of the regular nature of the signal. Random noise jamming produces radio signals using random amplitudes and frequencies. While not as effective as a spark attack, the random noise attack is harder to identify due to the intermittent and random nature of the interference. In fact, this type of signal is frequently mistaken for background radio noise that occurs naturally. Random pulse jamming uses radio signal pulses of random amplitude and frequency to interfere with a Wi-Fi network. Disassociation/deauthentication attack Wireless devices are vulnerable to deauthentication (deauth) and disassociation attacks because the 802.11 standard allows devices to be authenticated with multiple APs at once. When a device connects to a wireless network, special unencrypted management packets are sent back and forth. Deauthentication and disassociation attacks take advantage of these packets to disconnect devices from a network. Be aware that: To execute a deauth attack, the attacker pretends to be the wireless router the device is connected to. The attacker disconnects the device from the network. When the user tries to reconnect, the attacker can intercept the user's information. Disassociation attacks are similar. Instead of disconnecting a user, disassociation tricks the user into giving the fake router responsibility for forwarding packets. Rogue Access Points A rogue access point is one that has been installed on the network without authorization, whether with malicious intent or not. A malicious user can set up such an access point with something as basic as a smartphone with tethering capabilities, and a non-malicious user could enable such an access point by accident. If connected to a local segment, an unauthorized access point creates a backdoor through which to attack the network. A rogue access point masquerading as a legitimate one is called an evil twin. Each network is identified to users by a service set identifier (SSID) name. An evil twin might use typosquatting or SSID stripping to make the rogue network name appear similar to the legitimate one. Alternatively, the attacker might use some DoS technique to overcome the legitimate access point. In the latter case, they could spoof both the SSID and the basic SSID (BSSID). The BSSID is the MAC address of the access point's radio. The evil twin might be able to harvest authentication information from users entering their credentials by mistake and implement a variety of other on-path attacks, including DNS redirection. Surveying Wi-Fi networks using MetaGeek inSSIDer. The Struct-Guest network shown in the first window is the legitimate one and has WPA2 security configured. The evil twin has the same SSID but a different BSSID (MAC address) and open authentication. MetaGeek, Inc. © Copyright 2005-2023 Description A rogue hardware access point can be identified through physical inspections. There are also various Wi-Fi analyzers and wireless intrusion protection systems that can detect rogue access points. These can log the use of typosquatting SSIDs and unknown and duplicate (spoofed) MAC addresses. In an enterprise network, access points are usually connected to switches. Monitoring can detect any that are not and flag them as potential rogues. They may also be able to identify radio hardware and alert if an unauthorized access point brand is detected. Bluetooth Attacks Bluetooth is designed to allow devices to communicate within a personal area network (PAN) of close proximity. PAN devices include cell phones, personal digital assistants (PDAs), printers, mice, and keyboards. Is designed for distances longer than infrared (IR) communication and has lower power consumption. Requires that devices be in discovery mode to find each other and synchronize. Operates in the 2.4 GHz range and uses adaptive frequency hopping (AFH). Eavesdropping is difficult because Bluetooth implements authentication and key derivation with custom algorithms based on the SAFER+ block cipher. It also uses the E0 stream cipher for encrypting packets. Bluetooth is one of the most secure protocols for mobile device communication, but it is susceptible to the following attacks: Bluejacking looks for nearby devices that are in discovery mode and sends unwanted messages. The attacker is unable to steal any data. This attack is more annoying than harmful. Bluesnarfing exploits a vulnerability in the object exchange (OBEX) protocol that allows an attacker to pair to the target device. Once paired, the attacker can view the calendar, emails, text messages, contact lists, and other data on the device. Many Bluetooth devices have built-in features to prevent bluesnarfing, but it is still a known vulnerability. To mitigate the risks of Bluetooth attacks, enable Bluetooth only when needed and make sure discovery mode is turned off except when pairing devices. RFID/NFC Attacks RFID uses radio waves to transmit data from small circuit boards, called RFID tags, to special scanners. There are two types of RFID tags: Active RFID tags have onboard batteries and can send signals over a long distance. Road toll passes and other types of passes use active RFID. Passive RFID is not powered and relies on the energy of the scanner to transmit data. These tags are seen in ID badges, credit cards, and similar devices. RFID Attack Description Eavesdropping\tAn attacker uses an RFID reader to listen to conversations between a tag and the intended reader. Man-in-the-middle (MTM)\tAn attacker intercepts a signal from an RFID tag and then manipulates it before sending it to the intended recipient. This kind of attack is frequently used to take down a system. Denial-of-service (DOS)\tAn attacker blocks radio signals or jams the system with interfering noise. Cloning and spoofing\tAn attacker creates a copy of an existing tag and uses the fake tag to gain access to a secure system. To protect against these attacks, RFID chips often operate at different frequencies. This makes it more difficult for an attacker to find and scan them. Near Field Communication (NFC) is a newer technology that is built on RFID. NFC allows two-way communication between two devices. The devices must be within a few centimeters of each other. Although NFC transmission distances are very short, transmissions are susceptible to several malicious attacks, including: A lost NFC device allows anyone who finds it to access NFC resources. NFC signals can be jammed by malicious interference. NFC devices and readers are susceptible to man-in-the-middle exploits, where an attacker captures transmissions from the reader and forwards them onto the device, potentially reading and modifying data in transit. NFC devices and readers are susceptible to relay attacks. An attacker can capture NFC data in transit and use the information to masquerade as the original device.",
  "chunks": [
    {
      "chunk_id": "8.5.2_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces foundational security concepts essential for protecting information systems. Key topics include risk management, threat analysis, network security, and compliance, alongside practical applications such as implementing security controls and responding to incidents. This course equips learners with the skills needed to identify vulnerabilities and safeguard organizational assets effectively.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.5.2",
        "title": "Wireless Attack Facts",
        "content_type": "text",
        "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
        "word_count": 1885,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.5.2_chunk_2",
      "content": "This lesson covers the following topics: Wireless attacks Rogue access points RFID/NFC attacks Wireless Attacks Wireless networks present particular security challenges and are frequently the vector for various types of attacks. Many organizations have set up and configured wireless networks, and if not configured properly, these networks can be susceptible to attack.",
      "summary": "This lesson highlights the security vulnerabilities associated with wireless networks, including rogue access points and RFID/NFC attacks. It emphasizes the importance of proper configuration to mitigate these risks, as improperly secured wireless networks can serve as gateways for various types of cyberattacks. Understanding these threats is crucial for organizations to protect their wireless infrastructure effectively.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.5.2",
        "title": "Wireless Attack Facts",
        "content_type": "text",
        "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
        "word_count": 1885,
        "has_content": true
      },
      "section_header": "8.5.2 Wireless Attack Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.5.2_chunk_3",
      "content": "Wi-Fi Attack Description Wireless denial-of-service A wireless denial-of-service (DoS) attack is usually designed to prevent clients from connecting to the legitimate access point. A wireless network can be disrupted by interference from other radio sources. These are often unintentional, but it is also possible for an attacker to purposefully jam the legitimate network by setting up a rogue access point with a stronger signal. Wireless DoS can also target clients. In the normal course of operations, an access point and client use management frames to control connections. A exploits the lack of encryption in management frame traffic to send spoofed frames. One type of disassociation attack injects management frames that spoof the MAC address of a single victim station in a disassociation notification, causing it to be disconnected from the network. Another variant of the attack broadcasts spoofed frames to disconnect all stations. As well as trying to redirect connections to an evil twin, a disassociation attack might also be used in conjunction with a replay attack aimed at recovering the network key. Wireless replay and key recovery Wireless authentication is vulnerable to various types of replay attacks that aim to capture the hashes used when a wireless station associates with an access point. Once the hash is captured, it can be subjected to offline brute force and dictionary cracking. A KRACK attack uses a replay mechanism that targets the WPA and WPA2 4-way handshake. KRACK is effective regardless of whether the authentication mechanism is personal or enterprise. It is important to ensure both clients and access points are fully patched against such attacks. Evil twin attack Rogue APs placed by an attacker can be used to run an evil twin attack. In this attack: The rogue AP is configured to mimic the legitimate network. The attacker uses a jamming or disassociation attack to knock users off the legitimate network. When users reconnect to the network, they connect to the attacker’s AP. The attacker can monitor and capture all data that moves through the rogue AP. To protect against this attack, conduct a radio frequency (RF) noise analysis to detect a malicious rogue AP that uses jamming to force wireless clients to connect to it instead of legitimate APs. Initialization vector (IV) attack An initialization vector is a seed value used in encryption. The seed value and the key are used in an encryption algorithm to generate additional keys or to encrypt data. Wired Equivalent Privacy (WEP) encryption reuses initialization vectors. The reuse of IVs makes it easy for attackers to crack them. This is known as an IV attack. Be aware that: The WEP IV is 24-bits, and the key is 40-bits. This allows for approximately 16 million IVs. An IV is repeated at least once every 4096 packets. Hackers developed programs that flood the network with packets, allowing them to  find matching IVs quickly. Once enough IVs are obtained, the attacker can decrypt the encryption key. WEP encryption can be cracked in as little as 1-2 minutes. Due to the vulnerabilities of WEP, you should no longer use it. Newer standards, such as WPA2 and WPA3, do not use IVs in the encryption process. Jamming attack With wireless networks, interference is a signal that corrupts or destroys the wireless signal sent by APs and other wireless devices. Non-malicious interference includes the following: Electromagnetic interference (EMI) is interference caused by motors, heavy machinery, and fluorescent lights. Radiofrequency interference (RFI) is interference on the radio channel. It is caused by nearby wireless devices using the same channel, cordless phones, or microwave ovens. Adjacent channels on wireless APs have a small degree of overlap. To avoid interference with other wireless APs within the same vicinity, use channels that don't overlap neighboring wireless APs. Some interference is malicious in nature and designed to disrupt wireless network communications. Malicious interference is sometimes referred to as jamming. In a jamming attack, a transmitter is tuned to the same frequency and the same type of modulation as the wireless network. The jamming signal overrides the legitimate wireless network radio signals at the receiving devices. The following list describes different types of jamming signals that can be used to disrupt a Wi-Fi network. Spark jamming is the most effective type of Wi-Fi interference attack. It repeatedly blasts receiving equipment with high-intensity, short-duration RF (radio frequency) bursts at a rapid pace. Experienced RF signal technicians can usually identify this type of attack quickly because of the regular nature of the signal. Random noise jamming produces radio signals using random amplitudes and frequencies. While not as effective as a spark attack, the random noise attack is harder to identify due to the intermittent and random nature of the interference. In fact, this type of signal is frequently mistaken for background radio noise that occurs naturally. Random pulse jamming uses radio signal pulses of random amplitude and frequency to interfere with a Wi-Fi network. Disassociation/deauthentication attack Wireless devices are vulnerable to deauthentication (deauth) and disassociation attacks because the 802.11 standard allows devices to be authenticated with multiple APs at once. When a device connects to a wireless network, special unencrypted management packets are sent back and forth. Deauthentication and disassociation attacks take advantage of these packets to disconnect devices from a network. Be aware that: To execute a deauth attack, the attacker pretends to be the wireless router the device is connected to. The attacker disconnects the device from the network. When the user tries to reconnect, the attacker can intercept the user's information. Disassociation attacks are similar. Instead of disconnecting a user, disassociation tricks the user into giving the fake router responsibility for forwarding packets. Rogue Access Points A rogue access point is one that has been installed on the network without authorization, whether with malicious intent or not. A malicious user can set up such an access point with something as basic as a smartphone with tethering capabilities, and a non-malicious user could enable such an access point by accident. If connected to a local segment, an unauthorized access point creates a backdoor through which to attack the network. A rogue access point masquerading as a legitimate one is called an evil twin. Each network is identified to users by a service set identifier (SSID) name. An evil twin might use typosquatting or SSID stripping to make the rogue network name appear similar to the legitimate one. Alternatively, the attacker might use some DoS technique to overcome the legitimate access point. In the latter case, they could spoof both the SSID and the basic SSID (BSSID). The BSSID is the MAC address of the access point's radio. The evil twin might be able to harvest authentication information from users entering their credentials by mistake and implement a variety of other on-path attacks, including DNS redirection. Surveying Wi-Fi networks using MetaGeek inSSIDer. The Struct-Guest network shown in the first window is the legitimate one and has WPA2 security configured. The evil twin has the same SSID but a different BSSID (MAC address) and open authentication. MetaGeek, Inc. © Copyright 2005-2023 Description A rogue hardware access point can be identified through physical inspections. There are also various Wi-Fi analyzers and wireless intrusion protection systems that can detect rogue access points. These can log the use of typosquatting SSIDs and unknown and duplicate (spoofed) MAC addresses. In an enterprise network, access points are usually connected to switches. Monitoring can detect any that are not and flag them as potential rogues. They may also be able to identify radio hardware and alert if an unauthorized access point brand is detected. Bluetooth Attacks Bluetooth is designed to allow devices to communicate within a personal area network (PAN) of close proximity. PAN devices include cell phones, personal digital assistants (PDAs), printers, mice, and keyboards.",
      "summary": "The CompTIA Security+ course covers various wireless attacks, including wireless denial-of-service (DoS), evil twin attacks, and initialization vector (IV) attacks, emphasizing the vulnerabilities of wireless networks. Key concepts include the exploitation of unencrypted management frames, the risks associated with outdated encryption standards like WEP, and the importance of patching devices against known vulnerabilities like KRACK. Practical applications involve using tools for RF noise analysis, monitoring for rogue access points, and implementing robust security measures to protect against these threats.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.5.2",
        "title": "Wireless Attack Facts",
        "content_type": "text",
        "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
        "word_count": 1885,
        "has_content": true
      },
      "section_header": "The following table explains common wireless attacks:",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.5.2_chunk_4",
      "content": "Is designed for distances longer than infrared (IR) communication and has lower power consumption. Requires that devices be in discovery mode to find each other and synchronize. Operates in the 2.4 GHz range and uses adaptive frequency hopping (AFH). Eavesdropping is difficult because Bluetooth implements authentication and key derivation with custom algorithms based on the SAFER+ block cipher. It also uses the E0 stream cipher for encrypting packets. Bluetooth is one of the most secure protocols for mobile device communication, but it is susceptible to the following attacks: Bluejacking looks for nearby devices that are in discovery mode and sends unwanted messages. The attacker is unable to steal any data. This attack is more annoying than harmful. Bluesnarfing exploits a vulnerability in the object exchange (OBEX) protocol that allows an attacker to pair to the target device. Once paired, the attacker can view the calendar, emails, text messages, contact lists, and other data on the device. Many Bluetooth devices have built-in features to prevent bluesnarfing, but it is still a known vulnerability. To mitigate the risks of Bluetooth attacks, enable Bluetooth only when needed and make sure discovery mode is turned off except when pairing devices. RFID/NFC Attacks RFID uses radio waves to transmit data from small circuit boards, called RFID tags, to special scanners. There are two types of RFID tags: Active RFID tags have onboard batteries and can send signals over a long distance. Road toll passes and other types of passes use active RFID. Passive RFID is not powered and relies on the energy of the scanner to transmit data. These tags are seen in ID badges, credit cards, and similar devices.",
      "summary": "The Bluetooth section of the CompTIA Security+ course covers the protocol's low power consumption, adaptive frequency hopping, and robust security features, including authentication and encryption methods. It highlights potential vulnerabilities such as Bluejacking and Bluesnarfing, emphasizing the importance of disabling discovery mode and enabling Bluetooth only when necessary to mitigate risks. Additionally, the course introduces RFID technology, differentiating between active and passive RFID tags and their applications in various devices.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.5.2",
        "title": "Wireless Attack Facts",
        "content_type": "text",
        "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
        "word_count": 1885,
        "has_content": true
      },
      "section_header": "Bluetooth:",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.5.2_chunk_5",
      "content": "RFID Attack Description Eavesdropping\tAn attacker uses an RFID reader to listen to conversations between a tag and the intended reader. Man-in-the-middle (MTM)\tAn attacker intercepts a signal from an RFID tag and then manipulates it before sending it to the intended recipient. This kind of attack is frequently used to take down a system. Denial-of-service (DOS)\tAn attacker blocks radio signals or jams the system with interfering noise. Cloning and spoofing\tAn attacker creates a copy of an existing tag and uses the fake tag to gain access to a secure system. To protect against these attacks, RFID chips often operate at different frequencies. This makes it more difficult for an attacker to find and scan them. Near Field Communication (NFC) is a newer technology that is built on RFID. NFC allows two-way communication between two devices. The devices must be within a few centimeters of each other. Although NFC transmission distances are very short, transmissions are susceptible to several malicious attacks, including: A lost NFC device allows anyone who finds it to access NFC resources. NFC signals can be jammed by malicious interference. NFC devices and readers are susceptible to man-in-the-middle exploits, where an attacker captures transmissions from the reader and forwards them onto the device, potentially reading and modifying data in transit. NFC devices and readers are susceptible to relay attacks. An attacker can capture NFC data in transit and use the information to masquerade as the original device.",
      "summary": "RFID systems face various vulnerabilities, including eavesdropping, man-in-the-middle attacks, denial-of-service, and cloning, which can compromise secure access and system integrity. To mitigate these risks, RFID technology often employs frequency variations, while newer Near Field Communication (NFC) technology, despite its short transmission range, is also susceptible to similar attacks such as lost device exploitation, jamming, and relay attacks. Understanding these threats is crucial for implementing effective security measures in environments utilizing RFID and NFC technologies.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.5.2",
        "title": "Wireless Attack Facts",
        "content_type": "text",
        "filename": "8.5.2_Wireless_Attack_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.5.2_Wireless_Attack_Facts_[text].txt",
        "word_count": 1885,
        "has_content": true
      },
      "section_header": "RFID systems are vulnerable to various kinds of attacks, including:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 5
}