{
  "metadata": {
    "chapter_num": "8",
    "section_num": "8.6.4",
    "title": "Wireless Authentication and Access Methods Facts",
    "content_type": "text",
    "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
    "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
    "word_count": 1338,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Access methods Port security MAC filtering and MAC limiting Access Methods Choose an access method for a wireless network based on the use of the network. The following table describes access methods: Access Method Description Pre-shared key A pre-shared key is a passphrase used to access the wireless network. This is probably the most commonly used access method. Wi-Fi Protected Setup Wi-Fi Protected Setup works only on a network that uses a PSK and WPA2. WPS allows a device to securely connect to a wireless network without typing in the PSK. To do this, you: Push a button on the access point that causes the access point to search for devices in range. Push the WPS button on the device to automatically join it to the access point. If there is no button, enter the eight-digit pin unique to the access point. Some devices and access points can also use Near Field Communication (NFC) during the WPS process to connect to each other. Open network\tAn open network has no authentication at all and allows anyone to connect to the network. This access method should be used only in public places that want to offer free wireless access. Captive portal Many open networks implement a captive portal. Captive portals force a user to view and interact with them before accessing a network. A hotel network is a good example of captive portal use. When using a captive portal: The user connects to the wireless network but is redirected to a captive portal page before internet access is granted. The user might be prompted to agree to the terms and conditions of using the network or even asked to pay a fee before being granted access. To ensure the authentication information being sent is secure, the Extensible Authentication Protocol (EAP) is used. EAP is a framework in which other protocols work. The following table explains EAP and the protocols: Protocol Description Extensible Authentication Protocol EAP is a set of interface standards that allows various authentication methods to be used: EAP supports multiple authentication methods (smart cards, biometrics, and digital certificates). Using EAP, the client and server negotiate the characteristics of authentication. Protected Extensible Authentication Protocol PEAP provides authentication in an SSL/TLS tunnel with a single certificate on the server. PEAP: Creates a secure communication channel for transmitting certificate or login credentials. Enables mutual authentication by requiring the server to prove its identity to the client. Was a collaborative effort between Cisco, Microsoft, and RSA. EAP Flexible Authentication via Secure Tunneling EAP-FAST uses a Protected Access Credential (PAC) to authenticate users. EAP-FAST: Establishes a TLS tunnel in which client authentication credentials are transmitted. Is susceptible to attackers who intercept the Protected Access Credential (PAC) and use it to compromise user credentials. This vulnerability is mitigated by manual PAC provisioning or by using server certificates. Was created by Cisco. EAP Transport Layer Security EAP-TLS uses Transport Layer Security (TLS) and is considered one of the most secure EAP standards available. EAP-TLS: Is widely supported by almost all manufacturers of wireless LAN hardware and software. Requires signed client-side and server-side certificate authority (CA) PKI certificates. Is labor-intensive and expensive to implement. EAP Tunneled Transport Layer Security EAP-TTLS also uses a CA signed certificate. EAP-TTLS: Is an updated version of EAP-TLS. Requires only one CA signed certificate on the server, simplifying the implementation process. Port Security Each wall and switch port represents an opportunity for a threat actor to attach a device to the network. A threat actor who can operate a host with physical access to a network segment can launch a variety of attacks. Access to the physical switch ports and switch hardware should be restricted to authorized staff. To accomplish this, place the switch appliances in secure server rooms and lockable hardware cabinets. To prevent the attachment of unauthorized client devices at unsecured wall ports, the switch port that the wall port cabling connects to can be administratively disabled, or the patch cable can be physically removed from the switch port. Completely disabling ports in this way can introduce a lot of administrative overhead and allow room for error. Also, it doesn't provide complete protection, as an attacker could unplug a device from an enabled port and connect their own machine. Consequently, more sophisticated methods of ensuring  port security have been developed. MAC Filtering and MAC Limiting The network adapter in each host computer is identified by a MAC address. Configuring MAC filtering means a switch port only permits certain MAC addresses to connect. This can be done by creating a list of valid MAC addresses or by specifying a limit to the number of permitted addresses. For example, if port security is enabled with a maximum of two MAC addresses, the switch will record the first two MACs to connect to that port. The switch then drops any traffic from machines with different MAC addresses that try to connect. Configuring ARP inspection on a Cisco switch Courtesy of Cisco Systems, Inc. Unauthorized use not permitted. Description Restricting access by MAC address is difficult to manage and still prone to spoofing. Better security is obtained by forcing computers and users to authenticate before full network access is granted. The IEEE 802.1X Port-based Network Access Control (P NAC) standard allows a switch to require authentication when a host connects to one of its ports. 802.1X uses authentication, authorization, and accounting (AAA) architecture: Supplicant - is the device requesting access, such as a user's PC or laptop. Authenticator - is the switching device (or any type of network access appliance). This does not validate authentication requests directly but acts as a conduit for authentication data. Authentication server - the server that holds or can contact a directory of network objects and validate authentication requests, issue authorizations, and perform accounting of security events. Extensible Authentication Protocol (EAP) - provides a framework for deploying multiple types of authentication methods. It is often used with digital certificates to establish a trust relationship and create a secure tunnel to transmit the user credential or to perform smart-card authentication without a password. Remote Authentication Dial-In User Service (RADIUS) - allows the authenticator and authentication server to communicate authentication and authorization decisions. The authenticator is a RADIUS client; the authentication server is a RADIUS server. When a host connects to an 802.1X-enabled switch port, the switch opens the port for the EAP over LAN (EAPoL) protocol only. The switch port only allows full data access when the host has been authenticated. The switch receives an EAP packet with the supplicant's credentials. These are encrypted and cannot be read by the switch. The switch uses the RADIUS protocol to send the EAP packet to the authentication server. The authentication server can access the directory of user accounts and can validate the credential. If authentication is successful, it informs the switch that full network access can be granted. IEEE 802.1X Port-based Network Access Control with RADIUS and EAP authentication Description Some hosts are so security-critical that it is unsafe to connect them to any type of network. One example is the root certification authority in PKI. Another example is a host used to analyze malware execution. A host not physically connected to any network is said to be air-gapped. It is also possible to configure an air-gapped network. This means that hosts within the air-gapped network can communicate, but there is no cabled or wireless connection to any other network. Military bases, government sites, and industrial facilities use air-gapped networks. Physically isolating a host or group of hosts improves security but also incurs significant management challenges. Device administration has to be performed at a local terminal. Any updates or installs have to be performed using USB or optical media. This media is a potential attack vector and must be scanned before allowing its use on an air-gapped host.",
  "chunks": [
    {
      "chunk_id": "8.6.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces fundamental security concepts essential for protecting information systems. Key topics include risk management, network security, cryptography, and incident response, providing a comprehensive understanding of security protocols and best practices. Practical applications emphasize real-world scenarios, equipping learners with the skills to identify vulnerabilities and implement effective security measures.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_2",
      "content": "This lesson covers the following topics: Access methods Port security MAC filtering and MAC limiting Access Methods Choose an access method for a wireless network based on the use of the network. The following table describes access methods: Access Method Description Pre-shared key",
      "summary": "This lesson focuses on wireless authentication and access methods, emphasizing the importance of selecting appropriate access methods based on network usage. Key concepts include port security, MAC filtering, and MAC limiting, which enhance network security by controlling device access. Practical applications involve implementing pre-shared keys and other access methods to safeguard wireless networks against unauthorized access.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "8.6.4 Wireless Authentication and Access Methods Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_3",
      "content": "A pre-shared key is a passphrase used to access the wireless network. This is probably the most commonly used access method. Wi-Fi Protected Setup",
      "summary": "A pre-shared key (PSK) is a passphrase utilized for accessing wireless networks, serving as a widely adopted method for securing Wi-Fi connections. It is often implemented alongside Wi-Fi Protected Setup (WPS) to simplify the connection process for users. Understanding PSK is crucial for maintaining network security and preventing unauthorized access.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(PSK)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_4",
      "content": "Wi-Fi Protected Setup works only on a network that uses a PSK and WPA2. WPS allows a device to securely connect to a wireless network without typing in the PSK. To do this, you: Push a button on the access point that causes the access point to search for devices in range. Push the WPS button on the device to automatically join it to the access point. If there is no button, enter the eight-digit pin unique to the access point.",
      "summary": "Wi-Fi Protected Setup (WPS) facilitates secure connections to a wireless network using a Pre-Shared Key (PSK) and WPA2 without manually entering the PSK. Users can connect devices by either pushing a button on the access point and the device or by entering a unique eight-digit PIN. This simplifies the process of adding devices to a secure network while maintaining security standards.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(WPS)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_5",
      "content": "Some devices and access points can also use Near Field Communication (NFC) during the WPS process to connect to each other. Open network\tAn open network has no authentication at all and allows anyone to connect to the network. This access method should be used only in public places that want to offer free wireless access. Captive portal Many open networks implement a captive portal. Captive portals force a user to view and interact with them before accessing a network. A hotel network is a good example of captive portal use. When using a captive portal: The user connects to the wireless network but is redirected to a captive portal page before internet access is granted. The user might be prompted to agree to the terms and conditions of using the network or even asked to pay a fee before being granted access. To ensure the authentication information being sent is secure, the Extensible Authentication Protocol (EAP) is used. EAP is a framework in which other protocols work. The following table explains EAP and the protocols: Protocol Description Extensible Authentication Protocol",
      "summary": "The CompTIA Security+ course highlights key security concepts related to network access, including the use of Near Field Communication (NFC) during Wi-Fi Protected Setup (WPS) and the characteristics of open networks, which lack authentication and are suitable for public use. It also discusses captive portals, which require user interaction before granting internet access, often seen in hotel networks, and emphasizes the importance of secure authentication through the Extensible Authentication Protocol (EAP) framework. Understanding these elements is crucial for implementing secure wireless access in various environments.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "Note:",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_6",
      "content": "EAP is a set of interface standards that allows various authentication methods to be used: EAP supports multiple authentication methods (smart cards, biometrics, and digital certificates). Using EAP, the client and server negotiate the characteristics of authentication. Protected Extensible Authentication Protocol",
      "summary": "EAP (Extensible Authentication Protocol) is a framework that facilitates various authentication methods, including smart cards, biometrics, and digital certificates, allowing for flexible security implementations. It enables clients and servers to negotiate authentication characteristics, enhancing secure access in network environments. EAP is essential for ensuring robust authentication in wireless and wired networks.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(EAP)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_7",
      "content": "PEAP provides authentication in an SSL/TLS tunnel with a single certificate on the server. PEAP: Creates a secure communication channel for transmitting certificate or login credentials. Enables mutual authentication by requiring the server to prove its identity to the client. Was a collaborative effort between Cisco, Microsoft, and RSA. EAP Flexible Authentication via Secure Tunneling",
      "summary": "PEAP (Protected Extensible Authentication Protocol) establishes a secure communication channel using SSL/TLS, allowing for the safe transmission of credentials through a single server certificate. It enhances security by enabling mutual authentication, where the server verifies its identity to the client. Developed collaboratively by Cisco, Microsoft, and RSA, PEAP is part of the EAP (Extensible Authentication Protocol) framework, emphasizing secure authentication in wireless networks.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(PEAP)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_8",
      "content": "EAP-FAST uses a Protected Access Credential (PAC) to authenticate users. EAP-FAST: Establishes a TLS tunnel in which client authentication credentials are transmitted. Is susceptible to attackers who intercept the Protected Access Credential (PAC) and use it to compromise user credentials. This vulnerability is mitigated by manual PAC provisioning or by using server certificates. Was created by Cisco. EAP Transport Layer Security",
      "summary": "EAP-FAST (Flexible Authentication via Secure Tunneling) utilizes a Protected Access Credential (PAC) for user authentication, establishing a secure TLS tunnel for transmitting credentials. However, it is vulnerable to attacks that intercept the PAC, which can compromise user credentials; this risk can be mitigated through manual PAC provisioning or server certificates. Developed by Cisco, EAP-FAST is an important protocol in secure wireless communications.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(EAP-FAST)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_9",
      "content": "EAP-TLS uses Transport Layer Security (TLS) and is considered one of the most secure EAP standards available. EAP-TLS: Is widely supported by almost all manufacturers of wireless LAN hardware and software. Requires signed client-side and server-side certificate authority (CA) PKI certificates. Is labor-intensive and expensive to implement. EAP Tunneled Transport Layer Security",
      "summary": "EAP-TLS (Extensible Authentication Protocol-Transport Layer Security) is a highly secure authentication standard that utilizes TLS, requiring both client and server to have signed PKI certificates. While it is widely supported across various wireless LAN hardware and software, its implementation can be labor-intensive and costly. EAP-TLS is particularly suited for environments where strong security measures are essential.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(EAP-TLS)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_10",
      "content": "EAP-TTLS also uses a CA signed certificate. EAP-TTLS: Is an updated version of EAP-TLS. Requires only one CA signed certificate on the server, simplifying the implementation process. Port Security Each wall and switch port represents an opportunity for a threat actor to attach a device to the network. A threat actor who can operate a host with physical access to a network segment can launch a variety of attacks. Access to the physical switch ports and switch hardware should be restricted to authorized staff. To accomplish this, place the switch appliances in secure server rooms and lockable hardware cabinets. To prevent the attachment of unauthorized client devices at unsecured wall ports, the switch port that the wall port cabling connects to can be administratively disabled, or the patch cable can be physically removed from the switch port. Completely disabling ports in this way can introduce a lot of administrative overhead and allow room for error. Also, it doesn't provide complete protection, as an attacker could unplug a device from an enabled port and connect their own machine. Consequently, more sophisticated methods of ensuring  port security have been developed. MAC Filtering and MAC Limiting The network adapter in each host computer is identified by a MAC address. Configuring MAC filtering means a switch port only permits certain MAC addresses to connect. This can be done by creating a list of valid MAC addresses or by specifying a limit to the number of permitted addresses. For example, if port security is enabled with a maximum of two MAC addresses, the switch will record the first two MACs to connect to that port. The switch then drops any traffic from machines with different MAC addresses that try to connect. Configuring ARP inspection on a Cisco switch Courtesy of Cisco Systems, Inc. Unauthorized use not permitted. Description Restricting access by MAC address is difficult to manage and still prone to spoofing. Better security is obtained by forcing computers and users to authenticate before full network access is granted. The IEEE 802.1X Port-based Network Access Control (P NAC) standard allows a switch to require authentication when a host connects to one of its ports. 802.1X uses authentication, authorization, and accounting (AAA) architecture: Supplicant - is the device requesting access, such as a user's PC or laptop. Authenticator - is the switching device (or any type of network access appliance). This does not validate authentication requests directly but acts as a conduit for authentication data. Authentication server - the server that holds or can contact a directory of network objects and validate authentication requests, issue authorizations, and perform accounting of security events.",
      "summary": "EAP-TTLS simplifies secure network access by requiring only one CA-signed certificate on the server, enhancing implementation efficiency compared to EAP-TLS. Port security measures, including physical access restrictions, MAC filtering, and the IEEE 802.1X standard, are essential to prevent unauthorized device connections and ensure that only authenticated users gain full network access. These methods collectively help mitigate risks associated with physical network vulnerabilities and unauthorized access attempts.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "(EAP-TTLS)",
      "timestamp_range": null
    },
    {
      "chunk_id": "8.6.4_chunk_11",
      "content": "Extensible Authentication Protocol (EAP) - provides a framework for deploying multiple types of authentication methods. It is often used with digital certificates to establish a trust relationship and create a secure tunnel to transmit the user credential or to perform smart-card authentication without a password. Remote Authentication Dial-In User Service (RADIUS) - allows the authenticator and authentication server to communicate authentication and authorization decisions. The authenticator is a RADIUS client; the authentication server is a RADIUS server. When a host connects to an 802.1X-enabled switch port, the switch opens the port for the EAP over LAN (EAPoL) protocol only. The switch port only allows full data access when the host has been authenticated. The switch receives an EAP packet with the supplicant's credentials. These are encrypted and cannot be read by the switch. The switch uses the RADIUS protocol to send the EAP packet to the authentication server. The authentication server can access the directory of user accounts and can validate the credential. If authentication is successful, it informs the switch that full network access can be granted. IEEE 802.1X Port-based Network Access Control with RADIUS and EAP authentication Description Some hosts are so security-critical that it is unsafe to connect them to any type of network. One example is the root certification authority in PKI. Another example is a host used to analyze malware execution. A host not physically connected to any network is said to be air-gapped. It is also possible to configure an air-gapped network. This means that hosts within the air-gapped network can communicate, but there is no cabled or wireless connection to any other network. Military bases, government sites, and industrial facilities use air-gapped networks. Physically isolating a host or group of hosts improves security but also incurs significant management challenges. Device administration has to be performed at a local terminal. Any updates or installs have to be performed using USB or optical media. This media is a potential attack vector and must be scanned before allowing its use on an air-gapped host.",
      "summary": "The 802.1X standard utilizes Extensible Authentication Protocol (EAP) and Remote Authentication Dial-In User Service (RADIUS) to establish secure network access control through authentication and authorization. EAP supports various authentication methods, often using digital certificates, while RADIUS facilitates communication between the authenticator and authentication server to validate user credentials. Additionally, air-gapped networks enhance security by isolating critical hosts from external connections, though they present unique management challenges due to the need for local administration and secure media handling.",
      "metadata": {
        "chapter_num": "8",
        "section_num": "8.6.4",
        "title": "Wireless Authentication and Access Methods Facts",
        "content_type": "text",
        "filename": "8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "file_path": "data_raw/08_Network_and_Endpoint_Security/8.6.4_Wireless_Authentication_and_Access_Methods_Facts_[text].txt",
        "word_count": 1338,
        "has_content": true
      },
      "section_header": "The 802.1X standard is implemented by two protocols:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 11
}