{
  "metadata": {
    "chapter_num": "2",
    "section_num": "2.2.4",
    "title": "Social Engineering Techniques Facts",
    "content_type": "text",
    "filename": "2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
    "word_count": 1558,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of employees and contractors. A person with permissions on the system is a potential target of manipulative threat actor techniques known as social engineering. Human vectors Impersonation and pretexting Phishing and pharming Typosquatting Business email compromise Brand impersonation and disinformation Watering hole attack Human Vectors People—employees, contractors, suppliers, and customers—operating computers and accounts are a part of the attack surface of any organization. Collectively, they are referred to as the human vector. Cybercriminals will attempt to exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or spread malware. Being able to compare and contrast social engineering techniques will help you lead security awareness training and develop policies and other security controls to mitigate these risks. Impersonation and Pretexting Impersonation simply means pretending to be someone else. It is one of the basic social engineering techniques. Impersonation is possible when the target cannot easily verify the attacker's identity, such as over the phone or via an email message. A threat actor will typically use one of two approaches: Persuasive/consensus/liking — convince the target that the request is a natural one and would be impolite or somehow \"odd\" to refuse. Coercion/threat/urgency — intimidate the target with a bogus appeal to authority or penalty, such as getting fired or not acting quickly enough to prevent some dire outcome. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password. Do you really know who's on the other end of the line? Image © 123RF.com Description The use of a carefully crafted story with convincing or intimidating details is referred to as pretexting. Making a convincing impersonation to either charm or intimidate a target usually depends on the attacker obtaining privileged information about the organization. For example, when the attacker impersonates a member of the organization's IT support team, the attack will be more effective with the identity details of the person being impersonated and the target. Some social engineering techniques are dedicated to obtaining this type of intelligence as a reconnaissance activity. As most companies are set up toward customer service rather than security, this information is typically quite easy to come by. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation. Phishing and Pharming Phishing is a combination of social engineering and spoofing. It persuades or tricks the target into interacting with a malicious resource disguised as a trusted one, traditionally using email as the vector. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection by the attacker. Other types of phishing campaigns use a spoof website set up to imitate a bank or e-commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the genuine website to inform them that their account must be updated or with a hoax alert or alarm, supplying a disguised link that actually leads to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured. Example phishing email. On the right, you can see the message in its true form as the mail client has stripped out the formatting (shown on the left) designed to disguise the nature of the links. Description Phishing refers specifically to email or text message threat vectors. The same sort of attack can be performed over other types of media: Vishing — a phishing attack conducted through a voice channel (telephone or VoIP, for instance). For example, targets could be called by someone purporting to represent their bank, asking them to verify a recent credit card transaction and requesting their security details. It can be much more difficult for someone to refuse a request made in a phone call than one made in an email. SMiShing — a phishing attack that uses Simple Message Service (SMS) text communications as the vector. Rapid improvements in deep fake technology are likely to make phishing attempts via voice and even video messaging more prevalent in the future. Direct messages to a single contact have a high chance of failure. Other social engineering techniques still use spoofed resources, such as fake sites and login pages, but rely on redirection or passive methods to entrap victims. A pharming attack redirects users from a legitimate website to a malicious one. Rather than using social engineering techniques to trick the user, pharming relies on corrupting how the victim's computer performs internet name resolution so that they are redirected from the genuine site to the malicious one. For example, if mybank.foo should point to the IP address 2.2.2.2, a pharming attack would corrupt the name resolution process to make it point to IP address 6.6.6.6. Typosquatting Phishing and pharming both depend on impersonation to succeed. The spoofed message or site must appear to derive from a source that the target trusts. A threat actor can use various inconsistencies in how the message's source is represented in a mail client to trick the target into trusting the message source. Email client software does not always identify the actual email address used to send the message. Instead, it displays a \"From\" field where a threat actor can add an arbitrary value. This technique is less common now as filtering software can be configured to alert the user to any discrepancy between the actual and claimed sender addresses. Typosquatting means that the threat actor registers a domain name very similar to a real one, such as example.com, hoping that users will not notice the difference and assume they are browsing a trusted site or receiving email from a known source. These are also referred to as cousin, lookalike, or doppelganger domains. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it. Business Email Compromise Where phishing is typically associated with mass mailer attacks,  business email compromise refers to a sophisticated campaign that targets a specific individual within a company, typically an executive or senior manager. The threat actor poses as a colleague, business partner, or vendor. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them. They are unlikely to use obvious features of mass mailer phishing messages such as spoofed links or malware file attachments. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. Some sources use the term \"business email compromise\" to mean an attack with a specific financial motivation, where the objective is to persuade a budget holder to authorize a fraudulent payment or wire transfer. Similar terminology for highly targeted attacks includes spear phishing, whaling, CEO fraud (impersonating the CEO), and angler phishing (using social media as the vector). Brand Impersonation and Disinformation Brand impersonation means the threat actor commits resources to accurately duplicating a company's logos and formatting (fonts, colors, and heading/body paragraph styles) to make a phishing message or pharming website a visually compelling fake. The threat actor could even mimic the style or tone of email communications or website copy. They could try to get a phishing site listed high in search results using realistic content. Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation. Watering Hole Attack A  watering hole attack relies on a group of targets that use an unsecured third-party website. For example, staff running an international e-commerce site might use a local pizza delivery firm. A threat actor might discover this fact through social engineering or other reconnaissance of the target. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company systems. It is also important for everyone to be aware of what they post on their own social media platforms. That information can also be used to create more believable impersonations or attacks. As artificial intelligence, machine learning, or other technologies improve, they can be used to create what’s known as deep fakes. Deep fakes create media that looks and or sounds like someone making statements that the person did not make or doing something in a picture or video that did not happen.",
  "chunks": [
    {
      "chunk_id": "2.2.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.4",
        "title": "Social Engineering Techniques Facts",
        "content_type": "text",
        "filename": "2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "word_count": 1558,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "2.2.4_chunk_2",
      "content": "Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system. This knowledge is not only stored on computer disks; it also exists in the minds of employees and contractors. A person with permissions on the system is a potential target of manipulative threat actor techniques known as social engineering.",
      "summary": "2.2.4 Social Engineering Techniques Facts: Adversaries can use a diverse range of techniques to compromise a security system. A prerequisite of many types of attacks is to obtain information about the network and security system.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.4",
        "title": "Social Engineering Techniques Facts",
        "content_type": "text",
        "filename": "2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "word_count": 1558,
        "has_content": true
      },
      "section_header": "2.2.4 Social Engineering Techniques Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "2.2.4_chunk_3",
      "content": "Human vectors Impersonation and pretexting Phishing and pharming Typosquatting Business email compromise Brand impersonation and disinformation Watering hole attack Human Vectors People—employees, contractors, suppliers, and customers—operating computers and accounts are a part of the attack surface of any organization. Collectively, they are referred to as the human vector. Cybercriminals will attempt to exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or spread malware. Being able to compare and contrast social engineering techniques will help you lead security awareness training and develop policies and other security controls to mitigate these risks. Impersonation and Pretexting Impersonation simply means pretending to be someone else. It is one of the basic social engineering techniques. Impersonation is possible when the target cannot easily verify the attacker's identity, such as over the phone or via an email message. A threat actor will typically use one of two approaches: Persuasive/consensus/liking — convince the target that the request is a natural one and would be impolite or somehow \"odd\" to refuse. Coercion/threat/urgency — intimidate the target with a bogus appeal to authority or penalty, such as getting fired or not acting quickly enough to prevent some dire outcome. The classic impersonation attack is for the social engineer to phone into a department, claim they have to adjust something on the user's system remotely, and then get the user to reveal their password. Do you really know who's on the other end of the line? Image © 123RF.com Description The use of a carefully crafted story with convincing or intimidating details is referred to as pretexting. Making a convincing impersonation to either charm or intimidate a target usually depends on the attacker obtaining privileged information about the organization. For example, when the attacker impersonates a member of the organization's IT support team, the attack will be more effective with the identity details of the person being impersonated and the target. Some social engineering techniques are dedicated to obtaining this type of intelligence as a reconnaissance activity. As most companies are set up toward customer service rather than security, this information is typically quite easy to come by. Information that might seem innocuous—such as department employee lists, job titles, phone numbers, diaries, invoices, or purchase orders—can help an attacker penetrate an organization through impersonation. Phishing and Pharming Phishing is a combination of social engineering and spoofing. It persuades or tricks the target into interacting with a malicious resource disguised as a trusted one, traditionally using email as the vector. A phishing message might try to convince the user to perform some action, such as installing disguised malware or allowing a remote access connection by the attacker. Other types of phishing campaigns use a spoof website set up to imitate a bank or e-commerce site, or some other web resource that should be trusted by the target. The attacker then emails users of the genuine website to inform them that their account must be updated or with a hoax alert or alarm, supplying a disguised link that actually leads to the spoofed site. When the user authenticates with the spoofed site, their login credentials are captured. Example phishing email. On the right, you can see the message in its true form as the mail client has stripped out the formatting (shown on the left) designed to disguise the nature of the links. Description Phishing refers specifically to email or text message threat vectors. The same sort of attack can be performed over other types of media: Vishing — a phishing attack conducted through a voice channel (telephone or VoIP, for instance). For example, targets could be called by someone purporting to represent their bank, asking them to verify a recent credit card transaction and requesting their security details. It can be much more difficult for someone to refuse a request made in a phone call than one made in an email. SMiShing — a phishing attack that uses Simple Message Service (SMS) text communications as the vector. Rapid improvements in deep fake technology are likely to make phishing attempts via voice and even video messaging more prevalent in the future. Direct messages to a single contact have a high chance of failure. Other social engineering techniques still use spoofed resources, such as fake sites and login pages, but rely on redirection or passive methods to entrap victims. A pharming attack redirects users from a legitimate website to a malicious one. Rather than using social engineering techniques to trick the user, pharming relies on corrupting how the victim's computer performs internet name resolution so that they are redirected from the genuine site to the malicious one. For example, if mybank.foo should point to the IP address 2.2.2.2, a pharming attack would corrupt the name resolution process to make it point to IP address 6.6.6.6. Typosquatting Phishing and pharming both depend on impersonation to succeed. The spoofed message or site must appear to derive from a source that the target trusts. A threat actor can use various inconsistencies in how the message's source is represented in a mail client to trick the target into trusting the message source. Email client software does not always identify the actual email address used to send the message. Instead, it displays a \"From\" field where a threat actor can add an arbitrary value. This technique is less common now as filtering software can be configured to alert the user to any discrepancy between the actual and claimed sender addresses. Typosquatting means that the threat actor registers a domain name very similar to a real one, such as example.com, hoping that users will not notice the difference and assume they are browsing a trusted site or receiving email from a known source. These are also referred to as cousin, lookalike, or doppelganger domains. Another technique is to register a hijacked subdomain using the primary domain of a trusted cloud provider, such as onmicrosoft.com. If a phishing message appears to come from example.onmicrosoft.com, many users will be inclined to trust it. Business Email Compromise Where phishing is typically associated with mass mailer attacks,  business email compromise refers to a sophisticated campaign that targets a specific individual within a company, typically an executive or senior manager. The threat actor poses as a colleague, business partner, or vendor. The threat actor is likely to perform reconnaissance to obtain a detailed understanding of the target and the best psychological approach and pretexts to trick them. They are unlikely to use obvious features of mass mailer phishing messages such as spoofed links or malware file attachments. To perpetrate this type of high-stakes attack, the threat actor might first try to gain control of a legitimate mail account to send the phishing messages. Some sources use the term \"business email compromise\" to mean an attack with a specific financial motivation, where the objective is to persuade a budget holder to authorize a fraudulent payment or wire transfer. Similar terminology for highly targeted attacks includes spear phishing, whaling, CEO fraud (impersonating the CEO), and angler phishing (using social media as the vector). Brand Impersonation and Disinformation Brand impersonation means the threat actor commits resources to accurately duplicating a company's logos and formatting (fonts, colors, and heading/body paragraph styles) to make a phishing message or pharming website a visually compelling fake. The threat actor could even mimic the style or tone of email communications or website copy. They could try to get a phishing site listed high in search results using realistic content. Disinformation/misinformation tactics could be used to create fake social media posts or referrers (sites that link to the fake site) to boost search ranking. Disinformation refers to a purposeful motivation to deceive. Misinformation refers to repeating false claims or rumors without the intention to deceive. A disinformation campaign might attempt to get others to repeat and amplify the false facts it creates as misinformation. Watering Hole Attack A  watering hole attack relies on a group of targets that use an unsecured third-party website. For example, staff running an international e-commerce site might use a local pizza delivery firm. A threat actor might discover this fact through social engineering or other reconnaissance of the target. An attacker can compromise the pizza delivery firm's website so that it runs exploit code on visitors. They may be able to infect the computers of the e-commerce company's employees and penetrate the e-commerce company systems. It is also important for everyone to be aware of what they post on their own social media platforms. That information can also be used to create more believable impersonations or attacks. As artificial intelligence, machine learning, or other technologies improve, they can be used to create what’s known as deep fakes. Deep fakes create media that looks and or sounds like someone making statements that the person did not make or doing something in a picture or video that did not happen.",
      "summary": "This lesson covers the following topics:: Cybercriminals will attempt to exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or spread malware. Being able to compare and contrast social engineering techniques will help you lead security awareness training and develop policies and other security controls to mitigate these risks.",
      "metadata": {
        "chapter_num": "2",
        "section_num": "2.2.4",
        "title": "Social Engineering Techniques Facts",
        "content_type": "text",
        "filename": "2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/02_Threats_Vulnerabilities_and_Mitigations/2.2.4_Social_Engineering_Techniques_Facts_[text].txt",
        "word_count": 1558,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 3,
  "document_summary": "Social Engineering Techniques Facts (text): A prerequisite of many types of attacks is to obtain information about the network and security system. Cybercriminals will attempt to exploit human psychology and communication channels to gain unauthorized access, steal sensitive information, or spread malware. Being able to compare and contrast social engineering techniques will help you lead security awareness training and develop policies and other security controls to mitigate these risks."
}