{
  "metadata": {
    "chapter_num": "13",
    "section_num": "13.2.1",
    "title": "Personnel Policies",
    "content_type": "video",
    "filename": "13.2.1_Personnel_Policies_[video].txt",
    "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
    "word_count": 1251,
    "has_content": true
  },
  "full_content": "Transcript close interactive script In this lesson, we're going to discuss personnel policies. Employees are a critical part of any successful business, but they also represent one of the greatest risks to your organization's security. Using proper employment practices helps mitigate this risk. They should encompass all aspects of employment, from pre-employment screenings to offboarding. Employee security should start even before an employee starts work. To ensure that a potential employee is a low security risk, an organization should perform a background check. This check may include checking into a person's criminal history, credit history, and employment history. It could also involve drug testing, identity verification, or a review of their social media presence. Once you've decided to hire an individual, you'll need to set up a work environment for them. This process is called onboarding. It primarily involves a lot of HR paperwork, but there are a few onboarding procedures that involve security professionals. When you're setting up the new employee's user accounts, security credentials, and building access, make sure to assign the appropriate access rights. To do this, you'll need to know the new employee's job title, duties, and place in the organizational hierarchy. It's also important that new employees sign necessary forms and documents. A non-disclosure agreement stipulates that employees can't reveal confidential or proprietary information to any non-employee. A non-compete agreement prevents former employees from working for competitors. And an acceptable use policy specifies how employees are allowed to use the information organization's network resources. As we've discussed, employees are a serious security risk. Sometimes they're intentionally trying to cause harm, but more often, they're simply uninformed. One way to help secure your data and your network is to hold regular security trainings for your employees. These trainings should include topics like how to recognize security breaches and exploits when they occur, what to do in the event of a security breach, and sample scenarios with recommended responses. Training should be ongoing and train employees on new security issues and refresh them on older topics. Ideally, you should use a combination of teaching techniques so you have a better chance of engaging everyone and helping them retain information. In addition to classroom training, security methods can be taught through games, simulations, role-based hands-on training, or computer-based training. Onboarding and training provide a great starting point, but you still need ongoing policies to ensure that employee performance and duties are secure. So, how can we better secure our daily operations? First, let's look at separation of duties. Separation of duties restricts the amount of access or influence individuals control, which removes single points of failure within the organization. For example, let's say an employee in accounting approves business expenses, verifies expenditures, signs checks, and withdraws funds. The risk of this employee embezzling company money is significantly multiplied because this one person performs all of these duties. In this situation, this person could easily become a single point of failure. With separation of duties, expenditures and withdrawals should be verified by at least two sets of people. And maybe the CFO should sign the checks instead of the accountant. This way, we can eliminate this single point of failure. You can also enhance security by implementing duty rotations. For example, after a couple of months, each person's responsibility shifts to another person, like a chore chart. So, using our previous example, instead of signing checks, the CFO verifies and approves expenditures, while others handle withdrawals and signing checks. Duty rotations also heighten security by continually monitoring accountability during the rotation process. Now let's move on to the principle of least privilege. The idea behind this principle is that employees only have access to information they absolutely need for their job function. Employees with too much access could either intentionally or unintentionally compromise security. For example, administrative accounts should only be given to people who need them, and this access should only be used by employees who are actively performing administrative duties. A best practice is to log in with a standard user account and then only change to an administrative account to perform a task that requires it. When you're done with that task, you switch back to the standard user account. It's never a good idea to be logged in as an administrator while browsing the web, reading emails, or using social media. An exploit coming through that internet connection could easily obtain elevated privileges on that workstation, which hugely increases the potential for damages. Another practice to increase security is a mandatory vacation policy. The best way to implement mandatory vacations is to require employees to request vacation days in advance, like at the beginning of the year. The benefits of mandatory vacations are twofold. First, they allow employees to take a break from work, rest, and recharge. Second, they provide the security administrator the ability to detect fraudulent activities while employees are away. For example, if you notice that a reoccurring security breach stops while a particular employee is away on vacation, that could help you identify its cause. The last step in employment is offboarding. Whether an employee resigns, retires, or is terminated, offboarding procedures keep the company safe as they depart. First, you should disable or delete that employee's user account. An active, unused account allows easy access to your network. When you delete a user account, be sure not to delete that user's data in the process. Make sure their files are preserved. You want that data available for future use. So you may want to disable former employees' accounts rather than delete them. You should also change security keys and require the return of access tokens, devices, and phones. And when an employee leaves the organization, Human Resources should always conduct an exit interview. During this interview, it's important to address any concerns, dissatisfactions, or feedback from the employee. With this information, you'll have a better idea of why the employee is leaving and be able to address any remaining concerns. This is also a good time to remind the employee of any non-disclosure or non-compete agreements they may have signed during their onboarding process. That's it for this lesson. In this lesson, we discussed the importance of personnel policies during the pre-employment process, onboarding, training, and daily operations, and we finished by discussing offboarding policies that protect the company and mitigate risks.",
  "chunks": [
    {
      "chunk_id": "13.2.1_chunk_1",
      "content": "In this lesson, we're going to discuss personnel policies. Employees are a critical part of any successful business, but they also represent one of the greatest risks to your organization's security. Using proper employment practices helps mitigate this risk. They should encompass all aspects of employment, from pre-employment screenings to offboarding.",
      "summary": "This lesson emphasizes the importance of personnel policies in enhancing organizational security, highlighting that employees can pose significant risks. Effective employment practices, including pre-employment screenings and offboarding procedures, are essential for mitigating these risks and ensuring a secure workplace. Implementing comprehensive personnel policies is crucial for safeguarding sensitive information and maintaining overall security integrity.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_2",
      "content": "Employee security should start even before an employee starts work. To ensure that a potential employee is a low security risk, an organization should perform a background check. This check may include checking into a person's criminal history, credit history, and employment history. It could also involve drug testing, identity verification, or a review of their social media presence.",
      "summary": "Pre-employment security is crucial for organizations to mitigate risks associated with new hires. Conducting thorough background checks—including criminal, credit, and employment history, as well as drug testing and identity verification—helps assess a candidate's security risk. Additionally, reviewing a candidate's social media presence can provide insights into their character and potential fit within the organization.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Pre-Employment",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_3",
      "content": "Once you've decided to hire an individual, you'll need to set up a work environment for them. This process is called onboarding. It primarily involves a lot of HR paperwork, but there are a few onboarding procedures that involve security professionals. When you're setting up the new employee's user accounts, security credentials, and building access, make sure to assign the appropriate access rights. To do this, you'll need to know the new employee's job title, duties, and place in the organizational hierarchy. It's also important that new employees sign necessary forms and documents. A non-disclosure agreement stipulates that employees can't reveal confidential or proprietary information to any non-employee. A non-compete agreement prevents former employees from working for competitors. And an acceptable use policy specifies how employees are allowed to use the information organization's network resources.",
      "summary": "Onboarding involves setting up a new employee's work environment, which includes completing HR paperwork and establishing security protocols. Key tasks for security professionals include creating user accounts, assigning access rights based on job roles, and ensuring new hires sign essential agreements such as non-disclosure, non-compete, and acceptable use policies. These steps are crucial for protecting organizational information and maintaining a secure work environment.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Onboarding",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_4",
      "content": "As we've discussed, employees are a serious security risk. Sometimes they're intentionally trying to cause harm, but more often, they're simply uninformed. One way to help secure your data and your network is to hold regular security trainings for your employees. These trainings should include topics like how to recognize security breaches and exploits when they occur, what to do in the event of a security breach, and sample scenarios with recommended responses. Training should be ongoing and train employees on new security issues and refresh them on older topics. Ideally, you should use a combination of teaching techniques so you have a better chance of engaging everyone and helping them retain information. In addition to classroom training, security methods can be taught through games, simulations, role-based hands-on training, or computer-based training.",
      "summary": "Regular security training for employees is essential to mitigate risks associated with human error and intentional harm. Training should cover recognizing security breaches, appropriate responses, and include ongoing education on new and existing security issues through diverse teaching methods like simulations and hands-on activities. Engaging training approaches enhance retention and ensure that employees are well-prepared to protect the organization's data and network.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Training",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_5",
      "content": "Onboarding and training provide a great starting point, but you still need ongoing policies to ensure that employee performance and duties are secure.",
      "summary": "The Daily Operations section emphasizes the importance of continuous security policies beyond initial onboarding and training to maintain employee performance and secure duties. It highlights the need for regular updates and reinforcement of security practices to adapt to evolving threats and ensure a secure organizational environment. Practical applications include implementing ongoing training programs and establishing clear security protocols for daily operations.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Daily Operations",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_6",
      "content": "So, how can we better secure our daily operations? First, let's look at separation of duties. Separation of duties restricts the amount of access or influence individuals control, which removes single points of failure within the organization. For example, let's say an employee in accounting approves business expenses, verifies expenditures, signs checks, and withdraws funds. The risk of this employee embezzling company money is significantly multiplied because this one person performs all of these duties. In this situation, this person could easily become a single point of failure. With separation of duties, expenditures and withdrawals should be verified by at least two sets of people. And maybe the CFO should sign the checks instead of the accountant. This way, we can eliminate this single point of failure.",
      "summary": "Separation of duties is a key security concept that minimizes the risk of fraud and errors by distributing responsibilities among multiple individuals, thereby eliminating single points of failure within an organization. For instance, by requiring different personnel to approve expenses, verify transactions, and manage funds, organizations can significantly reduce the potential for embezzlement and enhance overall security. Implementing this principle ensures that no single individual has complete control over critical financial processes, fostering a more secure operational environment.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Separation of Duties",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_7",
      "content": "You can also enhance security by implementing duty rotations. For example, after a couple of months, each person's responsibility shifts to another person, like a chore chart. So, using our previous example, instead of signing checks, the CFO verifies and approves expenditures, while others handle withdrawals and signing checks. Duty rotations also heighten security by continually monitoring accountability during the rotation process.",
      "summary": "Job rotation is a security practice that involves periodically shifting responsibilities among employees to enhance accountability and reduce the risk of fraud or errors. By rotating duties, such as having the CFO verify expenditures instead of solely signing checks, organizations can ensure continuous oversight and mitigate potential security threats. This approach fosters a culture of vigilance and shared responsibility within the team.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Job Rotation",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_8",
      "content": "Now let's move on to the principle of least privilege. The idea behind this principle is that employees only have access to information they absolutely need for their job function. Employees with too much access could either intentionally or unintentionally compromise security. For example, administrative accounts should only be given to people who need them, and this access should only be used by employees who are actively performing administrative duties. A best practice is to log in with a standard user account and then only change to an administrative account to perform a task that requires it. When you're done with that task, you switch back to the standard user account. It's never a good idea to be logged in as an administrator while browsing the web, reading emails, or using social media. An exploit coming through that internet connection could easily obtain elevated privileges on that workstation, which hugely increases the potential for damages.",
      "summary": "The principle of least privilege dictates that employees should only have access to the information necessary for their specific job functions, minimizing the risk of security breaches. Best practices include using standard user accounts for everyday tasks and only switching to administrative accounts when required, thereby reducing exposure to potential exploits. This approach helps prevent both intentional and unintentional compromises of security by limiting access rights.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Least Privilege",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_9",
      "content": "Another practice to increase security is a mandatory vacation policy. The best way to implement mandatory vacations is to require employees to request vacation days in advance, like at the beginning of the year. The benefits of mandatory vacations are twofold. First, they allow employees to take a break from work, rest, and recharge. Second, they provide the security administrator the ability to detect fraudulent activities while employees are away. For example, if you notice that a reoccurring security breach stops while a particular employee is away on vacation, that could help you identify its cause.",
      "summary": "Mandatory vacation policies enhance security by requiring employees to take time off, which helps them recharge and allows security administrators to identify potential fraudulent activities. By observing patterns of security breaches that cease during an employee's absence, organizations can pinpoint suspicious behavior and improve overall security measures. This practice not only promotes employee well-being but also serves as a proactive approach to detecting and mitigating security risks.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Mandatory Vacations",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_10",
      "content": "The last step in employment is offboarding. Whether an employee resigns, retires, or is terminated, offboarding procedures keep the company safe as they depart. First, you should disable or delete that employee's user account. An active, unused account allows easy access to your network. When you delete a user account, be sure not to delete that user's data in the process. Make sure their files are preserved. You want that data available for future use. So you may want to disable former employees' accounts rather than delete them. You should also change security keys and require the return of access tokens, devices, and phones. And when an employee leaves the organization, Human Resources should always conduct an exit interview. During this interview, it's important to address any concerns, dissatisfactions, or feedback from the employee. With this information, you'll have a better idea of why the employee is leaving and be able to address any remaining concerns. This is also a good time to remind the employee of any non-disclosure or non-compete agreements they may have signed during their onboarding process.",
      "summary": "Offboarding is a critical security process that occurs when an employee leaves an organization, whether through resignation, retirement, or termination. Key steps include disabling or deleting the employee's user account to prevent unauthorized access, preserving their data for future use, changing security keys, and retrieving company assets. Additionally, conducting an exit interview with Human Resources helps gather valuable feedback and reinforces any non-disclosure or non-compete agreements.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Offboarding",
      "timestamp_range": ""
    },
    {
      "chunk_id": "13.2.1_chunk_11",
      "content": "That's it for this lesson. In this lesson, we discussed the importance of personnel policies during the pre-employment process, onboarding, training, and daily operations, and we finished by discussing offboarding policies that protect the company and mitigate risks.",
      "summary": "This lesson emphasizes the critical role of personnel policies throughout the employment lifecycle, including pre-employment, onboarding, training, and offboarding. Effective policies help protect the organization and reduce risks associated with employee transitions and operations. Implementing these practices ensures a secure and compliant workplace environment.",
      "metadata": {
        "chapter_num": "13",
        "section_num": "13.2.1",
        "title": "Personnel Policies",
        "content_type": "video",
        "filename": "13.2.1_Personnel_Policies_[video].txt",
        "file_path": "data_raw/13_Data_Protection_and_Compliance/13.2.1_Personnel_Policies_[video].txt",
        "word_count": 1251,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 11
}