{
  "metadata": {
    "chapter_num": "6",
    "section_num": "6.1.2",
    "title": "Physical Security Facts",
    "content_type": "text",
    "filename": "6.1.2_Physical_Security_Facts_[text].txt",
    "file_path": "data_raw/06_Resiliency_and_Site_Security/6.1.2_Physical_Security_Facts_[text].txt",
    "word_count": 3228,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Physical security concepts are a critical component of cybersecurity. Physical security measures, such as access control, video surveillance, and environmental controls, help protect an organization's physical assets, including servers, datacenters, and other critical infrastructure, from unauthorized access, theft, or damage. Effective physical security practices help prevent unauthorized physical access to sensitive data or systems and reduce the risk of insider threats. Organizations must integrate physical security practices into their cybersecurity strategies to provide a layered approach to security and protect against cyber threats that exploit physical vulnerabilities. Physical security controls Physical security through environmental design Gateways and locks Access badges Security guards and cameras Alarm systems and sensors Physical attacks Physical Security Controls Physical security is critical to cybersecurity operations because it provides the first line of defense against physical access to an organization's critical assets. Cybersecurity is about securing digital assets and protecting the physical components that house those assets, such as servers, data centers, and other critical infrastructure. Practical examples of physical security measures in cybersecurity operations include access control mechanisms, such as biometric scanners, smart cards, key fobs, and surveillance systems, including video cameras, motion sensors, and alarms. Additionally, backup power, redundant cooling, and fire suppression systems are critical components of physical security in data centers. Physical access controls depend on the same access control fundamentals as technical system security: Authentication—Creates access lists and identifies mechanisms to allow approved persons through the barriers. Authorization—Creates barriers around a resource to control access through defined entry and exit points. Accounting—Records when entry/exit points are used and detects security breaches. Physical security is often implemented by incorporating zones. Each zone is separated by its own barrier(s). One or more security mechanisms control entry and exit points through the barriers. Progression through each zone should be increasingly restrictive. Physical Security Through Environmental Design Physical security through environmental design is an approach to security that uses the built environment to enhance security and prevent crime. This approach designs physical spaces, buildings, and landscapes to promote non-obvious security features. Physical security via environmental design can be used in various settings, such as residential neighborhoods, commercial districts, schools, and public spaces. By incorporating these design principles, organizations can enhance security, deter criminal activity, and promote a sense of safety and well-being among users. Additionally, physical security via environmental design can be a cost-effective way to improve security because it easily incorporates design elements into new or existing structures at a low cost. The following table includes some effective environmental design options to enhance physical security: Device Type Explanation Barricades and Entry/Exit Points A barricade is something that prevents access. As with any security system, no barricade is completely effective; a wall may be climbed, or a lock may be picked. The purpose of barricades is to channel people through defined entry and exit points. Each entry point should have an authentication mechanism so that only authorized persons are allowed through. Effective surveillance mechanisms ensure the detection of attempts to penetrate a barricade by other means. Physical sites at risk of a terrorist attack will use barricades such as bollards and security posts to prevent vehicles from speeding toward a building. Fencing\tThe exterior of a building may be protected by fencing. Security fencing needs to be transparent (so guards can see any attempt to penetrate it), robust (so that it is difficult to cut), and secure against climbing (which is generally achieved by making it tall and possibly by using razor wire). Fencing is generally effective, but the drawback is that it gives a building an intimidating appearance. Buildings that are used by companies to welcome customers or the public may use more discreet security methods. Lighting\tSecurity lighting is enormously important in the perception that a building is safe and secure at night. Well-designed lighting helps to make people feel safe, especially in public areas or enclosed spaces, such as parking garages. Security lighting also acts as a deterrent by making intrusion more difficult and surveillance (whether by camera or guard) easier. The lighting design needs to account for overall light levels, the lighting of particular surfaces or areas (allowing cameras to perform facial recognition, for instance), and avoid areas of shadow and glare. Bollards\tBollards are generally short vertical posts made of steel, concrete, or other similarly durable materials and installed at intervals around a perimeter or entrance. Sometimes bollards are non-obvious and appear as sculptures or as building design elements. They can be fixed or retractable, and some models can be raised or lowered remotely. Bollards can serve several purposes, such as protecting pedestrians from vehicular traffic, preventing unauthorized vehicle access, and providing perimeter security for critical infrastructure and facilities. They are often used to secure government buildings, airports, stadiums, store entrances, and other public spaces. By preventing vehicles from entering restricted areas, bollards can help mitigate the risks of vehicular attacks and accidents. There may be a few options to adjust the site layout in existing premises. When faced with cost constraints and the need to reuse existing infrastructure, incorporating the following principles can be helpful: Locate secure zones, such as equipment rooms, as deep within the building as possible, avoiding external walls, doors, and windows. Position public access areas so that guests do not pass near secure zones. Security mechanisms in public areas should be highly visible to increase deterrence. Use signage and warnings to enforce the idea that security is tightly controlled. Beyond basic \"no trespassing\" signs, some homes and offices also display signs from the security companies whose services they are using. These may convince intruders to stay away. Conversely, entry points to secure zones should be discreet. Do not allow an intruder the opportunity to inspect security mechanisms protecting such zones (or even to know where they are). Use industrial camouflage to make buildings and gateways protecting high-value assets unobtrusive or create high-visibility decoy areas to draw out potential threat actors. Try to minimize traffic passing between zones. The flow of people should be \"in and out\" rather than \"across and between.\" Give high-traffic public areas high visibility to hinder the covert use of gateways, network access ports, and computer equipment, and simplify surveillance. In secure zones, position display screens or input devices away from pathways or windows. Use one-way glass only visible from the inside out so no one can look in through windows. Gateways and Locks To secure a gateway it must be fitted with a lock. A secure gateway will normally be self-closing and self-locking rather than dependent on the user to close and lock it. Lock types can be categorized as follows: Physical—are conventional locks that prevent the door handle from being operated without using a key. More expensive types offer greater resistance against lock picking. Electronic—are locks, rather than a key, that operate by entering a PIN on an electronic keypad. This type of lock is also referred to as cipher, combination, or keyless. A smart lock may be opened using a magnetic swipe card or feature a proximity reader to detect the presence of a physical token, such as a wireless key fob or smart-card. Biometric—is a lock integrated with a biometric scanner. An access control vestibule is a security measure that regulates entry to a secure area. It involves two doors or gates that interlock and permit only one individual to pass through at a time. The first door opens after the person is granted access via an access control system, such as a card reader or biometric scanner. Once the person enters the vestibule, the first door shuts. The second door opens only when the first door is firmly shut. This guarantees only one person can enter or exit at a time, preventing unauthorized access or tailgating. Access control vestibules are frequently used in high-security settings like data centers, government buildings, and financial institutions to offer an additional layer of physical security control. They effectively deter unauthorized access to secure areas and safeguard sensitive assets against potential physical attacks. Cable locks attach to a secure point on the device chassis. A server chassis might come with both a metal loop and a Kensington security slot. As well as securing the chassis to a rack or desk, the position of the secure point prevents the chassis from being opened without removing the cable first. Access Badges Access badges are a fundamental component of physical security in larger organizations where control over access to various locations is critical. Plastic cards embedded with magnetic strips, radio frequency identification (RFID) chips, or near - field communication (NFC) technology are issued to authorized individuals, such as employees, contractors, or visitors instead of physical keys. Access badges replace physical keys but provide access similarly. This is achieved by requiring the badge to be swiped, tapped, or brought into proximity with a reader at the access point, like a door or turnstile. The reader communicates with a control system to verify the badge's authenticity and the level of access granted to the badge holder. If the system recognizes the badge as valid and authorized for that area, the door unlocks, granting access. It is important to note that implementing this type of access control system requires magnetic door-locking mechanisms and access card readers, which depend upon electrical power and network communications at each access point (such as a doorway.) A physical access control system (PACS) is a critical component in managing and maintaining security within a facility. It is a system designed to control who can access specific locations within a building or site. The PACS operates through a combination of hardware and software, including access cards or badges, card readers, access control panels, and a centralized control network. The PACS system provides valuable badge access activity logging capabilities. In addition to controlling access, access badges also serve as a form of identification, displaying pertinent information about the badge holder, such as their name, title, and photograph. This aids in quickly identifying individuals within a facility and verifying that they are in an area appropriate for their role or purpose. Moreover, access badges can provide valuable data for security audits and investigations. Each time a badge is used, a PACS system can log the time, location, and identity associated with the access event. This can be crucial in investigating security breaches, understanding movement patterns, and even planning emergency evacuation strategies. Security Guards and Cameras Surveillance is typically a second layer of security designed to improve the resilience of perimeter gateways. Surveillance may be focused on perimeter areas or within security zones. Human security guards, armed or unarmed, can be placed in front of and around a location to protect it. They can monitor critical checkpoints and verify identification, allow or disallow access, and log physical entry events. They also provide a visual deterrent and can apply their knowledge and intuition to potential security breaches. The visible presence of guards is a very effective intrusion detection and deterrence mechanism, but it is correspondingly expensive. It may not be possible to place security guards within certain zones because they cannot be granted the appropriate security clearance. Training and screening of security guards is imperative. Video surveillance is a cheaper means of providing surveillance than maintaining separate guards at each gateway or zone, though it is still not cheap to set up if the infrastructure is not already in place on the premises. It is also quite an effective deterrent. The other big advantage is that movement and access can be recorded. The main drawback compared to the presence of security guards is that response times are longer, and security may be compromised if not enough staff are in place to monitor the camera feeds. The cameras in a CCTV network are typically connected to a multiplexer using coaxial cabling. The multiplexer can then display images from the cameras on one or more screens, allow the operator to control camera functions and record the images to tape or hard drive. Newer camera systems may be linked in an IP network using regular data cabling. Camera systems and robotics can use AI and machine learning to implement smart physical security: Motion Recognition—Occurs when the camera system is configured with gait identification technology. This means the system can generate an alert when anyone within sight of the camera moves in a pattern that does not match a known and authorized individual. Object Detection—Occurs when the camera system can detect changes to the environment, such as a missing server or unknown device connected to a wall port. Drones/UAV—cameras mounted on drones can cover wider areas than ground-based patrols. Alarm Systems and Sensors Alarms play a vital role in physical security by supplementing other security controls. Alarms alert security personnel and building occupants of potential threats or breaches. They are both detective and deterrent controls, notifying of trouble and discouraging unauthorized access and criminal activity. Alarms are often integrated with other physical security controls, such as access control systems, surveillance cameras, or motion sensors, to enhance their effectiveness. The following list describes several common types of alarms: Circuit—Uses a circuit-based alarm that sounds when the circuit is opened or closed, depending on the type of alarm. For example, this could be a door or window opening or by a fence being cut. A closed-circuit alarm is more secure because it cannot be defeated by cutting the circuit like an open-circuit alarm. Motion Detection—Uses a motion-based alarm linked to a detector that is triggered by any movement within an area such as a room (defined by the sensitivity and range of the detector). The sensors in these detectors are either microwave radio reflection (similar to radar) or passive infrared (PIR), which detect moving heat sources. Noise Detection—Uses an alarm triggered by sounds picked up by a microphone. Modern AI-backed analysis and identification of specific types of sound can render this type of system less prone to false positives. Proximity—Uses radio frequency ID (RFID) tags and readers to track the movement of tagged objects within an area. This allows an alarm system to detect whether someone is trying to remove equipment. Duress—Uses an alarm triggered manually by staff if they come under threat. There are many ways of implementing this type of alarm, including wireless pendants, concealed sensors or triggers, and DECT handsets or smartphones. Some electronic entry locks can also be programmed with a duress code different from the ordinary access code. This will open the gateway but also alert security personnel that the lock has been operated under duress. Circuit-based alarms are suited for use at the perimeter and on windows and doors. These may register when a gateway is opened without using the lock mechanism properly or when a gateway is held open for longer than a defined period. Motion detectors are useful for controlling access to spaces not normally used. Duress alarms are useful for exposed staff in public areas. An alarm might simply sound like an alert or be linked to a monitoring system. Many alarms are linked directly to local law enforcement or third-party security companies. A silent alarm alerts security personnel rather than sounding an audible alarm. Sensor Types Sensors are critical in implementing physical security measures, providing proactive detection and alerting capabilities against potential security breaches. These devices can employ various technologies, including infrared, pressure, microwave, and ultrasonic systems, each with unique advantages and suitable applications. Infrared sensors are commonly used in motion detection systems. They detect changes in heat patterns caused by moving objects, such as a human intruder. These are often used in residential and commercial security systems, triggering alarms or activating security lights when detecting motion. Pressure sensors are typically installed inside floors or mats and are activated by weight. They can be used in high-security areas to detect unauthorized access or even in retail environments to count foot traffic. Microwave sensors emit microwave pulses and measure the reflection off a moving object. They are often combined with infrared detectors in dual-technology motion sensors. These sensors are less likely to trigger false alarms, as the infrared and microwave sensors must be tripped simultaneously to trigger an alarm. These can be useful in securing large outdoor areas like parking lots or fenced areas. Ultrasonic sensors emit sound waves at frequencies above the range of human hearing and measure the time it takes for the waves to return after hitting an object. They are often used in automated lighting systems to switch lights on when someone enters a room and switch them off again when the room is empty. Physical Attacks A physical attack is one directed against cabling infrastructure, hardware devices, or the environment of the site facilities hosting the network. The following table include three of the most common physical attacks. Attack Explanation Brute Force A brute force physical attack can take several different forms, some examples of which are the following: Smashing a hardware device to perform physical denial of service (DoS). Breaking into premises or cabinets by forcing a lock or gateway. This is likely to be an indicator of theft or tampering. Preventing theft is often impossible to guarantee, so knowing that something has been stolen is important for things like data breach reporting and revoking access permissions. A system that is tamper-evident will display visible signs of forced entry or use that are difficult for a threat actor to disguise. Environmental An environmental attack could be an attempt to perform denial of service. For example, a threat actor could try to destroy power lines, cut through network cables, or disrupt cooling systems. Alternatively, environmental and building maintenance systems are known vectors for threat actors to try to gain access to company networks. The risk from physical attacks means that premises must be monitored for signs of physical damage or the addition of rogue devices. RFID Cloning Radio Frequency ID (RFID) is a means of encoding information into passive tags. When a reader is within range of the tag,it produces an electromagnetic wave that powers up the tag and allows the reader to collect information from it. This technology can be used to implement contactless building access control systems. RFID cloning and skimming refer to ways of counterfeiting contactless building access cards or badges: Cloning —this refers to making one or more copies of an existing card. A lost or stolen card with no cryptographic protections can be physically duplicated. Card loss should be reported immediately so that it can be revoked and a new one issued. If there were a successful attack, it might be indicated by use of a card in a suspicious location or time of day. Skimming —this refers to using a counterfeit reader to capture card or badge details, which are then used to program a duplicate. Some types of proximity card can quite easily be made to transmit the credential to a portable RFID reader that a threat actor could conceal on their person. These attacks can generally only target \"dumb\" access cards that transfer static tokens rather than perform cryptoprocessing. If use of the cards is logged, compromise might be indicated by impossible travel and concurrent use access patterns. Near-field communication (NFC) is derived from RFID and is also often used for contactless cards. It works only at very close range and allows two-way communications between NFC peers.",
  "chunks": [
    {
      "chunk_id": "6.1.2_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces foundational security concepts essential for protecting information systems. Key topics include risk management, threat analysis, network security, and incident response, emphasizing practical applications through hands-on labs and real-world scenarios. This course equips learners with the skills needed to identify vulnerabilities and implement effective security measures in various environments.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.1.2",
        "title": "Physical Security Facts",
        "content_type": "text",
        "filename": "6.1.2_Physical_Security_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.1.2_Physical_Security_Facts_[text].txt",
        "word_count": 3228,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "6.1.2_chunk_2",
      "content": "Physical security concepts are a critical component of cybersecurity. Physical security measures, such as access control, video surveillance, and environmental controls, help protect an organization's physical assets, including servers, datacenters, and other critical infrastructure, from unauthorized access, theft, or damage. Effective physical security practices help prevent unauthorized physical access to sensitive data or systems and reduce the risk of insider threats. Organizations must integrate physical security practices into their cybersecurity strategies to provide a layered approach to security and protect against cyber threats that exploit physical vulnerabilities.",
      "summary": "Physical security is essential in cybersecurity, focusing on measures like access control, video surveillance, and environmental controls to safeguard physical assets such as servers and data centers. These practices help prevent unauthorized access and mitigate risks from insider threats, emphasizing the need for a layered security approach. Integrating physical security into overall cybersecurity strategies enhances protection against threats that exploit physical vulnerabilities.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.1.2",
        "title": "Physical Security Facts",
        "content_type": "text",
        "filename": "6.1.2_Physical_Security_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.1.2_Physical_Security_Facts_[text].txt",
        "word_count": 3228,
        "has_content": true
      },
      "section_header": "6.1.2 Physical Security Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "6.1.2_chunk_3",
      "content": "Physical security controls Physical security through environmental design Gateways and locks Access badges Security guards and cameras Alarm systems and sensors Physical attacks Physical Security Controls Physical security is critical to cybersecurity operations because it provides the first line of defense against physical access to an organization's critical assets. Cybersecurity is about securing digital assets and protecting the physical components that house those assets, such as servers, data centers, and other critical infrastructure. Practical examples of physical security measures in cybersecurity operations include access control mechanisms, such as biometric scanners, smart cards, key fobs, and surveillance systems, including video cameras, motion sensors, and alarms. Additionally, backup power, redundant cooling, and fire suppression systems are critical components of physical security in data centers. Physical access controls depend on the same access control fundamentals as technical system security: Authentication—Creates access lists and identifies mechanisms to allow approved persons through the barriers. Authorization—Creates barriers around a resource to control access through defined entry and exit points. Accounting—Records when entry/exit points are used and detects security breaches. Physical security is often implemented by incorporating zones. Each zone is separated by its own barrier(s). One or more security mechanisms control entry and exit points through the barriers. Progression through each zone should be increasingly restrictive. Physical Security Through Environmental Design Physical security through environmental design is an approach to security that uses the built environment to enhance security and prevent crime. This approach designs physical spaces, buildings, and landscapes to promote non-obvious security features. Physical security via environmental design can be used in various settings, such as residential neighborhoods, commercial districts, schools, and public spaces. By incorporating these design principles, organizations can enhance security, deter criminal activity, and promote a sense of safety and well-being among users. Additionally, physical security via environmental design can be a cost-effective way to improve security because it easily incorporates design elements into new or existing structures at a low cost. The following table includes some effective environmental design options to enhance physical security: Device Type Explanation Barricades and Entry/Exit Points A barricade is something that prevents access. As with any security system, no barricade is completely effective; a wall may be climbed, or a lock may be picked. The purpose of barricades is to channel people through defined entry and exit points. Each entry point should have an authentication mechanism so that only authorized persons are allowed through. Effective surveillance mechanisms ensure the detection of attempts to penetrate a barricade by other means. Physical sites at risk of a terrorist attack will use barricades such as bollards and security posts to prevent vehicles from speeding toward a building. Fencing\tThe exterior of a building may be protected by fencing. Security fencing needs to be transparent (so guards can see any attempt to penetrate it), robust (so that it is difficult to cut), and secure against climbing (which is generally achieved by making it tall and possibly by using razor wire). Fencing is generally effective, but the drawback is that it gives a building an intimidating appearance. Buildings that are used by companies to welcome customers or the public may use more discreet security methods. Lighting\tSecurity lighting is enormously important in the perception that a building is safe and secure at night. Well-designed lighting helps to make people feel safe, especially in public areas or enclosed spaces, such as parking garages. Security lighting also acts as a deterrent by making intrusion more difficult and surveillance (whether by camera or guard) easier. The lighting design needs to account for overall light levels, the lighting of particular surfaces or areas (allowing cameras to perform facial recognition, for instance), and avoid areas of shadow and glare. Bollards\tBollards are generally short vertical posts made of steel, concrete, or other similarly durable materials and installed at intervals around a perimeter or entrance. Sometimes bollards are non-obvious and appear as sculptures or as building design elements. They can be fixed or retractable, and some models can be raised or lowered remotely. Bollards can serve several purposes, such as protecting pedestrians from vehicular traffic, preventing unauthorized vehicle access, and providing perimeter security for critical infrastructure and facilities. They are often used to secure government buildings, airports, stadiums, store entrances, and other public spaces. By preventing vehicles from entering restricted areas, bollards can help mitigate the risks of vehicular attacks and accidents. There may be a few options to adjust the site layout in existing premises. When faced with cost constraints and the need to reuse existing infrastructure, incorporating the following principles can be helpful: Locate secure zones, such as equipment rooms, as deep within the building as possible, avoiding external walls, doors, and windows. Position public access areas so that guests do not pass near secure zones. Security mechanisms in public areas should be highly visible to increase deterrence. Use signage and warnings to enforce the idea that security is tightly controlled. Beyond basic \"no trespassing\" signs, some homes and offices also display signs from the security companies whose services they are using. These may convince intruders to stay away. Conversely, entry points to secure zones should be discreet. Do not allow an intruder the opportunity to inspect security mechanisms protecting such zones (or even to know where they are). Use industrial camouflage to make buildings and gateways protecting high-value assets unobtrusive or create high-visibility decoy areas to draw out potential threat actors. Try to minimize traffic passing between zones. The flow of people should be \"in and out\" rather than \"across and between.\" Give high-traffic public areas high visibility to hinder the covert use of gateways, network access ports, and computer equipment, and simplify surveillance. In secure zones, position display screens or input devices away from pathways or windows. Use one-way glass only visible from the inside out so no one can look in through windows. Gateways and Locks To secure a gateway it must be fitted with a lock. A secure gateway will normally be self-closing and self-locking rather than dependent on the user to close and lock it. Lock types can be categorized as follows: Physical—are conventional locks that prevent the door handle from being operated without using a key. More expensive types offer greater resistance against lock picking. Electronic—are locks, rather than a key, that operate by entering a PIN on an electronic keypad. This type of lock is also referred to as cipher, combination, or keyless. A smart lock may be opened using a magnetic swipe card or feature a proximity reader to detect the presence of a physical token, such as a wireless key fob or smart-card. Biometric—is a lock integrated with a biometric scanner. An access control vestibule is a security measure that regulates entry to a secure area. It involves two doors or gates that interlock and permit only one individual to pass through at a time. The first door opens after the person is granted access via an access control system, such as a card reader or biometric scanner. Once the person enters the vestibule, the first door shuts. The second door opens only when the first door is firmly shut. This guarantees only one person can enter or exit at a time, preventing unauthorized access or tailgating. Access control vestibules are frequently used in high-security settings like data centers, government buildings, and financial institutions to offer an additional layer of physical security control. They effectively deter unauthorized access to secure areas and safeguard sensitive assets against potential physical attacks. Cable locks attach to a secure point on the device chassis. A server chassis might come with both a metal loop and a Kensington security slot. As well as securing the chassis to a rack or desk, the position of the secure point prevents the chassis from being opened without removing the cable first. Access Badges Access badges are a fundamental component of physical security in larger organizations where control over access to various locations is critical. Plastic cards embedded with magnetic strips, radio frequency identification (RFID) chips, or near - field communication (NFC) technology are issued to authorized individuals, such as employees, contractors, or visitors instead of physical keys. Access badges replace physical keys but provide access similarly. This is achieved by requiring the badge to be swiped, tapped, or brought into proximity with a reader at the access point, like a door or turnstile. The reader communicates with a control system to verify the badge's authenticity and the level of access granted to the badge holder. If the system recognizes the badge as valid and authorized for that area, the door unlocks, granting access. It is important to note that implementing this type of access control system requires magnetic door-locking mechanisms and access card readers, which depend upon electrical power and network communications at each access point (such as a doorway.) A physical access control system (PACS) is a critical component in managing and maintaining security within a facility. It is a system designed to control who can access specific locations within a building or site. The PACS operates through a combination of hardware and software, including access cards or badges, card readers, access control panels, and a centralized control network. The PACS system provides valuable badge access activity logging capabilities. In addition to controlling access, access badges also serve as a form of identification, displaying pertinent information about the badge holder, such as their name, title, and photograph. This aids in quickly identifying individuals within a facility and verifying that they are in an area appropriate for their role or purpose. Moreover, access badges can provide valuable data for security audits and investigations. Each time a badge is used, a PACS system can log the time, location, and identity associated with the access event. This can be crucial in investigating security breaches, understanding movement patterns, and even planning emergency evacuation strategies. Security Guards and Cameras Surveillance is typically a second layer of security designed to improve the resilience of perimeter gateways. Surveillance may be focused on perimeter areas or within security zones. Human security guards, armed or unarmed, can be placed in front of and around a location to protect it. They can monitor critical checkpoints and verify identification, allow or disallow access, and log physical entry events. They also provide a visual deterrent and can apply their knowledge and intuition to potential security breaches. The visible presence of guards is a very effective intrusion detection and deterrence mechanism, but it is correspondingly expensive. It may not be possible to place security guards within certain zones because they cannot be granted the appropriate security clearance. Training and screening of security guards is imperative. Video surveillance is a cheaper means of providing surveillance than maintaining separate guards at each gateway or zone, though it is still not cheap to set up if the infrastructure is not already in place on the premises. It is also quite an effective deterrent. The other big advantage is that movement and access can be recorded. The main drawback compared to the presence of security guards is that response times are longer, and security may be compromised if not enough staff are in place to monitor the camera feeds. The cameras in a CCTV network are typically connected to a multiplexer using coaxial cabling. The multiplexer can then display images from the cameras on one or more screens, allow the operator to control camera functions and record the images to tape or hard drive. Newer camera systems may be linked in an IP network using regular data cabling. Camera systems and robotics can use AI and machine learning to implement smart physical security: Motion Recognition—Occurs when the camera system is configured with gait identification technology. This means the system can generate an alert when anyone within sight of the camera moves in a pattern that does not match a known and authorized individual. Object Detection—Occurs when the camera system can detect changes to the environment, such as a missing server or unknown device connected to a wall port. Drones/UAV—cameras mounted on drones can cover wider areas than ground-based patrols. Alarm Systems and Sensors Alarms play a vital role in physical security by supplementing other security controls. Alarms alert security personnel and building occupants of potential threats or breaches. They are both detective and deterrent controls, notifying of trouble and discouraging unauthorized access and criminal activity. Alarms are often integrated with other physical security controls, such as access control systems, surveillance cameras, or motion sensors, to enhance their effectiveness. The following list describes several common types of alarms: Circuit—Uses a circuit-based alarm that sounds when the circuit is opened or closed, depending on the type of alarm. For example, this could be a door or window opening or by a fence being cut. A closed-circuit alarm is more secure because it cannot be defeated by cutting the circuit like an open-circuit alarm. Motion Detection—Uses a motion-based alarm linked to a detector that is triggered by any movement within an area such as a room (defined by the sensitivity and range of the detector). The sensors in these detectors are either microwave radio reflection (similar to radar) or passive infrared (PIR), which detect moving heat sources. Noise Detection—Uses an alarm triggered by sounds picked up by a microphone. Modern AI-backed analysis and identification of specific types of sound can render this type of system less prone to false positives. Proximity—Uses radio frequency ID (RFID) tags and readers to track the movement of tagged objects within an area. This allows an alarm system to detect whether someone is trying to remove equipment. Duress—Uses an alarm triggered manually by staff if they come under threat. There are many ways of implementing this type of alarm, including wireless pendants, concealed sensors or triggers, and DECT handsets or smartphones. Some electronic entry locks can also be programmed with a duress code different from the ordinary access code. This will open the gateway but also alert security personnel that the lock has been operated under duress. Circuit-based alarms are suited for use at the perimeter and on windows and doors. These may register when a gateway is opened without using the lock mechanism properly or when a gateway is held open for longer than a defined period. Motion detectors are useful for controlling access to spaces not normally used. Duress alarms are useful for exposed staff in public areas. An alarm might simply sound like an alert or be linked to a monitoring system. Many alarms are linked directly to local law enforcement or third-party security companies. A silent alarm alerts security personnel rather than sounding an audible alarm. Sensor Types Sensors are critical in implementing physical security measures, providing proactive detection and alerting capabilities against potential security breaches. These devices can employ various technologies, including infrared, pressure, microwave, and ultrasonic systems, each with unique advantages and suitable applications. Infrared sensors are commonly used in motion detection systems. They detect changes in heat patterns caused by moving objects, such as a human intruder. These are often used in residential and commercial security systems, triggering alarms or activating security lights when detecting motion. Pressure sensors are typically installed inside floors or mats and are activated by weight. They can be used in high-security areas to detect unauthorized access or even in retail environments to count foot traffic. Microwave sensors emit microwave pulses and measure the reflection off a moving object. They are often combined with infrared detectors in dual-technology motion sensors. These sensors are less likely to trigger false alarms, as the infrared and microwave sensors must be tripped simultaneously to trigger an alarm. These can be useful in securing large outdoor areas like parking lots or fenced areas. Ultrasonic sensors emit sound waves at frequencies above the range of human hearing and measure the time it takes for the waves to return after hitting an object. They are often used in automated lighting systems to switch lights on when someone enters a room and switch them off again when the room is empty. Physical Attacks A physical attack is one directed against cabling infrastructure, hardware devices, or the environment of the site facilities hosting the network. The following table include three of the most common physical attacks. Attack Explanation Brute Force A brute force physical attack can take several different forms, some examples of which are the following: Smashing a hardware device to perform physical denial of service (DoS). Breaking into premises or cabinets by forcing a lock or gateway. This is likely to be an indicator of theft or tampering. Preventing theft is often impossible to guarantee, so knowing that something has been stolen is important for things like data breach reporting and revoking access permissions. A system that is tamper-evident will display visible signs of forced entry or use that are difficult for a threat actor to disguise. Environmental An environmental attack could be an attempt to perform denial of service. For example, a threat actor could try to destroy power lines, cut through network cables, or disrupt cooling systems. Alternatively, environmental and building maintenance systems are known vectors for threat actors to try to gain access to company networks. The risk from physical attacks means that premises must be monitored for signs of physical damage or the addition of rogue devices. RFID Cloning Radio Frequency ID (RFID) is a means of encoding information into passive tags. When a reader is within range of the tag,it produces an electromagnetic wave that powers up the tag and allows the reader to collect information from it. This technology can be used to implement contactless building access control systems. RFID cloning and skimming refer to ways of counterfeiting contactless building access cards or badges: Cloning —this refers to making one or more copies of an existing card. A lost or stolen card with no cryptographic protections can be physically duplicated. Card loss should be reported immediately so that it can be revoked and a new one issued. If there were a successful attack, it might be indicated by use of a card in a suspicious location or time of day. Skimming —this refers to using a counterfeit reader to capture card or badge details, which are then used to program a duplicate. Some types of proximity card can quite easily be made to transmit the credential to a portable RFID reader that a threat actor could conceal on their person. These attacks can generally only target \"dumb\" access cards that transfer static tokens rather than perform cryptoprocessing. If use of the cards is logged, compromise might be indicated by impossible travel and concurrent use access patterns. Near-field communication (NFC) is derived from RFID and is also often used for contactless cards. It works only at very close range and allows two-way communications between NFC peers.",
      "summary": "This CompTIA Security+ course section emphasizes the importance of physical security controls as the first line of defense in protecting critical assets, including servers and data centers. Key topics include access control mechanisms (like biometric scanners and access badges), surveillance systems (such as security cameras and guards), and environmental design principles that enhance security while deterring crime. Practical applications involve implementing layered security measures, including alarms, sensors, and physical barriers, to safeguard against physical attacks and unauthorized access.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.1.2",
        "title": "Physical Security Facts",
        "content_type": "text",
        "filename": "6.1.2_Physical_Security_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.1.2_Physical_Security_Facts_[text].txt",
        "word_count": 3228,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 3
}