{
  "metadata": {
    "chapter_num": "6",
    "section_num": "6.2.6",
    "title": "Reconnaissance Facts",
    "content_type": "text",
    "filename": "6.2.6_Reconnaissance_Facts_[text].txt",
    "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.6_Reconnaissance_Facts_[text].txt",
    "word_count": 1055,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Passive and active reconnaissance provides crucial information that helps penetration testers understand target systems and identify potential vulnerabilities to plan an attack effectively. A combination of active and passive reconnaissance techniques yields the most comprehensive information regarding the target environment during a penetration testing engagement. Passive reconnaissance Active reconnaissance Reconnaissance tools Passive Reconnaissance Passive reconnaissance involves gathering information on the target with no direct interaction with that target. Passive reconnaissance aims to gather intelligence on the target environment and identify potential vulnerabilities while generating minimal evidence of their actions. Valuable information can be gathered using passive reconnaissance. The following table shows some of the common passive reconnaissance methods: Passive Reconnaissance Method Description Packet sniffing Packet sniffing is the process of capturing data packets that are flowing across the network and analyzing them for important information. Modern networks should have good protection against network sniffing attacks, but there are occasional circumstances that allow an attacker to gather sensitive information from the data packets. Packet sniffing is most easily performed on open wireless networks. Because the attacker is not sending data or actively interacting with the target, this is considered passive reconnaissance. Scanning for open wireless networks needs to be done before packets can be sniffed. Two common methods are war driving and war flying. War driving is driving around with a wireless device, looking for open, vulnerable wireless networks. War flying uses drones or unmanned aerial vehicles to find open wireless networks. Eavesdropping Eavesdropping is the act of covertly listening in on a communication between other people. This can include: Listening to employees' conversations without them knowing. Shoulder surfing is an eavesdropping technique where the listener obtains passwords or other confidential information by looking over the shoulder of the target as the target logs on or types information. Dumpster diving, which is also considered eavesdropping. When dumpster diving, the attacker goes through the trash to find important information that may have accidentally been thrown away. Open-source intelligence (OSINT) Open-source intelligence is any data that is collected from publicly available sources. The goal is to gather as much personal identifiable information (PII) as possible. This includes information found from resources such as: Search engines (Google, Bing) Social media (Facebook, LinkedIn) Company websites (About sections of websites, company directories) Media sources (news sites, interviews, articles) Public government sources (property appraisal sites, public records) Network traffic analysis\tNetwork traffic analysis involves monitoring network traffic to identify patterns, devices, IP addresses, and potential vulnerabilities without actively generating traffic. Active Reconnaissance After an attacker has gained as much information as possible through passive reconnaissance, the next step is the active reconnaissance phase. Active reconnaissance involves actively probing and interacting with target systems and networks to gather information. Active reconnaissance includes activities that generate network traffic by directly requesting information from target systems. Active reconnaissance aims to discover and obtain information about the target infrastructure, services, and potential vulnerabilities. Common techniques used in active reconnaissance include the following: Port scanning — scanning a target network to identify open ports and the services running on them. Service enumeration — interacting with identified services to gather information about their versions, configurations, and potential vulnerabilities. OS fingerprinting — attempting to identify the operating system running on target machines by analyzing network responses and behavior. DNS enumeration — gathering information about the target's DNS infrastructure, such as domain names, subdomains, and IP addresses. Web application crawling — exploring web applications to identify pages, directories, and potential vulnerabilities. Performing reconnaissance provides the attacker with the information needed to perform a successful attack on the target. The goal is to know and understand the following information about the target: Security posture (this includes both network and physical security) How to narrow the focus for attack Potential vulnerabilities How to best create a network map Reconnaissance Tools There are many tools and resources available to assist in the reconnaissance phase. The table below covers some of the popular tools used: Reconnaissance Tool Description OSINT framework\tThe OSINT framework is a collection of resources and tools that are separated by common categories. The OSINT Framework makes it easy to gather all sorts of information, making the initial reconnaissance process much more efficient. Documentation can be found at https://osintframework.com/ theHarvester theHarvester is a passive reconnaissance tool that is used to gather information from a variety of public sources. The tool gathers emails, names, subdomains, IPs, and URLs using multiple public data sources. These sources include search engines, social media sites, and Shodan. theHarvester does have some options, such as brute-forcing DNS and taking screenshots, that would fall under active reconnaissance. Shodan\tShodan is a popular search engine for internet-connected devices. Users are able to search for specific types of devices and locations. This information can be used to see if a target has any online devices without proper security. Dnsenum\tDnsenum is a program that performs DNS enumeration and can find the DNS servers and entries for an organization. This information can help find other information such as usernames, computer names, IP addresses, and more. Curl and wget Curl and wget are two common command line programs that can be used to download or upload files. An example of using these tools is to download an entire website for offline analysis. Because these tools actively engage with the target, they are considered active reconnaissance tools. Scanless\tScanless is used for port scanning. Instead of scanning ports from the hacker machine, scanless uses exploitation websites to perform port scans. This means the attacker is able to maintain anonymity while scanning the target. Sn1per\tSn1per is an automated scanner that can be used to enumerate and scan for vulnerabilities. Sn1per combines the functions of many tools and can be used to find information such as DNS information, open ports, running services, and more. Nessus\tNessus is a proprietary vulnerability scanner that was developed by Tenable. Nessus can be used to scan the target for any known vulnerabilities, which can be exploited to gain access to the target. Selecting the right tool allows the attacker to gain the necessary information on the target. Network defenders can also use these tools to discover what information is out there and take the necessary steps to remove or hide anything that should not be available.",
  "chunks": [
    {
      "chunk_id": "6.2.6_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course introduces fundamental security concepts essential for protecting information systems, including risk management, threat analysis, and incident response. Key topics cover network security, compliance, operational security, and cryptography, providing a comprehensive understanding of how to safeguard data and systems. Practical applications emphasize real-world scenarios and best practices for implementing security measures in various environments.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.6",
        "title": "Reconnaissance Facts",
        "content_type": "text",
        "filename": "6.2.6_Reconnaissance_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.6_Reconnaissance_Facts_[text].txt",
        "word_count": 1055,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "6.2.6_chunk_2",
      "content": "Passive and active reconnaissance provides crucial information that helps penetration testers understand target systems and identify potential vulnerabilities to plan an attack effectively. A combination of active and passive reconnaissance techniques yields the most comprehensive information regarding the target environment during a penetration testing engagement.",
      "summary": "Reconnaissance is a critical phase in penetration testing, involving both passive and active techniques to gather information about target systems and identify vulnerabilities. By leveraging a combination of these methods, penetration testers can gain a comprehensive understanding of the target environment, which is essential for planning effective attacks. This foundational knowledge enhances the overall security assessment process.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.6",
        "title": "Reconnaissance Facts",
        "content_type": "text",
        "filename": "6.2.6_Reconnaissance_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.6_Reconnaissance_Facts_[text].txt",
        "word_count": 1055,
        "has_content": true
      },
      "section_header": "6.2.6 Reconnaissance Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "6.2.6_chunk_3",
      "content": "Passive reconnaissance Active reconnaissance Reconnaissance tools Passive Reconnaissance Passive reconnaissance involves gathering information on the target with no direct interaction with that target. Passive reconnaissance aims to gather intelligence on the target environment and identify potential vulnerabilities while generating minimal evidence of their actions. Valuable information can be gathered using passive reconnaissance. The following table shows some of the common passive reconnaissance methods: Passive Reconnaissance Method Description Packet sniffing Packet sniffing is the process of capturing data packets that are flowing across the network and analyzing them for important information. Modern networks should have good protection against network sniffing attacks, but there are occasional circumstances that allow an attacker to gather sensitive information from the data packets. Packet sniffing is most easily performed on open wireless networks. Because the attacker is not sending data or actively interacting with the target, this is considered passive reconnaissance. Scanning for open wireless networks needs to be done before packets can be sniffed. Two common methods are war driving and war flying. War driving is driving around with a wireless device, looking for open, vulnerable wireless networks. War flying uses drones or unmanned aerial vehicles to find open wireless networks. Eavesdropping Eavesdropping is the act of covertly listening in on a communication between other people. This can include: Listening to employees' conversations without them knowing. Shoulder surfing is an eavesdropping technique where the listener obtains passwords or other confidential information by looking over the shoulder of the target as the target logs on or types information. Dumpster diving, which is also considered eavesdropping. When dumpster diving, the attacker goes through the trash to find important information that may have accidentally been thrown away. Open-source intelligence (OSINT) Open-source intelligence is any data that is collected from publicly available sources. The goal is to gather as much personal identifiable information (PII) as possible. This includes information found from resources such as: Search engines (Google, Bing) Social media (Facebook, LinkedIn) Company websites (About sections of websites, company directories) Media sources (news sites, interviews, articles) Public government sources (property appraisal sites, public records) Network traffic analysis\tNetwork traffic analysis involves monitoring network traffic to identify patterns, devices, IP addresses, and potential vulnerabilities without actively generating traffic. Active Reconnaissance After an attacker has gained as much information as possible through passive reconnaissance, the next step is the active reconnaissance phase. Active reconnaissance involves actively probing and interacting with target systems and networks to gather information. Active reconnaissance includes activities that generate network traffic by directly requesting information from target systems. Active reconnaissance aims to discover and obtain information about the target infrastructure, services, and potential vulnerabilities. Common techniques used in active reconnaissance include the following: Port scanning — scanning a target network to identify open ports and the services running on them. Service enumeration — interacting with identified services to gather information about their versions, configurations, and potential vulnerabilities. OS fingerprinting — attempting to identify the operating system running on target machines by analyzing network responses and behavior. DNS enumeration — gathering information about the target's DNS infrastructure, such as domain names, subdomains, and IP addresses. Web application crawling — exploring web applications to identify pages, directories, and potential vulnerabilities. Performing reconnaissance provides the attacker with the information needed to perform a successful attack on the target. The goal is to know and understand the following information about the target: Security posture (this includes both network and physical security) How to narrow the focus for attack Potential vulnerabilities How to best create a network map Reconnaissance Tools There are many tools and resources available to assist in the reconnaissance phase. The table below covers some of the popular tools used: Reconnaissance Tool Description OSINT framework\tThe OSINT framework is a collection of resources and tools that are separated by common categories. The OSINT Framework makes it easy to gather all sorts of information, making the initial reconnaissance process much more efficient. Documentation can be found at https://osintframework.com/ theHarvester theHarvester is a passive reconnaissance tool that is used to gather information from a variety of public sources. The tool gathers emails, names, subdomains, IPs, and URLs using multiple public data sources. These sources include search engines, social media sites, and Shodan. theHarvester does have some options, such as brute-forcing DNS and taking screenshots, that would fall under active reconnaissance. Shodan\tShodan is a popular search engine for internet-connected devices. Users are able to search for specific types of devices and locations. This information can be used to see if a target has any online devices without proper security. Dnsenum\tDnsenum is a program that performs DNS enumeration and can find the DNS servers and entries for an organization. This information can help find other information such as usernames, computer names, IP addresses, and more. Curl and wget Curl and wget are two common command line programs that can be used to download or upload files. An example of using these tools is to download an entire website for offline analysis. Because these tools actively engage with the target, they are considered active reconnaissance tools. Scanless\tScanless is used for port scanning. Instead of scanning ports from the hacker machine, scanless uses exploitation websites to perform port scans. This means the attacker is able to maintain anonymity while scanning the target. Sn1per\tSn1per is an automated scanner that can be used to enumerate and scan for vulnerabilities. Sn1per combines the functions of many tools and can be used to find information such as DNS information, open ports, running services, and more. Nessus\tNessus is a proprietary vulnerability scanner that was developed by Tenable. Nessus can be used to scan the target for any known vulnerabilities, which can be exploited to gain access to the target. Selecting the right tool allows the attacker to gain the necessary information on the target. Network defenders can also use these tools to discover what information is out there and take the necessary steps to remove or hide anything that should not be available.",
      "summary": "This lesson focuses on reconnaissance techniques in cybersecurity, distinguishing between passive and active methods. Passive reconnaissance involves gathering information without direct interaction, utilizing techniques like packet sniffing, eavesdropping, and open-source intelligence (OSINT) to identify vulnerabilities. In contrast, active reconnaissance involves direct engagement with target systems through methods such as port scanning and service enumeration to uncover detailed information about the target's security posture and potential weaknesses. Various tools, including theHarvester and Nessus, are highlighted for both attackers and defenders to assess and protect against vulnerabilities.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.6",
        "title": "Reconnaissance Facts",
        "content_type": "text",
        "filename": "6.2.6_Reconnaissance_Facts_[text].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.6_Reconnaissance_Facts_[text].txt",
        "word_count": 1055,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 3
}