{
  "metadata": {
    "chapter_num": "3",
    "section_num": "3.1.9",
    "title": "Blockchain Facts",
    "content_type": "text",
    "filename": "3.1.9_Blockchain_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
    "word_count": 697,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Blockchain is a unique and increasingly popular implementation of cryptography that was developed in 2008. Blockchain Blockchain transaction Blockchain implementations Blockchain Blockchain is a concept in which an expanding list of transactional records is secured using cryptography. Each record is referred to as a block and is run through a hash function. The hash value of the previous block in the chain is added to the hash calculation of the next block in the chain. This ensures that each successive block is cryptographically linked. Each block validates the hash of the previous block all the way through to the beginning of the chain, ensuring that each historical transaction has not been tampered with. In addition, each block typically includes a time stamp of one or more transactions as well as the data involved in the transactions themselves. The blockchain is recorded in an  open public ledger. This ledger does not exist as an individual file on a single computer; rather, one of the most important characteristics of a blockchain is that it is decentralized. The ledger is distributed across a peer-to-peer (P2P) network in order to mitigate the risks associated with having a single point of failure or compromise. Blockchain users can, therefore, trust each other equally. Likewise, another defining quality of a blockchain is its openness—everyone has the same ability to view every transaction on a blockchain. Blockchain technology has a variety of potential applications. It can ensure the integrity and transparency of financial transactions, legal contracts, copyright and intellectual property (IP) protection, online voting systems, identity management systems, and data storage. The first big use of the blockchain was the cryptocurrency, Bitcoin. The purpose of Bitcoin is to provide a method for people to make online transactions without the use of a centralized third party such as a bank. Blockchain Transaction Time Date Parties involved A unique hash that separates the block from other blocks on the chain User1 requests a transaction with User2. The request is made using User1's personal secret key and User2's public key. The transaction is represented online as a block. The block is distributed to everyone on a peer-to-peer network. The network users verify that the transaction is valid. The block is added to the chain. This provides an indisputable and transparent record of the transaction. The contents of the transaction move to User2. The entire transaction happens very quickly, usually within a matter of minutes. Every node contains a copy of the ledger. If a hacker changed a transaction, it would not matter because a copy of the transaction is stored on many other computers. Each node plays an important part in the blockchain. Each node must prove itself by performing work before being allowed to join the network. This is typically done through mining. Mining is the process of adding blocks to the chain. Each block has a 64-digit hexadecimal hash generated by extremely complex math computations. Generating the hash requires a lot of time and computing power. The process is split between each node. As a reward for performing these computations, the nodes are usually paid with cryptocurrency, like Bitcoin. Even though each transaction is publicly visible, all personal information is encrypted and hidden from everyone, even the nodes. Because it is a shared ledger and every transaction is publicly available, all persons involved can be held accountable for their actions. Blockchain Implementations Sending money is not the only way blockchain can be used. Some large companies, including Microsoft and IBM, are working to adapt different technologies to the blockchain. Many transactions that currently rely on a paper-based system could benefit from blockchain. For example, a car or house title could be transferred over the blockchain. Because the transactions are transparent, this would create a clear picture of legal ownership. A blockchain could be used to track the movement of a product, such as food. The ability to follow and see every stop the product has made on its way to the consumer would provide assurances of the product's safety.",
  "chunks": [
    {
      "chunk_id": "3.1.9_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.9",
        "title": "Blockchain Facts",
        "content_type": "text",
        "filename": "3.1.9_Blockchain_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
        "word_count": 697,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.9_chunk_2",
      "content": "Blockchain is a unique and increasingly popular implementation of cryptography that was developed in 2008.",
      "summary": "Blockchain is a unique and increasingly popular implementation of cryptography that was developed in 2008.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.9",
        "title": "Blockchain Facts",
        "content_type": "text",
        "filename": "3.1.9_Blockchain_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
        "word_count": 697,
        "has_content": true
      },
      "section_header": "3.1.9 Blockchain Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.9_chunk_3",
      "content": "Blockchain Blockchain transaction Blockchain implementations Blockchain Blockchain is a concept in which an expanding list of transactional records is secured using cryptography. Each record is referred to as a block and is run through a hash function. The hash value of the previous block in the chain is added to the hash calculation of the next block in the chain. This ensures that each successive block is cryptographically linked. Each block validates the hash of the previous block all the way through to the beginning of the chain, ensuring that each historical transaction has not been tampered with. In addition, each block typically includes a time stamp of one or more transactions as well as the data involved in the transactions themselves. The blockchain is recorded in an  open public ledger. This ledger does not exist as an individual file on a single computer; rather, one of the most important characteristics of a blockchain is that it is decentralized. The ledger is distributed across a peer-to-peer (P2P) network in order to mitigate the risks associated with having a single point of failure or compromise. Blockchain users can, therefore, trust each other equally. Likewise, another defining quality of a blockchain is its openness—everyone has the same ability to view every transaction on a blockchain. Blockchain technology has a variety of potential applications. It can ensure the integrity and transparency of financial transactions, legal contracts, copyright and intellectual property (IP) protection, online voting systems, identity management systems, and data storage. The first big use of the blockchain was the cryptocurrency, Bitcoin. The purpose of Bitcoin is to provide a method for people to make online transactions without the use of a centralized third party such as a bank. Blockchain Transaction",
      "summary": "This lesson covers the following topics:: The ledger is distributed across a peer-to-peer (P2P) network in order to mitigate the risks associated with having a single point of failure or compromise. It can ensure the integrity and transparency of financial transactions, legal contracts, copyright and intellectual property (IP) protection, online voting systems, identity management systems, and data storage.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.9",
        "title": "Blockchain Facts",
        "content_type": "text",
        "filename": "3.1.9_Blockchain_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
        "word_count": 697,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.9_chunk_4",
      "content": "Time Date Parties involved A unique hash that separates the block from other blocks on the chain",
      "summary": "Time Date Parties involved A unique hash that separates the block from other blocks on the chain",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.9",
        "title": "Blockchain Facts",
        "content_type": "text",
        "filename": "3.1.9_Blockchain_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
        "word_count": 697,
        "has_content": true
      },
      "section_header": "Each block contains information about the transaction, including:",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.9_chunk_5",
      "content": "User1 requests a transaction with User2. The request is made using User1's personal secret key and User2's public key. The transaction is represented online as a block. The block is distributed to everyone on a peer-to-peer network. The network users verify that the transaction is valid. The block is added to the chain. This provides an indisputable and transparent record of the transaction. The contents of the transaction move to User2. The entire transaction happens very quickly, usually within a matter of minutes. Every node contains a copy of the ledger. If a hacker changed a transaction, it would not matter because a copy of the transaction is stored on many other computers. Each node plays an important part in the blockchain. Each node must prove itself by performing work before being allowed to join the network. This is typically done through mining. Mining is the process of adding blocks to the chain. Each block has a 64-digit hexadecimal hash generated by extremely complex math computations. Generating the hash requires a lot of time and computing power. The process is split between each node. As a reward for performing these computations, the nodes are usually paid with cryptocurrency, like Bitcoin. Even though each transaction is publicly visible, all personal information is encrypted and hidden from everyone, even the nodes. Because it is a shared ledger and every transaction is publicly available, all persons involved can be held accountable for their actions. Blockchain Implementations Sending money is not the only way blockchain can be used. Some large companies, including Microsoft and IBM, are working to adapt different technologies to the blockchain. Many transactions that currently rely on a paper-based system could benefit from blockchain. For example, a car or house title could be transferred over the blockchain. Because the transactions are transparent, this would create a clear picture of legal ownership. A blockchain could be used to track the movement of a product, such as food. The ability to follow and see every stop the product has made on its way to the consumer would provide assurances of the product's safety.",
      "summary": "Each block goes through the same process:: The block is distributed to everyone on a peer-to-peer network. Mining is the process of adding blocks to the chain.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.9",
        "title": "Blockchain Facts",
        "content_type": "text",
        "filename": "3.1.9_Blockchain_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.9_Blockchain_Facts_[text].txt",
        "word_count": 697,
        "has_content": true
      },
      "section_header": "Each block goes through the same process:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 5,
  "document_summary": "Blockchain Facts (text): The ledger is distributed across a peer-to-peer (P2P) network in order to mitigate the risks associated with having a single point of failure or compromise. It can ensure the integrity and transparency of financial transactions, legal contracts, copyright and intellectual property (IP) protection, online voting systems, identity management systems, and data storage. Mining is the process of adding blocks to the chain."
}