{
  "metadata": {
    "chapter_num": "3",
    "section_num": "3.1.2",
    "title": "Cryptography Facts",
    "content_type": "text",
    "filename": "3.1.2_Cryptography_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.2_Cryptography_Facts_[text].txt",
    "word_count": 931,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 The goal of all IT security specialists is to keep data safe. Hackers find ways to circumvent firewalls, IPS devices, and other security protocols put in place. Cryptography is one additional layer of defense that can be used to protect data. Cryptography overview Cryptography concepts Cryptography methods Cryptography Overview Cryptography is the process of writing or solving messages using a secret code. This is the opposite of security through obscurity. Security through obscurity means keeping something a secret by hiding it. This is considered impossible (or at least high risk) on a computer system. With cryptography, it does not matter if third parties know of the existence and location of the secret because they can never understand what it is without the means to decode it. A form of cryptography called encryption has been used throughout the ages, mainly to keep messages out of the hands of enemies. Encryption is the process of converting normal readable text into something unintelligible called ciphertext. A cipher is the method or algorithm used to encrypt or convert the data. Plaintext (or cleartext) - is an unencrypted message. Ciphertext - is an encrypted message. Algorithm - is the process used to encrypt and decrypt a message. Cryptanalysis - is the art of cracking cryptographic systems. One of the more popular forms of encryption is the Caesar cipher. This encryption method works by shifting each letter in the alphabet a certain number of spaces to the right or left. In the example below, the cipher is shifting to the right by three letters. A becomes D, B becomes E, C becomes F, etc. Description To decrypt the message, the reader must know how many spaces to shift the letters. For example, to encrypt the word TESTOUT using the Caesar Cipher with a shift of three to the right, TESTOUT would become WHVWRXW. Below is the complete Caesar cipher using a shift of three letters to the right (you can see below which letters are used when they are shifted three spaces): Description This is a very simple example of cryptography and is easily decrypted. With today's computing power, encryption methods used are much more complicated and powerful. Cryptography Concepts There are three main concepts to understand when dealing with today's encryption methods: encryption keys, hashing, and digital signatures. Cryptography Concept\tDescription Encryption keys Encryption keys are used to encrypt and decrypt data. The key is a string of bits randomly generated using a specific cipher, such as Advanced Encryption Standard (AES). There are two types of encryption methods used with keys: symmetric and asymmetric. Symmetric encryption uses the same key to encrypt and decrypt data. Asymmetric encryption uses one key to encrypt the data and a different key to decrypt the data. These keys are known as a public key and private key. Hashing Hashing is the process of converting one value into another using a mathematical algorithm like MD5 or SHA. This fixed length of data is called the hash. Hashing is used on data that does not need to be decrypted, such as passwords. When a piece of data is run through a hashing algorithm, it always generates the same hash. If even one letter in a file has been altered, the resulting hash would be different. Because of this, hashing can be used to verify that data has not been altered during transmission. A hash cannot be decrypted. However, when using hashing for passwords, many online sites have collected massive databases containing a hash for tens of millions (or more) of possible passwords. Once a hash has been captured, it can be compared with the hashes found in the database, quickly resulting in the password used to create the hash. Salt Salt, or salting the hash, means that a random number of characters are added to the password before the hash is created. For example, if the password to be hashed was p@ssw0rd, a salt, such as E1343135E119C253, may be added. Therefore, the string to be hashed would be p@ssw0rdE1343135E119C253. Since the salt is randomly generated each time, even if the same password is used and is of varying lengths, it’s virtually impossible to create a database containing all the possible salted passwords. Digital signatures\tBy combining a user's private encryption key and a hash of the data, a user can create a digital signature. A digital signature verifies that the data is legitimate and provides non-repudiation. This means that the sender cannot deny having sent the file. Cryptography Methods There are many different cryptography methods used today. One important thing to keep in mind is that all cryptography uses advanced math concepts to generate encryption keys and hashes. Cryptography Method Description Elliptic Curve Cryptography (ECC)\tElliptic Curve Cryptography is one of the newer methods being implemented. ECC can generate smaller keys that are more secure than most other methods. Many websites today use ECC to secure connections and data transmissions. Perfect Forward Secrecy\tThis cryptography method is used quite often in messaging apps. Instead of the same key being used for an entire conversation or session on a website, each transmission is encrypted with a different unique key. Steganography\tSteganography is the technique of hiding or concealing a file, message, image, or video within another file, message, image, or video. Special programs are often used to hide messages in media files. If a hacker intercepts the message, all they see is the media. They don't know that there is a hidden message.",
  "chunks": [
    {
      "chunk_id": "3.1.2_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course introduces foundational security concepts essential for protecting networks and information systems. Key topics include risk management, threat analysis, cryptography, and identity management, with a focus on practical applications such as implementing security controls and responding to incidents. This course equips learners with the skills needed to secure organizational assets and comply with industry standards.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.2",
        "title": "Cryptography Facts",
        "content_type": "text",
        "filename": "3.1.2_Cryptography_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.2_Cryptography_Facts_[text].txt",
        "word_count": 931,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.2_chunk_2",
      "content": "The goal of all IT security specialists is to keep data safe. Hackers find ways to circumvent firewalls, IPS devices, and other security protocols put in place. Cryptography is one additional layer of defense that can be used to protect data.",
      "summary": "Cryptography serves as a crucial layer of defense in IT security, complementing existing measures like firewalls and intrusion prevention systems to safeguard data from hackers. By encrypting information, it ensures confidentiality and integrity, making it significantly more challenging for unauthorized users to access or alter sensitive data. Understanding cryptographic principles is essential for IT security specialists to effectively protect organizational information assets.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.2",
        "title": "Cryptography Facts",
        "content_type": "text",
        "filename": "3.1.2_Cryptography_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.2_Cryptography_Facts_[text].txt",
        "word_count": 931,
        "has_content": true
      },
      "section_header": "3.1.2 Cryptography Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.2_chunk_3",
      "content": "Cryptography overview Cryptography concepts Cryptography methods Cryptography Overview Cryptography is the process of writing or solving messages using a secret code. This is the opposite of security through obscurity. Security through obscurity means keeping something a secret by hiding it. This is considered impossible (or at least high risk) on a computer system. With cryptography, it does not matter if third parties know of the existence and location of the secret because they can never understand what it is without the means to decode it. A form of cryptography called encryption has been used throughout the ages, mainly to keep messages out of the hands of enemies. Encryption is the process of converting normal readable text into something unintelligible called ciphertext. A cipher is the method or algorithm used to encrypt or convert the data.",
      "summary": "This lesson introduces cryptography as a vital security practice that transforms readable information into an unintelligible format, known as ciphertext, using algorithms called ciphers. Unlike security through obscurity, which relies on keeping information hidden, cryptography ensures that even if the existence of the data is known, it remains secure from unauthorized access. Key concepts include the principles of encryption and the various methods employed to protect sensitive information from adversaries.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.2",
        "title": "Cryptography Facts",
        "content_type": "text",
        "filename": "3.1.2_Cryptography_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.2_Cryptography_Facts_[text].txt",
        "word_count": 931,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.1.2_chunk_4",
      "content": "Plaintext (or cleartext) - is an unencrypted message. Ciphertext - is an encrypted message. Algorithm - is the process used to encrypt and decrypt a message. Cryptanalysis - is the art of cracking cryptographic systems. One of the more popular forms of encryption is the Caesar cipher. This encryption method works by shifting each letter in the alphabet a certain number of spaces to the right or left. In the example below, the cipher is shifting to the right by three letters. A becomes D, B becomes E, C becomes F, etc. Description To decrypt the message, the reader must know how many spaces to shift the letters. For example, to encrypt the word TESTOUT using the Caesar Cipher with a shift of three to the right, TESTOUT would become WHVWRXW. Below is the complete Caesar cipher using a shift of three letters to the right (you can see below which letters are used when they are shifted three spaces): Description This is a very simple example of cryptography and is easily decrypted. With today's computing power, encryption methods used are much more complicated and powerful. Cryptography Concepts There are three main concepts to understand when dealing with today's encryption methods: encryption keys, hashing, and digital signatures. Cryptography Concept\tDescription Encryption keys Encryption keys are used to encrypt and decrypt data. The key is a string of bits randomly generated using a specific cipher, such as Advanced Encryption Standard (AES). There are two types of encryption methods used with keys: symmetric and asymmetric. Symmetric encryption uses the same key to encrypt and decrypt data. Asymmetric encryption uses one key to encrypt the data and a different key to decrypt the data. These keys are known as a public key and private key. Hashing Hashing is the process of converting one value into another using a mathematical algorithm like MD5 or SHA. This fixed length of data is called the hash. Hashing is used on data that does not need to be decrypted, such as passwords. When a piece of data is run through a hashing algorithm, it always generates the same hash. If even one letter in a file has been altered, the resulting hash would be different. Because of this, hashing can be used to verify that data has not been altered during transmission. A hash cannot be decrypted. However, when using hashing for passwords, many online sites have collected massive databases containing a hash for tens of millions (or more) of possible passwords. Once a hash has been captured, it can be compared with the hashes found in the database, quickly resulting in the password used to create the hash. Salt Salt, or salting the hash, means that a random number of characters are added to the password before the hash is created. For example, if the password to be hashed was p@ssw0rd, a salt, such as E1343135E119C253, may be added. Therefore, the string to be hashed would be p@ssw0rdE1343135E119C253. Since the salt is randomly generated each time, even if the same password is used and is of varying lengths, it’s virtually impossible to create a database containing all the possible salted passwords. Digital signatures\tBy combining a user's private encryption key and a hash of the data, a user can create a digital signature. A digital signature verifies that the data is legitimate and provides non-repudiation. This means that the sender cannot deny having sent the file. Cryptography Methods There are many different cryptography methods used today. One important thing to keep in mind is that all cryptography uses advanced math concepts to generate encryption keys and hashes. Cryptography Method Description Elliptic Curve Cryptography (ECC)\tElliptic Curve Cryptography is one of the newer methods being implemented. ECC can generate smaller keys that are more secure than most other methods. Many websites today use ECC to secure connections and data transmissions. Perfect Forward Secrecy\tThis cryptography method is used quite often in messaging apps. Instead of the same key being used for an entire conversation or session on a website, each transmission is encrypted with a different unique key. Steganography\tSteganography is the technique of hiding or concealing a file, message, image, or video within another file, message, image, or video. Special programs are often used to hide messages in media files. If a hacker intercepts the message, all they see is the media. They don't know that there is a hidden message.",
      "summary": "The CompTIA Security+ course covers essential cryptography concepts, including plaintext, ciphertext, encryption algorithms, and cryptanalysis, with practical applications such as the Caesar cipher for basic encryption. Key topics include encryption keys (symmetric and asymmetric), hashing for data integrity, and digital signatures for authentication and non-repudiation. Advanced methods like Elliptic Curve Cryptography, Perfect Forward Secrecy, and steganography illustrate the evolving complexity and security of modern cryptographic practices.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.1.2",
        "title": "Cryptography Facts",
        "content_type": "text",
        "filename": "3.1.2_Cryptography_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.1.2_Cryptography_Facts_[text].txt",
        "word_count": 931,
        "has_content": true
      },
      "section_header": "The following terminology is used to discuss cryptography:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 4
}