{
  "metadata": {
    "chapter_num": "3",
    "section_num": "3.5.2",
    "title": "Public Key Infrastructure Facts",
    "content_type": "text",
    "filename": "3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
    "word_count": 989,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Public Key Infrastructure (PKI) is the framework that helps to establish trust in the use of public key cryptography to sign and encrypt messages via digital certificates. A digital certificate is a public assertion of identity validated by a certificate authority (CA). Certificate authorities Digital certificates Certificate attributes Certificate Authorities Public key cryptography solves the problem of distributing encryption keys when you want to communicate securely with others or authenticate a message that you send to others. When you want others to send you confidential messages, you give them your public key to encrypt the message. The message can then only be decrypted by your private key, which you keep known only to yourself. When you want to authenticate yourself to others, you sign a hash of your message with your private key. You give others your public key to use to verify the signature. As only you know the private key, everyone can be assured that only you could have created the signature. The basic problem with public key cryptography is that while the owner of a private key can authenticate messages, there is no mechanism for establishing the owner's identity. This problem is particularly evident with e-commerce. How can you be sure that a shopping site or banking service is really maintained by whom it claims? The fact that the site is distributing a public key to secure communications is no guarantee of actual identity. How do you know that you are corresponding directly with the site using its genuine public key? How can you be sure there is no threat actor with network access intercepting and modifying what you think the legitimate server is sending you? Public key infrastructure (PKI) aims to prove that the owners of public keys are who they say they are. Under PKI, anyone issuing a public key should publish it in a digital certificate. The certificate's validity is guaranteed by a certificate authority (CA). PKI can use private or third-party CAs. A private CA can be set up within an organization for internal communications. The certificates it issues will only be trusted within the organization. For public or business-to-business communications, a third-party CA can be used to establish a trust relationship between servers and clients. Examples of third-party CAs include Comodo, DigiCert, GeoTrust, IdenTrust, and Let's Encrypt. Public key infrastructure allows clients to establish a trust relationship with servers via certificate authorities Description Provide a range of certificate services useful to the community of users serviced by the CA. Ensure the validity of certificates and the identity of those applying for them (registration). Establish trust in the CA with users, governments, regulatory authorities, and enterprises such as financial institutions. Manage the servers (repositories) that store and administer the certificates. Perform key and certificate lifecycle management, notably revoking invalid certificates. Digital Certificates A digital certificate is essentially a wrapper for a subject's public key. As well as the public key, it contains information about the subject and the certificate's issuer. The certificate is digitally signed to prove that it was issued to the subject by a particular CA. The subject could be a human user (for certificates allowing the signing of messages, for instance) or a computer server (for a web server hosting confidential transactions, for instance). Digital certificate details showing the subject's public key Screenshot used with permission from Microsoft Description Digital certificates are based on the X.509 standard approved by the International Telecommunications Union and standardized by the Internet Engineering Task Force (tools.ietf.org/html/rfc5280). RSA also created a set of standards, referred to as Public Key Cryptography Standards (PKCS), to promote the use of public key infrastructure. Certificate Attributes Each CA is responsible for maintaining a database containing the information or attributes of each certificate. The attributes that can be included are: Version - The X.509 version used for the certificate. Serial Number - A unique identifier for each certificate. Signature algorithm - The algorithm used to sign the certificate (SHA-2, RSA, etc.). Issuer - The CA that issues the certificate. Valid From and Valid To - The two fields that show the validity period of the certificate. Subject - The field that contains the name and location information of the organization. Public Key - The algorithm used to create the key and the public key information. Depending on the organization, there may also be additional optional fields called extensions in the certificate. One of the key attributes is the Valid To field. If a certificate is not renewed by this date, it will expire and no longer be valid. Aside from expiration, some other reasons a certificate might be invalidated are: The organization no longer exists. The private key has been compromised. The issued certificate is discovered to be fake. If a certificate is invalidated for these or other reasons, it will be added to a certificate revocation list (CRL). The CRL is a blacklist of certificates. CAs must maintain and constantly update the CRLs as part of their databases. Web browsers automatically download updated CRLs at set intervals. The X.509 standard also defines an internet protocol that can be used to determine the validity or state of a certificate. This is called the Online Certificate Status Protocol (OCSP). OCSP can be used to simplify the process of checking whether or not a certificate is valid. OCSP is designed to replace CRLs. Instead of a CA maintaining the CRL, an OCSP server called a responder maintains the lists of any revoked certificate. When the browser connects to a site, the browser sends a request to the OCSP responder to check the validity of the certificate. OCSP provides the following benefits: Timely information on the status of a certificate. Better bandwidth management because the client does not download the entire CRL. A grace period for expired certificates.",
  "chunks": [
    {
      "chunk_id": "3.5.2_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces fundamental security concepts essential for protecting information systems. Key topics include risk management, threat analysis, cryptography, network security, and incident response. Practical applications emphasize real-world scenarios and best practices for implementing effective security measures in various environments.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.5.2",
        "title": "Public Key Infrastructure Facts",
        "content_type": "text",
        "filename": "3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "word_count": 989,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.5.2_chunk_2",
      "content": "Public Key Infrastructure (PKI) is the framework that helps to establish trust in the use of public key cryptography to sign and encrypt messages via digital certificates. A digital certificate is a public assertion of identity validated by a certificate authority (CA).",
      "summary": "Public Key Infrastructure (PKI) is essential for establishing trust in public key cryptography, enabling secure message signing and encryption through the use of digital certificates. These certificates serve as public assertions of identity, validated by a certificate authority (CA), ensuring the authenticity and integrity of communications in various applications. Understanding PKI is crucial for implementing secure systems and protecting sensitive information.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.5.2",
        "title": "Public Key Infrastructure Facts",
        "content_type": "text",
        "filename": "3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "word_count": 989,
        "has_content": true
      },
      "section_header": "3.5.2 Public Key Infrastructure Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.5.2_chunk_3",
      "content": "Certificate authorities Digital certificates Certificate attributes Certificate Authorities Public key cryptography solves the problem of distributing encryption keys when you want to communicate securely with others or authenticate a message that you send to others. When you want others to send you confidential messages, you give them your public key to encrypt the message. The message can then only be decrypted by your private key, which you keep known only to yourself. When you want to authenticate yourself to others, you sign a hash of your message with your private key. You give others your public key to use to verify the signature. As only you know the private key, everyone can be assured that only you could have created the signature. The basic problem with public key cryptography is that while the owner of a private key can authenticate messages, there is no mechanism for establishing the owner's identity. This problem is particularly evident with e-commerce. How can you be sure that a shopping site or banking service is really maintained by whom it claims? The fact that the site is distributing a public key to secure communications is no guarantee of actual identity. How do you know that you are corresponding directly with the site using its genuine public key? How can you be sure there is no threat actor with network access intercepting and modifying what you think the legitimate server is sending you? Public key infrastructure (PKI) aims to prove that the owners of public keys are who they say they are. Under PKI, anyone issuing a public key should publish it in a digital certificate. The certificate's validity is guaranteed by a certificate authority (CA). PKI can use private or third-party CAs. A private CA can be set up within an organization for internal communications. The certificates it issues will only be trusted within the organization. For public or business-to-business communications, a third-party CA can be used to establish a trust relationship between servers and clients. Examples of third-party CAs include Comodo, DigiCert, GeoTrust, IdenTrust, and Let's Encrypt. Public key infrastructure allows clients to establish a trust relationship with servers via certificate authorities Description",
      "summary": "This lesson introduces key concepts of public key cryptography and its role in secure communications, emphasizing the importance of digital certificates and certificate authorities (CAs) in establishing trust. It explains how public key infrastructure (PKI) addresses the challenge of verifying identities in e-commerce by ensuring that public keys are associated with legitimate entities through certificates issued by trusted CAs. The lesson also distinguishes between private and third-party CAs, highlighting their applications in both internal and external communications.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.5.2",
        "title": "Public Key Infrastructure Facts",
        "content_type": "text",
        "filename": "3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "word_count": 989,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "3.5.2_chunk_4",
      "content": "Provide a range of certificate services useful to the community of users serviced by the CA. Ensure the validity of certificates and the identity of those applying for them (registration). Establish trust in the CA with users, governments, regulatory authorities, and enterprises such as financial institutions. Manage the servers (repositories) that store and administer the certificates. Perform key and certificate lifecycle management, notably revoking invalid certificates. Digital Certificates A digital certificate is essentially a wrapper for a subject's public key. As well as the public key, it contains information about the subject and the certificate's issuer. The certificate is digitally signed to prove that it was issued to the subject by a particular CA. The subject could be a human user (for certificates allowing the signing of messages, for instance) or a computer server (for a web server hosting confidential transactions, for instance). Digital certificate details showing the subject's public key Screenshot used with permission from Microsoft Description Digital certificates are based on the X.509 standard approved by the International Telecommunications Union and standardized by the Internet Engineering Task Force (tools.ietf.org/html/rfc5280). RSA also created a set of standards, referred to as Public Key Cryptography Standards (PKCS), to promote the use of public key infrastructure. Certificate Attributes Each CA is responsible for maintaining a database containing the information or attributes of each certificate. The attributes that can be included are: Version - The X.509 version used for the certificate. Serial Number - A unique identifier for each certificate. Signature algorithm - The algorithm used to sign the certificate (SHA-2, RSA, etc.). Issuer - The CA that issues the certificate. Valid From and Valid To - The two fields that show the validity period of the certificate. Subject - The field that contains the name and location information of the organization. Public Key - The algorithm used to create the key and the public key information. Depending on the organization, there may also be additional optional fields called extensions in the certificate. One of the key attributes is the Valid To field. If a certificate is not renewed by this date, it will expire and no longer be valid. Aside from expiration, some other reasons a certificate might be invalidated are: The organization no longer exists. The private key has been compromised. The issued certificate is discovered to be fake. If a certificate is invalidated for these or other reasons, it will be added to a certificate revocation list (CRL). The CRL is a blacklist of certificates. CAs must maintain and constantly update the CRLs as part of their databases. Web browsers automatically download updated CRLs at set intervals. The X.509 standard also defines an internet protocol that can be used to determine the validity or state of a certificate. This is called the Online Certificate Status Protocol (OCSP). OCSP can be used to simplify the process of checking whether or not a certificate is valid. OCSP is designed to replace CRLs. Instead of a CA maintaining the CRL, an OCSP server called a responder maintains the lists of any revoked certificate. When the browser connects to a site, the browser sends a request to the OCSP responder to check the validity of the certificate. OCSP provides the following benefits: Timely information on the status of a certificate. Better bandwidth management because the client does not download the entire CRL. A grace period for expired certificates.",
      "summary": "A third-party public Certificate Authority (CA) provides essential services such as validating certificates and identities, establishing trust with users and organizations, and managing the lifecycle of digital certificates. Digital certificates, based on the X.509 standard, encapsulate a subject's public key and relevant information, while CAs maintain databases of certificate attributes and revocation lists. The Online Certificate Status Protocol (OCSP) enhances the process of checking certificate validity by allowing real-time status updates, improving efficiency over traditional Certificate Revocation Lists (CRLs).",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.5.2",
        "title": "Public Key Infrastructure Facts",
        "content_type": "text",
        "filename": "3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.5.2_Public_Key_Infrastructure_Facts_[text].txt",
        "word_count": 989,
        "has_content": true
      },
      "section_header": "The functions of a third-party public CA are as follows:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 4
}