{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.3.4",
    "title": "Screened Subnet Facts",
    "content_type": "text",
    "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
    "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
    "word_count": 853,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Screened subnets Screened subnet terms Screened Subnets A screened subnet, also known as a perimeter network, creates an additional layer of protection between an organization's internal network and the internet. A screened subnet acts as a neutral zone, separating public-facing servers from sensitive internal network resources to reduce the exposure of the internal network resources to external threats. In practical terms, the screened subnet often hosts web, email, DNS, or FTP services. These systems must typically be accessible from the public internet but isolated from sensitive internal systems to limit the impact of a breach of one of these services. By placing these servers in the screened subnet, an organization can limit the damage if these servers are compromised. Firewalls are typically used to create and control the traffic to and from the screened subnet. The first firewall, between the internet and the screened subnet, is configured to allow traffic to the services hosted in the screened subnet. The second firewall, between the screened subnet and the internal network, is configured to block most (practically all) traffic from the screened subnet to the internal network. A screened subnet is a fundamental part of a network's security architecture and an important example of network segmentation as a type of security control. If the firewall managing traffic into the screened subnet fails, only the servers in the screened subnet are subject to compromise. The LAN is protected by default. Packet filters on the firewall allow traffic directed to the public resources inside the screened subnet. Packet filters also prevent unauthorized traffic from reaching the private network. When designing the firewall packet filters, a common practice is to close all ports. Open only those ports necessary for accessing the public resources inside the screened subnet. To allow access to private resources from the internet, use one of the following approaches: Place a VPN server inside the screened subnet. Require internet users to authenticate to the VPN server and then allow communications from the VPN server to the private network. Only communications coming through the VPN server are allowed through the inner firewall. Copy resources accessible to internet users to servers inside the screened subnet. Even with authentication and authorization configured, this approach exposes those resources in the screened subnet to internet attacks. Typically, firewalls allow traffic originating in the secured internal network into the screened subnet and through to the internet. Traffic that originates in the screened subnet (low-security area) or the internet (no-security area) should not be allowed access to the intranet (high-security area). Only place servers in the screened subnet that need to be there. Screened Subnet Terms The following terms are related to screened subnet. Term Definition Bastion or sacrificial host A bastion host is any host that is exposed to attack and that has been hardened (or fortified) against those attacks. The bastion host is sometimes referred to as a sacrificial host because it is assumed that it will be subject to attack. The term has been applied to the following types of devices: A host that is exposed on the network and is not protected by a firewall device. The device that provides the firewall service to the screened network behind it. Attacks must pass through the bastion host before they are allowed inside the screened subnet. A honeypot device that is purposefully exposed to attack in order to distract attackers. Separate roles of bastion hosts by placing a single application on each server. Fully patch your bastion host on the operating system and on applications. Run current versions of antivirus and anti-spyware software. Include a personal firewall. Uninstall any unnecessary applications or utilities. Disable and lock down all unnecessary services and ports. Tighten security on the registry and the user database. Add IP filters. Run lockdown facilities, such as IIS lock down and URLScan. Screening router\tA screening router is the router that is most external to your network and closest to the internet. It uses access control lists (ACLs) to filter packets as a form of security. A firewall performing router functions is considered a screening router. Dual-homed gateway\tA dual-homed gateway is a firewall device that typically has three network interfaces: one connected to the internet, one connected to the public subnet, and one connected to the private network. Gateways have to be logged on to, whereas routers pass traffic through without user authentication. IP forwarding is disabled on gateways, effectively blocking through traffic to the network. Screened-host gateway\tA screened-host gateway resides within the screened subnet, requiring users to authenticate in order to access resources within the screened subnet or the intranet. Two-firewall screened subnet\tA screened subnet uses two firewalls. The external firewall is connected to the internet and allows access to public resources. The internal firewall connects the screened subnet to the private network. With a screened subnet, if the outer firewall is compromised, the inner firewall still protects the private network.",
  "chunks": [
    {
      "chunk_id": "5.3.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course introduces essential security concepts, including risk management, threat analysis, and security controls. Key topics cover network security, compliance, operational security, and incident response, providing a comprehensive foundation for identifying and mitigating security threats. Practical applications emphasize real-world scenarios and hands-on exercises to prepare learners for effective security practices in various environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.4",
        "title": "Screened Subnet Facts",
        "content_type": "text",
        "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
        "word_count": 853,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.3.4_chunk_2",
      "content": "This lesson covers the following topics: Screened subnets Screened subnet terms Screened Subnets A screened subnet, also known as a perimeter network, creates an additional layer of protection between an organization's internal network and the internet. A screened subnet acts as a neutral zone, separating public-facing servers from sensitive internal network resources to reduce the exposure of the internal network resources to external threats. In practical terms, the screened subnet often hosts web, email, DNS, or FTP services. These systems must typically be accessible from the public internet but isolated from sensitive internal systems to limit the impact of a breach of one of these services. By placing these servers in the screened subnet, an organization can limit the damage if these servers are compromised. Firewalls are typically used to create and control the traffic to and from the screened subnet. The first firewall, between the internet and the screened subnet, is configured to allow traffic to the services hosted in the screened subnet. The second firewall, between the screened subnet and the internal network, is configured to block most (practically all) traffic from the screened subnet to the internal network. A screened subnet is a fundamental part of a network's security architecture and an important example of network segmentation as a type of security control.",
      "summary": "A screened subnet, or perimeter network, serves as an additional protective layer between an organization's internal network and the internet, isolating public-facing servers from sensitive internal resources to mitigate external threats. This configuration typically hosts services like web, email, DNS, or FTP, using two firewalls to control traffic and limit exposure in the event of a breach. By implementing a screened subnet, organizations enhance their security architecture through effective network segmentation.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.4",
        "title": "Screened Subnet Facts",
        "content_type": "text",
        "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
        "word_count": 853,
        "has_content": true
      },
      "section_header": "5.3.4 Screened Subnet Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.3.4_chunk_3",
      "content": "If the firewall managing traffic into the screened subnet fails, only the servers in the screened subnet are subject to compromise. The LAN is protected by default. Packet filters on the firewall allow traffic directed to the public resources inside the screened subnet. Packet filters also prevent unauthorized traffic from reaching the private network. When designing the firewall packet filters, a common practice is to close all ports. Open only those ports necessary for accessing the public resources inside the screened subnet. To allow access to private resources from the internet, use one of the following approaches: Place a VPN server inside the screened subnet. Require internet users to authenticate to the VPN server and then allow communications from the VPN server to the private network. Only communications coming through the VPN server are allowed through the inner firewall. Copy resources accessible to internet users to servers inside the screened subnet. Even with authentication and authorization configured, this approach exposes those resources in the screened subnet to internet attacks. Typically, firewalls allow traffic originating in the secured internal network into the screened subnet and through to the internet. Traffic that originates in the screened subnet (low-security area) or the internet (no-security area) should not be allowed access to the intranet (high-security area).",
      "summary": "In a screened subnet architecture, if the firewall fails, only the servers within the subnet are at risk, while the internal LAN remains protected. Effective firewall design involves implementing strict packet filters that close all unnecessary ports, allowing only essential traffic to public resources. For secure access to private resources, options include using a VPN server for authenticated connections or copying resources to the screened subnet, though the latter increases exposure to internet threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.4",
        "title": "Screened Subnet Facts",
        "content_type": "text",
        "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
        "word_count": 853,
        "has_content": true
      },
      "section_header": "Be aware of the following screened subnet facts:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.3.4_chunk_4",
      "content": "Only place servers in the screened subnet that need to be there. Screened Subnet Terms The following terms are related to screened subnet. Term Definition Bastion or sacrificial host A bastion host is any host that is exposed to attack and that has been hardened (or fortified) against those attacks. The bastion host is sometimes referred to as a sacrificial host because it is assumed that it will be subject to attack. The term has been applied to the following types of devices: A host that is exposed on the network and is not protected by a firewall device. The device that provides the firewall service to the screened network behind it. Attacks must pass through the bastion host before they are allowed inside the screened subnet. A honeypot device that is purposefully exposed to attack in order to distract attackers.",
      "summary": "In the CompTIA Security+ course, the concept of a screened subnet emphasizes the importance of placing only necessary servers within this secure area to minimize exposure to threats. Key terms include the bastion host, which is a fortified device designed to withstand attacks and serve as the first line of defense, and honeypots, which are intentionally vulnerable systems used to divert attackers. Understanding these components is crucial for implementing effective network security strategies.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.4",
        "title": "Screened Subnet Facts",
        "content_type": "text",
        "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
        "word_count": 853,
        "has_content": true
      },
      "section_header": "Note:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.3.4_chunk_5",
      "content": "Separate roles of bastion hosts by placing a single application on each server. Fully patch your bastion host on the operating system and on applications. Run current versions of antivirus and anti-spyware software. Include a personal firewall. Uninstall any unnecessary applications or utilities. Disable and lock down all unnecessary services and ports. Tighten security on the registry and the user database. Add IP filters. Run lockdown facilities, such as IIS lock down and URLScan. Screening router\tA screening router is the router that is most external to your network and closest to the internet. It uses access control lists (ACLs) to filter packets as a form of security. A firewall performing router functions is considered a screening router. Dual-homed gateway\tA dual-homed gateway is a firewall device that typically has three network interfaces: one connected to the internet, one connected to the public subnet, and one connected to the private network. Gateways have to be logged on to, whereas routers pass traffic through without user authentication. IP forwarding is disabled on gateways, effectively blocking through traffic to the network. Screened-host gateway\tA screened-host gateway resides within the screened subnet, requiring users to authenticate in order to access resources within the screened subnet or the intranet. Two-firewall screened subnet\tA screened subnet uses two firewalls. The external firewall is connected to the internet and allows access to public resources. The internal firewall connects the screened subnet to the private network. With a screened subnet, if the outer firewall is compromised, the inner firewall still protects the private network.",
      "summary": "To harden a bastion host, it is essential to isolate applications, apply all patches, utilize up-to-date antivirus software, and implement a personal firewall while removing unnecessary applications and services. Additionally, security can be enhanced through IP filtering and lockdown facilities. Understanding different network security architectures, such as screening routers, dual-homed gateways, and screened-host gateways, is crucial for establishing robust defenses against external threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.3.4",
        "title": "Screened Subnet Facts",
        "content_type": "text",
        "filename": "5.3.4_Screened_Subnet_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.3.4_Screened_Subnet_Facts_[text].txt",
        "word_count": 853,
        "has_content": true
      },
      "section_header": "The following actions should be taken to harden a bastion host:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 5
}