{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.5.8",
    "title": "VPN Protocol Facts",
    "content_type": "text",
    "filename": "5.5.8_VPN_Protocol_Facts_[text].txt",
    "file_path": "data_raw/05_Network_Architecture/5.5.8_VPN_Protocol_Facts_[text].txt",
    "word_count": 1227,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: VPN Tunneling Protocol Transport Layer Security Tunneling Internet Protocol Security Tunneling Secure Communication and Access VPN Tunneling Protocol A VPN can use a Tunneling Protocol that encrypts packet contents and wraps them in an unencrypted packet. The Tunneling Protocol (also referred to as the VPN Protocol) identifies the methods that devices use to establish the VPN connection and encrypt the data. The three types of protocols used by VPNs are: Carrier Protocol (such as IP). Tunneling Protocol (such as PPTP or L2TP). Passenger Protocol (for the data being transmitted). Many networks make use of a piece of hardware called a VPN concentrator. VPN concentrators are advanced routers that can create and maintain many secure connections to the network through VPN tunnels. Transport Layer Security Tunneling A transport layer security (TLS) VPN means the client connects to the remote access server using digital certificates. The server certificate identifies the VPN gateway to the client. Optionally, the client can also be configured with its own certificate. This allows for mutual authentication, where both server and client prove their identity to one another. TLS creates an encrypted tunnel for the user to submit authentication credentials. These would normally be processed by a RADIUS server. Once the user is authenticated and the connection is fully established, the VPN gateway tunnels all communications for the local network over the secure socket. Configuring an OpenVPN server in the OPNsense security appliance Description Screenshot courtesy of OPNsense Description A TLS VPN can use either TCP or UDP. UDP might be chosen for marginally superior performance, especially when tunneling latency-sensitive traffic such as voice or video. TCP might be easier to use with a default firewall policy. TLS over UDP is also referred to as Datagram TLS (DTLS). It is important to use a secure version of TLS. The latest version at the time of writing is TLS 1.3. TLS 1.2 is also still supported. Versions earlier than this are deprecated. Internet Protocol Security Tunneling Transport Layer Security is applied at the application level. Internet Protocol Security (IPsec) operates at the network layer of the OSI model (layer 3). This means that it can be implemented without having to configure specific application support and that it incurs less packet overhead. There are two core protocols in IPsec, which can be applied singly or together, depending on the policy: Authentication Header (AH)—performs a cryptographic hash on the whole packet, including the IP header, plus a shared secret key (known only to the communicating hosts), and adds this value in its header as an Integrity Check Value (ICV). The recipient performs the same function on the packet and key and should derive the same value to confirm that the packet has not been modified. The payload is not encrypted so this protocol does not provide confidentiality. Encapsulating Security Payload (ESP) can be used to encrypt the packet rather than simply calculating an ICV. ESP attaches three fields to the packet: a header, a trailer (providing padding for the cryptographic function), and an Integrity Check Value. Unlike AH, ESP excludes the IP header when calculating the ICV. Transport mode—is used to secure communications between hosts on a private network. When ESP is applied in transport mode, the IP header for each packet is not encrypted, just the payload data. If AH is used in transport mode, it can provide integrity for the IP header. Description Tunnel mode—is used for communications between VPN sites across an unsecure network. With ESP, the whole IP packet (header and payload) is encrypted and encapsulated as a datagram with a new IP header. AH has no use case in tunnel mode, as confidentiality is usually required. IPsec datagram using ESP in tunnel mode Description Configuring a site-to-site VPN using IPsec tunneling with ESP encryption in the OPNsense security appliance Screenshot courtesy of OPNsense Description Each host or router that uses IPsec must be assigned a policy. An IPsec policy sets the authentication mechanism and also the use of AH/ESP and transport or tunnel mode for a connection between two peers. IPsec's encryption and hashing functions depend on a shared secret. The secret must be communicated to both peers, and the peers must perform mutual authentication to confirm one another's identity. The Internet Key Exchange (IKE) p rotocol implements an authentication method, selects which cryptographic ciphers are mutually supported by both peers, and performs key exchange. The set of properties is referred to as a s ecurity association (SA). Description Phase I establishes the identity of the two peers and performs key agreement using the Diffie-Hellman algorithm to create a secure channel. Two methods of authenticating peers are commonly used: Digital certificates —are issued to each peer by a mutually trusted certificate authority to identify one another. Pre-shared key (group authentication) —is when the same passphrase is configured on both peers. Phase II uses the secure channel created in Phase I to establish which ciphers and key sizes will be used with AH and/or ESP in the IPsec session. There are two versions of IKE. Version 1 was designed for site-to-site and host-to-host topologies and requires a supporting protocol to implement remote access VPNs. IKEv2 has some additional features that have made the protocol popular for use as a stand-alone remote access client-to-site VPN solution. The main changes are the following: Supports EAP authentication methods, allowing, for example, user authentication against a RADIUS server. Provides a simple setup mode that reduces bandwidth without compromising security. Allows network address translation (NAT) traversal and MOBIKE multihoming. NAT traversal makes it easier to configure a tunnel allowed by a home router/firewall. Multihoming means that a smartphone client with Wi-Fi and cellular interfaces can keep the IPsec connection alive when switching between them. Secure Communication and Access A Software-Defined Wide Area Network (SD-WAN) enables organizations to connect their various branch offices, datacenters, and cloud infrastructure over a wide area network (WAN). One of the key advantages of SD-WAN is its ability to provide enhanced security features and considerations. For example, SD-WAN uses encryption to protect data as it travels across the network and can segment network traffic based on priority ratings to ensure that critical data is fully protected. Additionally, SD-WAN can intelligently route traffic based on the application and tightly integrate with firewalls to provide additional protection against known threats. SD-WAN centralizes the management of network security policies to simplify enforcing security measures across an entire network. Secure Access Service Edge (SASE) combines the protection of a secure access platform with the agility of a cloud-delivered security architecture. SASE offers a centralized approach to security and access, providing end-to-end protection and streamlining the process of granting secure access to all users, regardless of location. SASE is a network architecture that combines wide area networking (WAN) technologies and cloud-based security services to provide secure access to cloud-based applications and services. SASE offers several security features to help organizations protect their networks and data as SASE operates under a zero trust security model. SASE incorporates Identity and Access Management (IAM) and assumes all users and devices are untrusted until they are authenticated and authorized. SASE also provides a range of threat prevention features, such as intrusion prevention, malware protection, and content filtering.",
  "chunks": [
    {
      "chunk_id": "5.5.8_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course introduces fundamental cybersecurity concepts, emphasizing the importance of protecting networks, devices, and data from threats. Key topics include risk management, cryptography, identity and access management, and incident response. Practical applications focus on implementing security measures, conducting vulnerability assessments, and understanding compliance requirements to safeguard organizational assets.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.8",
        "title": "VPN Protocol Facts",
        "content_type": "text",
        "filename": "5.5.8_VPN_Protocol_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.8_VPN_Protocol_Facts_[text].txt",
        "word_count": 1227,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.5.8_chunk_2",
      "content": "This lesson covers the following topics: VPN Tunneling Protocol Transport Layer Security Tunneling Internet Protocol Security Tunneling Secure Communication and Access VPN Tunneling Protocol A VPN can use a Tunneling Protocol that encrypts packet contents and wraps them in an unencrypted packet. The Tunneling Protocol (also referred to as the VPN Protocol) identifies the methods that devices use to establish the VPN connection and encrypt the data. The three types of protocols used by VPNs are: Carrier Protocol (such as IP). Tunneling Protocol (such as PPTP or L2TP). Passenger Protocol (for the data being transmitted). Many networks make use of a piece of hardware called a VPN concentrator. VPN concentrators are advanced routers that can create and maintain many secure connections to the network through VPN tunnels. Transport Layer Security Tunneling A transport layer security (TLS) VPN means the client connects to the remote access server using digital certificates. The server certificate identifies the VPN gateway to the client. Optionally, the client can also be configured with its own certificate. This allows for mutual authentication, where both server and client prove their identity to one another. TLS creates an encrypted tunnel for the user to submit authentication credentials. These would normally be processed by a RADIUS server. Once the user is authenticated and the connection is fully established, the VPN gateway tunnels all communications for the local network over the secure socket. Configuring an OpenVPN server in the OPNsense security appliance Description Screenshot courtesy of OPNsense Description A TLS VPN can use either TCP or UDP. UDP might be chosen for marginally superior performance, especially when tunneling latency-sensitive traffic such as voice or video. TCP might be easier to use with a default firewall policy. TLS over UDP is also referred to as Datagram TLS (DTLS). It is important to use a secure version of TLS. The latest version at the time of writing is TLS 1.3. TLS 1.2 is also still supported. Versions earlier than this are deprecated. Internet Protocol Security Tunneling Transport Layer Security is applied at the application level. Internet Protocol Security (IPsec) operates at the network layer of the OSI model (layer 3). This means that it can be implemented without having to configure specific application support and that it incurs less packet overhead. There are two core protocols in IPsec, which can be applied singly or together, depending on the policy: Authentication Header (AH)—performs a cryptographic hash on the whole packet, including the IP header, plus a shared secret key (known only to the communicating hosts), and adds this value in its header as an Integrity Check Value (ICV). The recipient performs the same function on the packet and key and should derive the same value to confirm that the packet has not been modified. The payload is not encrypted so this protocol does not provide confidentiality. Encapsulating Security Payload (ESP) can be used to encrypt the packet rather than simply calculating an ICV. ESP attaches three fields to the packet: a header, a trailer (providing padding for the cryptographic function), and an Integrity Check Value. Unlike AH, ESP excludes the IP header when calculating the ICV.",
      "summary": "This lesson on VPN Protocols explores key tunneling protocols used for secure communication, including Transport Layer Security (TLS) and Internet Protocol Security (IPsec). It highlights how TLS establishes encrypted connections using digital certificates for mutual authentication, while IPsec operates at the network layer to provide integrity and confidentiality through its core protocols, Authentication Header (AH) and Encapsulating Security Payload (ESP). Practical applications include the use of VPN concentrators to manage multiple secure connections and the configuration of OpenVPN servers for enhanced security.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.8",
        "title": "VPN Protocol Facts",
        "content_type": "text",
        "filename": "5.5.8_VPN_Protocol_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.8_VPN_Protocol_Facts_[text].txt",
        "word_count": 1227,
        "has_content": true
      },
      "section_header": "5.5.8 VPN Protocol Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.5.8_chunk_3",
      "content": "Transport mode—is used to secure communications between hosts on a private network. When ESP is applied in transport mode, the IP header for each packet is not encrypted, just the payload data. If AH is used in transport mode, it can provide integrity for the IP header. Description Tunnel mode—is used for communications between VPN sites across an unsecure network. With ESP, the whole IP packet (header and payload) is encrypted and encapsulated as a datagram with a new IP header. AH has no use case in tunnel mode, as confidentiality is usually required. IPsec datagram using ESP in tunnel mode Description Configuring a site-to-site VPN using IPsec tunneling with ESP encryption in the OPNsense security appliance Screenshot courtesy of OPNsense Description Each host or router that uses IPsec must be assigned a policy. An IPsec policy sets the authentication mechanism and also the use of AH/ESP and transport or tunnel mode for a connection between two peers. IPsec's encryption and hashing functions depend on a shared secret. The secret must be communicated to both peers, and the peers must perform mutual authentication to confirm one another's identity. The Internet Key Exchange (IKE) p rotocol implements an authentication method, selects which cryptographic ciphers are mutually supported by both peers, and performs key exchange. The set of properties is referred to as a s ecurity association (SA). Description",
      "summary": "IPsec operates in two modes: transport mode, which secures communications between hosts on a private network by encrypting only the payload data, and tunnel mode, which encrypts the entire IP packet for secure communication between VPN sites over unsecure networks. Each IPsec connection requires a policy that defines authentication mechanisms and the use of AH/ESP, while the Internet Key Exchange (IKE) protocol facilitates mutual authentication and key exchange, establishing a security association (SA) between peers. These configurations are essential for ensuring the confidentiality and integrity of data transmitted across networks.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.8",
        "title": "VPN Protocol Facts",
        "content_type": "text",
        "filename": "5.5.8_VPN_Protocol_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.8_VPN_Protocol_Facts_[text].txt",
        "word_count": 1227,
        "has_content": true
      },
      "section_header": "IPsec can be used in two modes:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.5.8_chunk_4",
      "content": "Phase I establishes the identity of the two peers and performs key agreement using the Diffie-Hellman algorithm to create a secure channel. Two methods of authenticating peers are commonly used: Digital certificates —are issued to each peer by a mutually trusted certificate authority to identify one another. Pre-shared key (group authentication) —is when the same passphrase is configured on both peers. Phase II uses the secure channel created in Phase I to establish which ciphers and key sizes will be used with AH and/or ESP in the IPsec session. There are two versions of IKE. Version 1 was designed for site-to-site and host-to-host topologies and requires a supporting protocol to implement remote access VPNs. IKEv2 has some additional features that have made the protocol popular for use as a stand-alone remote access client-to-site VPN solution. The main changes are the following: Supports EAP authentication methods, allowing, for example, user authentication against a RADIUS server. Provides a simple setup mode that reduces bandwidth without compromising security. Allows network address translation (NAT) traversal and MOBIKE multihoming. NAT traversal makes it easier to configure a tunnel allowed by a home router/firewall. Multihoming means that a smartphone client with Wi-Fi and cellular interfaces can keep the IPsec connection alive when switching between them. Secure Communication and Access A Software-Defined Wide Area Network (SD-WAN) enables organizations to connect their various branch offices, datacenters, and cloud infrastructure over a wide area network (WAN). One of the key advantages of SD-WAN is its ability to provide enhanced security features and considerations. For example, SD-WAN uses encryption to protect data as it travels across the network and can segment network traffic based on priority ratings to ensure that critical data is fully protected. Additionally, SD-WAN can intelligently route traffic based on the application and tightly integrate with firewalls to provide additional protection against known threats. SD-WAN centralizes the management of network security policies to simplify enforcing security measures across an entire network. Secure Access Service Edge (SASE) combines the protection of a secure access platform with the agility of a cloud-delivered security architecture. SASE offers a centralized approach to security and access, providing end-to-end protection and streamlining the process of granting secure access to all users, regardless of location. SASE is a network architecture that combines wide area networking (WAN) technologies and cloud-based security services to provide secure access to cloud-based applications and services. SASE offers several security features to help organizations protect their networks and data as SASE operates under a zero trust security model. SASE incorporates Identity and Access Management (IAM) and assumes all users and devices are untrusted until they are authenticated and authorized. SASE also provides a range of threat prevention features, such as intrusion prevention, malware protection, and content filtering.",
      "summary": "IKE negotiations occur in two phases, with Phase I establishing a secure channel through peer authentication using digital certificates or pre-shared keys, and Phase II determining the ciphers and key sizes for the IPsec session. The evolution from IKEv1 to IKEv2 enhances remote access capabilities, supporting EAP authentication, NAT traversal, and multihoming. Additionally, technologies like SD-WAN and SASE provide centralized security management, encryption, and zero trust models to protect data across networks and cloud services, ensuring secure access and traffic prioritization.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.5.8",
        "title": "VPN Protocol Facts",
        "content_type": "text",
        "filename": "5.5.8_VPN_Protocol_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.5.8_VPN_Protocol_Facts_[text].txt",
        "word_count": 1227,
        "has_content": true
      },
      "section_header": "IKE negotiations take place over two phases:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 4
}