{
  "metadata": {
    "chapter_num": "5",
    "section_num": "5.9.3",
    "title": "Switch Security Facts",
    "content_type": "text",
    "filename": "5.9.3_Switch_Security_Facts_[text].txt",
    "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
    "word_count": 1443,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 This lesson covers the following topics: Security switch features Implement switch security Spanning Tree Protocol Security Switch Features The following table lists switch features that can be implemented to increase network security: Feature Description Virtual LAN A virtual LAN (VLAN) is a logical grouping of computers based on switch ports. VLAN membership is configured by assigning a switch port to a VLAN. A switch can have multiple VLANs configured on it, but each switch port can only be a member of a single VLAN (see exception described below). VLANs can be defined on a single switch or configured on multiple interconnected switches. With multiple switches, each switch can be configured with the same VLANs, and devices on one switch can communicate with devices on other switches as long as they are members of the same VLAN. A trunk port is used to connect two switches together. Typically, gigabit ethernet ports are used for trunk ports, although any port can be a trunk port. A trunk port is a member of all VLANs defined on a switch and carries traffic between the switches. When trunking is used, frames that are sent over a trunk port are tagged by the first switch with the VLAN ID so that the receiving switch knows to which VLAN the frame belongs. The Trunking Protocol describes the format that switches use for frame tagging with the VLAN ID. Because end devices do not understand the VLAN tags, the tag is removed from the frame by the switch before the frame is forwarded to the destination device. VLAN tagging is only used for frames that travel between switches on the trunk ports. Using VLANs, the switch can be used to create multiple IP broadcast domains. Each VLAN is in its own broadcast domain, and broadcast traffic is sent only to members of the same VLAN. In a typical configuration with multiple VLANs, workstations in one VLAN can not communicate with workstations in other VLANs. To enable inter-VLAN communication, you need to use a router (or an OSI Layer 3 switch). MAC filtering/port security With switch port security, the devices that can connect to a switch through the port are restricted. Port security uses the MAC address to identify allowed and denied devices. On the switch, MAC addresses are stored in RAM in a table and are associated with the port. The table can be manually configured, or learning devices can automatically build the table. You can specify that only a single MAC address is allowed per port, or you can configure each port to allow multiple addresses. With automatic configuration, the next device or specified number of devices can connect to the port and additional devices are denied. A port violation occurs when an unauthorized device tries to connect. The switch configuration determines how the switch handles frames from an unauthorized device. The switch can either drop all frames from the unauthorized device or shut down the port, disabling all communications through that port. Port authentication (802.1x)\tPort authentication is provided by the 802.1x protocol and allows only authenticated devices to connect to the LAN through the switch. Authentication uses user names and passwords, smart cards, or other authentication methods. Implement Switch Security Creating VLANs with switches offers many administrative benefits. For example, you can: Create virtual LANs based on criteria such as workgroup, protocol, or service. Simplify device moves (devices are moved to new VLANs by modifying the port assignment). Control broadcast traffic based on logical criteria (only devices in the same VLAN receive broadcast traffic). Control security (isolate traffic within a VLAN). Route data between VLANs. Provide port filtering. Port filtering filters network packets in and out of devices based on their application type or port number. Route data into and out of the local area network. VLANs are commonly used with voice over IP (VoIP) to distinguish voice traffic from data traffic. Traffic on the voice VLAN can be given a higher priority to ensure timely delivery. MAC filtering uses the MAC address of a device to drop or forward frames through the switch. Port authentication requires that the user or device authenticates before frames are forwarded through the switch. In general, all switch ports are enabled by default. To increase the security of the switch and network, you should disable individual ports that are not in use. Restricting access by MAC address is difficult to manage and still prone to spoofing. Better security is obtained by forcing computers and/or users to authenticate before full network access is granted. The IEEE 802.1X Port-based Network Access Control (PNAC) standard allows a switch to require authentication when a host connects to one of its ports. 802.1X uses authentication, authorization, and accounting (AAA) architecture: Supplicant — the device requesting access such as a user's PC or laptop. Authenticator — the switching device (or any type of network access appliance). This does not validate authentication request s directly but acts as a conduit for authentication data. Authentication server —the server that holds or can contact a directory of network objects and that can validate authentication requests, issue authorizations, and perform accounting of security events. Extensible Authentication Protocol (EAP) — provides a framework for deploying multiple types of authentication methods. It is often used with digital certificates to establish a trust relationship and create a secure tunnel to transmit the user credential or to perform smart-card authentication without a password. Remote Authentication Dial-In User Service (RADIUS) — allows the authenticator and authentication server to communicate authentication and authorization decisions. The authenticator is a RADIUS client; the authentication server is a RADIUS server. When a host connects to an 802.1X-enabled switch port, the switch opens the port for the EAP over LAN (EAPoL) protocol only. The switch port only allows full data access when the host has been authenticated. The switch receives an EAP packet with the supplicant's credentials. These are encrypted and cannot be read by the switch. The switch uses the RADIUS protocol to send the EAP packet to the authentication server. The authentication server can access the directory of user accounts and can validate the credential. If authentication is successful, it informs the switch that full network access can be granted. Description Some hosts are so security-critical that it is unsafe to connect them to any type of network. One example is the root certification authority in PKI. Another example is a host used to analyze malware execution. A host that is not physically connected to any network is said to be air-gapped. It is also possible to configure an air-gapped network. This means that hosts within the air-gapped network can communicate, but there is no cabled or wireless connection to any other network. Military bases, government sites, and industrial facilities use air-gapped networks. Physically isolating a host or group of hosts improves security but also incurs significant management challenges. Device administration has to be performed at a local terminal. Any updates or installs have to be performed using USB or optical media. This media is a potential attack vector and must be scanned before allowing its use on an air-gapped host. Spanning Tree Protocol To provide fault tolerance, many networks implement redundant paths between devices using multiple switches. However, providing redundant paths between segments causes packets to be passed between the redundant paths endlessly. This condition is known as a switching loop. Switching loops lead to incorrect entries in a MAC address table, making a device appear to be connected to the wrong port and causing unicast traffic to be circulated in a loop between switches. The Spanning Tree Protocol runs on switches to prevent switching loops by making only a single path between switches active at a single time. Provides redundant paths between devices. Recovers automatically from a topology change or device failure by unblocking redundant paths. Identifies the optimal path between any two network devices. Calculates the best loop-free path through a network by assigning a role to each bridge or switch and by assigning roles to the ports of each bridge or switch. Root ports, which are configured to communicate directly to the root switch. Designated ports, which forward frames to and from attached hosts. Blocked ports, which form a loop and are used for redundancy. Blocking Listening Learning Forwarding Disabled",
  "chunks": [
    {
      "chunk_id": "5.9.3_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course introduces fundamental security concepts essential for protecting information systems, including risk management, threat analysis, and incident response. Key topics covered include network security, cryptography, identity management, and compliance frameworks. Practical applications involve implementing security measures, conducting vulnerability assessments, and developing incident response strategies to safeguard organizational assets.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_2",
      "content": "This lesson covers the following topics: Security switch features Implement switch security Spanning Tree Protocol Security Switch Features The following table lists switch features that can be implemented to increase network security: Feature Description Virtual LAN",
      "summary": "This lesson on switch security highlights key features and practices to enhance network security, including the implementation of Virtual LANs (VLANs) and Spanning Tree Protocol (STP) security. It emphasizes the importance of configuring switches to prevent unauthorized access and mitigate potential threats within a network. Practical applications include deploying security features to segregate traffic and protect against common vulnerabilities.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "5.9.3 Switch Security Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_3",
      "content": "A virtual LAN (VLAN) is a logical grouping of computers based on switch ports. VLAN membership is configured by assigning a switch port to a VLAN. A switch can have multiple VLANs configured on it, but each switch port can only be a member of a single VLAN (see exception described below). VLANs can be defined on a single switch or configured on multiple interconnected switches. With multiple switches, each switch can be configured with the same VLANs, and devices on one switch can communicate with devices on other switches as long as they are members of the same VLAN. A trunk port is used to connect two switches together. Typically, gigabit ethernet ports are used for trunk ports, although any port can be a trunk port. A trunk port is a member of all VLANs defined on a switch and carries traffic between the switches. When trunking is used, frames that are sent over a trunk port are tagged by the first switch with the VLAN ID so that the receiving switch knows to which VLAN the frame belongs. The Trunking Protocol describes the format that switches use for frame tagging with the VLAN ID. Because end devices do not understand the VLAN tags, the tag is removed from the frame by the switch before the frame is forwarded to the destination device. VLAN tagging is only used for frames that travel between switches on the trunk ports. Using VLANs, the switch can be used to create multiple IP broadcast domains. Each VLAN is in its own broadcast domain, and broadcast traffic is sent only to members of the same VLAN. In a typical configuration with multiple VLANs, workstations in one VLAN can not communicate with workstations in other VLANs. To enable inter-VLAN communication, you need to use a router (or an OSI Layer 3 switch). MAC filtering/port security With switch port security, the devices that can connect to a switch through the port are restricted. Port security uses the MAC address to identify allowed and denied devices. On the switch, MAC addresses are stored in RAM in a table and are associated with the port. The table can be manually configured, or learning devices can automatically build the table. You can specify that only a single MAC address is allowed per port, or you can configure each port to allow multiple addresses. With automatic configuration, the next device or specified number of devices can connect to the port and additional devices are denied. A port violation occurs when an unauthorized device tries to connect. The switch configuration determines how the switch handles frames from an unauthorized device. The switch can either drop all frames from the unauthorized device or shut down the port, disabling all communications through that port. Port authentication (802.1x)\tPort authentication is provided by the 802.1x protocol and allows only authenticated devices to connect to the LAN through the switch. Authentication uses user names and passwords, smart cards, or other authentication methods. Implement Switch Security",
      "summary": "A Virtual LAN (VLAN) is a logical grouping of devices on a switch that allows for the segmentation of networks into separate broadcast domains, enhancing security and performance. VLANs enable devices on different switches to communicate if they belong to the same VLAN, using trunk ports for inter-switch connections and VLAN tagging for traffic identification. Additionally, switch port security mechanisms, such as MAC filtering and 802.1x authentication, restrict device access to the network, ensuring that only authorized devices can connect.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "(VLAN)",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_4",
      "content": "Creating VLANs with switches offers many administrative benefits. For example, you can: Create virtual LANs based on criteria such as workgroup, protocol, or service. Simplify device moves (devices are moved to new VLANs by modifying the port assignment). Control broadcast traffic based on logical criteria (only devices in the same VLAN receive broadcast traffic). Control security (isolate traffic within a VLAN).",
      "summary": "Implementing switch security through VLANs enhances network management by allowing the creation of virtual LANs based on workgroups, protocols, or services. This approach simplifies device relocation and effectively controls broadcast traffic, ensuring that only devices within the same VLAN receive such traffic. Additionally, VLANs enhance security by isolating traffic, thereby reducing the risk of unauthorized access and potential threats.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "Be aware of the following when implementing switch security:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_5",
      "content": "Route data between VLANs. Provide port filtering. Port filtering filters network packets in and out of devices based on their application type or port number. Route data into and out of the local area network. VLANs are commonly used with voice over IP (VoIP) to distinguish voice traffic from data traffic. Traffic on the voice VLAN can be given a higher priority to ensure timely delivery. MAC filtering uses the MAC address of a device to drop or forward frames through the switch. Port authentication requires that the user or device authenticates before frames are forwarded through the switch. In general, all switch ports are enabled by default. To increase the security of the switch and network, you should disable individual ports that are not in use. Restricting access by MAC address is difficult to manage and still prone to spoofing. Better security is obtained by forcing computers and/or users to authenticate before full network access is granted. The IEEE 802.1X Port-based Network Access Control (PNAC) standard allows a switch to require authentication when a host connects to one of its ports. 802.1X uses authentication, authorization, and accounting (AAA) architecture: Supplicant — the device requesting access such as a user's PC or laptop. Authenticator — the switching device (or any type of network access appliance). This does not validate authentication request s directly but acts as a conduit for authentication data. Authentication server —the server that holds or can contact a directory of network objects and that can validate authentication requests, issue authorizations, and perform accounting of security events.",
      "summary": "In VLAN configurations, routers are essential for routing data between VLANs and providing port filtering to manage network traffic effectively. VLANs, particularly in VoIP applications, can prioritize voice traffic, while security measures such as MAC filtering and IEEE 802.1X Port-based Network Access Control enhance network security by requiring user or device authentication before granting access. Disabling unused switch ports and implementing authentication protocols help mitigate risks and ensure secure network access.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "When you use switches to create VLANs, you still need routers to:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_6",
      "content": "Extensible Authentication Protocol (EAP) — provides a framework for deploying multiple types of authentication methods. It is often used with digital certificates to establish a trust relationship and create a secure tunnel to transmit the user credential or to perform smart-card authentication without a password. Remote Authentication Dial-In User Service (RADIUS) — allows the authenticator and authentication server to communicate authentication and authorization decisions. The authenticator is a RADIUS client; the authentication server is a RADIUS server. When a host connects to an 802.1X-enabled switch port, the switch opens the port for the EAP over LAN (EAPoL) protocol only. The switch port only allows full data access when the host has been authenticated. The switch receives an EAP packet with the supplicant's credentials. These are encrypted and cannot be read by the switch. The switch uses the RADIUS protocol to send the EAP packet to the authentication server. The authentication server can access the directory of user accounts and can validate the credential. If authentication is successful, it informs the switch that full network access can be granted. Description Some hosts are so security-critical that it is unsafe to connect them to any type of network. One example is the root certification authority in PKI. Another example is a host used to analyze malware execution. A host that is not physically connected to any network is said to be air-gapped. It is also possible to configure an air-gapped network. This means that hosts within the air-gapped network can communicate, but there is no cabled or wireless connection to any other network. Military bases, government sites, and industrial facilities use air-gapped networks. Physically isolating a host or group of hosts improves security but also incurs significant management challenges. Device administration has to be performed at a local terminal. Any updates or installs have to be performed using USB or optical media. This media is a potential attack vector and must be scanned before allowing its use on an air-gapped host. Spanning Tree Protocol To provide fault tolerance, many networks implement redundant paths between devices using multiple switches. However, providing redundant paths between segments causes packets to be passed between the redundant paths endlessly. This condition is known as a switching loop. Switching loops lead to incorrect entries in a MAC address table, making a device appear to be connected to the wrong port and causing unicast traffic to be circulated in a loop between switches. The Spanning Tree Protocol runs on switches to prevent switching loops by making only a single path between switches active at a single time.",
      "summary": "The CompTIA Security+ course covers the 802.1X standard, which utilizes Extensible Authentication Protocol (EAP) for various authentication methods and Remote Authentication Dial-In User Service (RADIUS) for communication between authenticators and authentication servers, ensuring secure network access. It also discusses air-gapped networks, which enhance security by isolating critical hosts from external connections, albeit with management challenges. Additionally, the course introduces Spanning Tree Protocol, which prevents switching loops in networks with redundant paths, ensuring efficient data transmission and network stability.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "The 802.1X standard is implemented by two protocols:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_7",
      "content": "Provides redundant paths between devices. Recovers automatically from a topology change or device failure by unblocking redundant paths. Identifies the optimal path between any two network devices. Calculates the best loop-free path through a network by assigning a role to each bridge or switch and by assigning roles to the ports of each bridge or switch.",
      "summary": "The Spanning Tree Protocol (STP) is essential for maintaining network stability by providing redundant paths between devices while preventing loops. It automatically recovers from topology changes or device failures by unblocking alternative paths and identifies the optimal loop-free route by assigning roles to bridges and their ports. This ensures efficient data transmission and enhances the overall resilience of the network infrastructure.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "The Spanning Tree Protocol also:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_8",
      "content": "Root ports, which are configured to communicate directly to the root switch. Designated ports, which forward frames to and from attached hosts. Blocked ports, which form a loop and are used for redundancy.",
      "summary": "The Spanning Tree Protocol (STP) utilizes three types of ports to manage network traffic and prevent loops. Root ports connect directly to the root switch, designated ports facilitate communication with attached hosts, and blocked ports are used for redundancy by preventing loops in the network. Understanding these port types is essential for maintaining network stability and efficiency.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "The type of ports used by the Spanning Tree Protocol are:",
      "timestamp_range": null
    },
    {
      "chunk_id": "5.9.3_chunk_9",
      "content": "Blocking Listening Learning Forwarding Disabled",
      "summary": "In the Spanning Tree Protocol (STP), network ports can be in one of five states: Blocking, Listening, Learning, Forwarding, or Disabled. These states help manage data flow and prevent loops in network topologies, ensuring efficient communication and stability. Understanding these states is crucial for network security and performance optimization in complex environments.",
      "metadata": {
        "chapter_num": "5",
        "section_num": "5.9.3",
        "title": "Switch Security Facts",
        "content_type": "text",
        "filename": "5.9.3_Switch_Security_Facts_[text].txt",
        "file_path": "data_raw/05_Network_Architecture/5.9.3_Switch_Security_Facts_[text].txt",
        "word_count": 1443,
        "has_content": true
      },
      "section_header": "Ports in the Spanning Tree Protocol exist in one of five states:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 9
}