{
  "metadata": {
    "chapter_num": "10",
    "section_num": "10.5.4",
    "title": "Enforcing Mobile Device Security Facts",
    "content_type": "text",
    "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
    "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
    "word_count": 1188,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 One of the key problems associated with managing mobile devices is the fact that they cannot be joined to a Windows domain. This means Group Policy cannot be used to push security settings to mobile devices automatically. Mobile Device Management (MDM) Windows Intune Windows Intune configurations System configuration for Windows Intune Mobile Device Management (MDM) One option you can use instead of Group Policy is Mobile Device Management (MDM). Its security settings include the following: Security settings can be manually configured on each device. This option doesn't require any additional infrastructure to be implemented. However, it can be a time-consuming task for the administrator (especially in a large organization with many mobile devices) and is not recommended. For devices running Apple's iOS operating system, security settings can be distributed in a configuration profile for users to install. The profile can be defined so that only an administrator can delete the profile, or you can lock the profile to the device so that it cannot be removed without completely erasing the device. This option also doesn't require any additional infrastructure for implementation. However, it does rely on the end user to implement the profile, which can be problematic. Additionally, it is not a dynamic strategy, so making even the smallest change to your Mobile Device Security policies would require a great deal of effort to implement. A Mobile Device Management solution that pushes security policies directly to each device over a network connection can be implemented. This option enables policies to be remotely enforced and updated without any action by the end user. Many companies have MDM products, including Apple, Cisco, and Microsoft. Windows Intune One widely used MDM solution is Windows Intune, which provides cloud-based Mobile Device Management that allows you to remotely manage and secure mobile devices (as well as standard desktop systems starting with Windows 7 or later). Intune cannot be used to manage Windows Server. The table below shows which operating systems Windows Intune currently supports: Device Supported Apple Apple iOS 8.0 and later Mac OS X 10.9 and later Windows Windows 10 (Home, S, Pro, Education, and Enterprise versions) Windows 10 Mobile Windows Phone 8.1 Windows 8.1 RT PCs running Windows 8.1 Devices running Windows 10 IoT Enterprise (x86, x64) Devices running Windows 10 IoT Mobile Enterprise Windows Holographic & Windows Holographic Enterprise Google Google Android 4.0 Google Android for Work Customers with Enterprise Management + Security (EMS) can also use Azure Active Directory (Azure AD) to register Windows 10 devices. Windows Intune Configurations Intune Standalone is the recommended deployment method. Intune Standalone is a cloud-only solution that is managed using a web console that can be accessed from anywhere with internet access. Hybrid MDM with Configuration Manager is a solution that combines Intune's Mobile Device Management capabilities into Configuration Manager. It uses Intune for policies, profiles, and applications for devices, but it uses Configuration Manager to administer content and manage the devices. This course covers only cloud-only deployments. Deploying Intune in United Configuration Mode requires experience and skill beyond the scope of this course. You must first sign up for an account at Microsoft's website before you can use Intune. After you sign up for an Intune account, you can manage the deployment using the following Intune Management Portals: Account Portal is used to manage subscriptions, users, groups, and domains. End users can also use the account portal to manage their passwords. Admin Portal is used to manage enrolled devices and policies. Company Portal is used by end users to manage their own accounts and enroll devices. System Configuration for Windows Intune After signing up for a Windows Intune subscription, you need to configure the system by completing the tasks listed in the table below: Configuration Task Description Add Intune users Windows Intune uses administrative and standard users. The first user account created when you sign up for an Intune subscription is made an administrator by default. Additional standard users can be created and managed using the account console by selecting Management > Users > New > User. You can also synchronize users and groups into the account console from your Active Directory domain. Define Intune policies Intune policies allow you to manage your mobile devices. You can perform tasks such as: Configuring security settings. Applying updates. Configuring firewall settings. Policy settings can be applied to both standalone and domain-joined devices. However, policy conflicts can occur with domain-joined devices. To prevent this from happening, verify that domain-joined devices are not configured to receive the same configuration settings from both Active Directory Group Policies and Windows Intune. Intune provides the following policy templates containing recommended settings that you can deploy: Mobile Device Security Policy Windows Firewall settings Windows Intune Agent settings Windows Intune Center settings Manage users and groups User groups allow you to deploy software and Mobile Device Security policies to specific user accounts. Device groups allow you to deploy software, Intune agent settings, and firewall settings to specific devices. Enroll computers You can enroll standard computer systems (desktops and notebooks) in Windows Intune in one of two ways: Administrator enrollment requires an Intune administrator to set up the enrollment for a specific user. User enrollment allows a user to enroll a computer through the Company Portal. Before you can enroll a system in Intune, you must first download and install the Intune client software on the computer. To do this using administrator enrollment, complete the following: Open a browser and access the Admin Console. Select Administration > Client Software Download > Download Client Software. Once this zip file has been downloaded, extract its contents and run the Windows_Intune_Setup.exe file as an administrator user. After the installation is complete, restart the computer. The newly managed computer should appear in the Intune Admin Console after a few minutes. Link User Users can self-enroll a computer by opening a browser, accessing the company portal, and logging in using their Intune user ID. Then, they select the option to enroll the current device. User-enrolled devices are automatically linked to the user ID that enrolled them. Enroll mobile devices To enroll mobile devices in Intune, you must first enable Mobile Device Management in the Admin Console. Select the Administration workspace; then select Mobile Device Management > Set Mobile Device Management Authority > Yes. Users must configure mobile devices with the address of the Intune enrollment server (enterpriseenrollment-s.manage.microsoft.com) during the enrollment process. Be sure users are provided with this address prior to starting the device enrollment process. Company Apps If you want to enroll other types of mobile devices, you must configure Intune for each platform you plan to support. For example, if you want to manage iOS devices, you must obtain an Apple Push Notification service (APNs) certificate and then upload it to Intune. Alternatively, if you plan to support Windows Phone 8 devices, you must get a Windows Phone Dev Center account and upload a signed enterprise mobile code certificate to Intune.",
  "chunks": [
    {
      "chunk_id": "10.5.4_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "The CompTIA Security+ course, Security Pro 8.0, introduces fundamental security concepts essential for protecting information systems. Key topics include risk management, threat analysis, cryptography, and network security protocols, along with practical applications such as implementing security measures and responding to incidents. This foundational knowledge equips learners to identify vulnerabilities and apply best practices in cybersecurity.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_2",
      "content": "One of the key problems associated with managing mobile devices is the fact that they cannot be joined to a Windows domain. This means Group Policy cannot be used to push security settings to mobile devices automatically.",
      "summary": "Mobile device management presents challenges, particularly because these devices cannot be integrated into a Windows domain, limiting the ability to apply Group Policy for automatic security settings. As a result, organizations must implement alternative strategies to enforce mobile device security, such as using mobile device management (MDM) solutions to manage configurations and policies effectively. Understanding these limitations is crucial for maintaining a secure mobile environment.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "10.5.4 Enforcing Mobile Device Security Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_3",
      "content": "Mobile Device Management (MDM) Windows Intune Windows Intune configurations System configuration for Windows Intune Mobile Device Management (MDM) One option you can use instead of Group Policy is Mobile Device Management (MDM). Its security settings include the following: Security settings can be manually configured on each device. This option doesn't require any additional infrastructure to be implemented. However, it can be a time-consuming task for the administrator (especially in a large organization with many mobile devices) and is not recommended. For devices running Apple's iOS operating system, security settings can be distributed in a configuration profile for users to install. The profile can be defined so that only an administrator can delete the profile, or you can lock the profile to the device so that it cannot be removed without completely erasing the device. This option also doesn't require any additional infrastructure for implementation. However, it does rely on the end user to implement the profile, which can be problematic. Additionally, it is not a dynamic strategy, so making even the smallest change to your Mobile Device Security policies would require a great deal of effort to implement. A Mobile Device Management solution that pushes security policies directly to each device over a network connection can be implemented. This option enables policies to be remotely enforced and updated without any action by the end user. Many companies have MDM products, including Apple, Cisco, and Microsoft. Windows Intune One widely used MDM solution is Windows Intune, which provides cloud-based Mobile Device Management that allows you to remotely manage and secure mobile devices (as well as standard desktop systems starting with Windows 7 or later). Intune cannot be used to manage Windows Server. The table below shows which operating systems Windows Intune currently supports: Device Supported Apple Apple iOS 8.0 and later Mac OS X 10.9 and later Windows Windows 10 (Home, S, Pro, Education, and Enterprise versions) Windows 10 Mobile Windows Phone 8.1 Windows 8.1 RT PCs running Windows 8.1 Devices running Windows 10 IoT Enterprise (x86, x64) Devices running Windows 10 IoT Mobile Enterprise Windows Holographic & Windows Holographic Enterprise Google Google Android 4.0 Google Android for Work Customers with Enterprise Management + Security (EMS) can also use Azure Active Directory (Azure AD) to register Windows 10 devices. Windows Intune Configurations",
      "summary": "This lesson focuses on Mobile Device Management (MDM) as a key security strategy, highlighting Windows Intune as a prominent cloud-based solution for managing and securing mobile devices and desktops. It discusses various MDM options, including manual configuration and the use of configuration profiles for iOS devices, while emphasizing the efficiency of remotely enforcing security policies through MDM solutions. The lesson also outlines the supported operating systems for Windows Intune, showcasing its compatibility with a range of devices from Apple, Microsoft, and Google.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_4",
      "content": "Intune Standalone is the recommended deployment method. Intune Standalone is a cloud-only solution that is managed using a web console that can be accessed from anywhere with internet access. Hybrid MDM with Configuration Manager is a solution that combines Intune's Mobile Device Management capabilities into Configuration Manager. It uses Intune for policies, profiles, and applications for devices, but it uses Configuration Manager to administer content and manage the devices.",
      "summary": "Windows Intune can be deployed in two configurations: Intune Standalone, a cloud-only solution managed via a web console for remote access, and Hybrid MDM with Configuration Manager, which integrates Intune's mobile device management features with Configuration Manager for comprehensive device and content administration. The Standalone option is recommended for its simplicity and accessibility, while the Hybrid approach offers a more integrated solution for organizations already using Configuration Manager. Both configurations enhance security and management of mobile devices within an enterprise environment.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Windows Intune can be deployed in two different configurations:",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_5",
      "content": "This course covers only cloud-only deployments. Deploying Intune in United Configuration Mode requires experience and skill beyond the scope of this course. You must first sign up for an account at Microsoft's website before you can use Intune. After you sign up for an Intune account, you can manage the deployment using the following Intune Management Portals: Account Portal is used to manage subscriptions, users, groups, and domains. End users can also use the account portal to manage their passwords. Admin Portal is used to manage enrolled devices and policies. Company Portal is used by end users to manage their own accounts and enroll devices. System Configuration for Windows Intune After signing up for a Windows Intune subscription, you need to configure the system by completing the tasks listed in the table below: Configuration Task Description Add Intune users Windows Intune uses administrative and standard users. The first user account created when you sign up for an Intune subscription is made an administrator by default. Additional standard users can be created and managed using the account console by selecting Management > Users > New > User.",
      "summary": "This course focuses on cloud-only deployments of Microsoft Intune, emphasizing the need for prior experience when deploying in United Configuration Mode. Participants learn to manage Intune through various portals: the Account Portal for subscription and user management, the Admin Portal for device and policy management, and the Company Portal for end-user account management. Key tasks include adding users, where the first account created is an administrator, and additional standard users can be managed through the account console.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Note:",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_6",
      "content": "You can also synchronize users and groups into the account console from your Active Directory domain. Define Intune policies Intune policies allow you to manage your mobile devices. You can perform tasks such as: Configuring security settings. Applying updates. Configuring firewall settings.",
      "summary": "The CompTIA Security+ course covers key security concepts such as user and group synchronization from Active Directory into account consoles and the management of mobile devices through Intune policies. It emphasizes practical applications like configuring security settings, applying updates, and managing firewall configurations to enhance organizational security. Understanding these tools is essential for maintaining a secure IT environment.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Note:",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_7",
      "content": "Policy settings can be applied to both standalone and domain-joined devices. However, policy conflicts can occur with domain-joined devices. To prevent this from happening, verify that domain-joined devices are not configured to receive the same configuration settings from both Active Directory Group Policies and Windows Intune. Intune provides the following policy templates containing recommended settings that you can deploy: Mobile Device Security Policy Windows Firewall settings Windows Intune Agent settings Windows Intune Center settings Manage users and groups",
      "summary": "In managing security policies for both standalone and domain-joined devices, it's crucial to avoid configuration conflicts, particularly with domain-joined devices receiving settings from both Active Directory Group Policies and Windows Intune. To streamline policy deployment, Windows Intune offers templates for Mobile Device Security, Windows Firewall, and Intune Agent settings, as well as tools for managing users and groups effectively. Properly implementing these policies ensures enhanced security and compliance across devices.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Note:",
      "timestamp_range": null
    },
    {
      "chunk_id": "10.5.4_chunk_8",
      "content": "User groups allow you to deploy software and Mobile Device Security policies to specific user accounts. Device groups allow you to deploy software, Intune agent settings, and firewall settings to specific devices. Enroll computers You can enroll standard computer systems (desktops and notebooks) in Windows Intune in one of two ways: Administrator enrollment requires an Intune administrator to set up the enrollment for a specific user. User enrollment allows a user to enroll a computer through the Company Portal. Before you can enroll a system in Intune, you must first download and install the Intune client software on the computer. To do this using administrator enrollment, complete the following: Open a browser and access the Admin Console. Select Administration > Client Software Download > Download Client Software. Once this zip file has been downloaded, extract its contents and run the Windows_Intune_Setup.exe file as an administrator user. After the installation is complete, restart the computer. The newly managed computer should appear in the Intune Admin Console after a few minutes. Link User Users can self-enroll a computer by opening a browser, accessing the company portal, and logging in using their Intune user ID. Then, they select the option to enroll the current device. User-enrolled devices are automatically linked to the user ID that enrolled them. Enroll mobile devices To enroll mobile devices in Intune, you must first enable Mobile Device Management in the Admin Console. Select the Administration workspace; then select Mobile Device Management > Set Mobile Device Management Authority > Yes. Users must configure mobile devices with the address of the Intune enrollment server (enterpriseenrollment-s.manage.microsoft.com) during the enrollment process. Be sure users are provided with this address prior to starting the device enrollment process. Company Apps If you want to enroll other types of mobile devices, you must configure Intune for each platform you plan to support. For example, if you want to manage iOS devices, you must obtain an Apple Push Notification service (APNs) certificate and then upload it to Intune. Alternatively, if you plan to support Windows Phone 8 devices, you must get a Windows Phone Dev Center account and upload a signed enterprise mobile code certificate to Intune.",
      "summary": "Windows Intune utilizes user and device groups to effectively deploy software and security policies, allowing for tailored management of user accounts and devices. Enrollment of computers can be conducted via administrator or user methods, requiring the installation of the Intune client software, while mobile devices necessitate enabling Mobile Device Management and configuring specific settings. Additionally, support for various mobile platforms involves obtaining necessary certificates to ensure proper management and deployment of company applications.",
      "metadata": {
        "chapter_num": "10",
        "section_num": "10.5.4",
        "title": "Enforcing Mobile Device Security Facts",
        "content_type": "text",
        "filename": "10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "file_path": "data_raw/10_Protocol_App_and_Cloud_Security/10.5.4_Enforcing_Mobile_Device_Security_Facts_[text].txt",
        "word_count": 1188,
        "has_content": true
      },
      "section_header": "Windows Intune uses two types of groups:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 8
}