{
  "metadata": {
    "chapter_num": "3",
    "section_num": "3.3.2",
    "title": "Hashing Algorithms",
    "content_type": "video",
    "filename": "3.3.2_Hashing_Algorithms_[video].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
    "word_count": 527,
    "has_content": true
  },
  "full_content": "Hashing is the process of generating a fixed-length hexadecimal string value from any file type or data. That output is often referred to as the hash or message digest. Hashing can be used to verify file integrity, create digital signatures, provide password verification, and more. There are different hashing algorithms or functions for different uses. The most common algorithms are MD5 and SHA, and two alternative hash functions are HMAC and RIPEMD. In this lesson, we'll look at these algorithms and discuss how they work. Message-Digest Algorithm version 5, commonly called MD5, was developed by Ron Rivest in 1991. This hash function generates a 128-bit message digest, but it can't be used for security purposes any longer. One of the key features of a proper hash function is that it's resistant to hash collisions, but the MD5 algorithm is extremely susceptible to collisions. Today, MD5 is mainly used to verify file integrity. The Secure Hash Algorithm, or SHA, is a family of hashes that are government-standard algorithms and were published by NIST starting in 1993. SHA-2 was published in 2001 and has become one of the standard hash functions in use today. We see it implemented frequently in security communications protocols such as TLS and SSL, PGP, SSH, and IPSec. This algorithm can generate message digests that are 224, 256, 384, or 512 bits in size. SHA-3 was released in 2015, but it's not meant to replace SHA-2, as it's still a secure hashing method. Because SHA-2 is so heavily integrated in our standard online transactions and communications, it doesn't make sense to switch over yet. SHA-3 uses a completely different process than SHA-2, but the message digests are compatible with SHA-2. What this means for us is that when SHA-2 is inevitably compromised, SHA-3 will be available to take over immediately. Hash-Based Message Authentication Code, or HMAC, is a type of message authentication code. Like a digital signature, HMAC allows a user to verify that a file or message is legitimate. When using HMAC, the message sender provides a secret key that's used with a hash function, such as MD5 or SHA, to create a message authentication code. The recipient then uses the key to verify both the integrity and authenticity of the message. In 1992, a new hash function called RIPE Message Digest, or RIPEMD, was developed based on the MD4 algorithm. In 1996, due to security issues discovered in RIPEMD, a group of Belgian researchers published four updated algorithms. While it's not as popular as SHA-2, the 160-bit function is used frequently with Bitcoin and other cryptocurrencies. That's it for this lesson. In this lesson, we discussed MD5 and SHA, the most popular hashing functions. MD5 is mostly used for file verification, while SHA-2 is widely used in many security communications protocols. We also discussed two alternative hashing functions, HMAC and RIPEMD. HMAC is used for message or file verification, and RIPEMD is mostly used with Bitcoin and other cryptocurrencies.",
  "chunks": [
    {
      "chunk_id": "3.3.2_chunk_1",
      "content": "Hashing is the process of generating a fixed-length hexadecimal string value from any file type or data. That output is often referred to as the hash or message digest. Hashing can be used to verify file integrity, create digital signatures, provide password verification, and more. There are different hashing algorithms or functions for different uses. The most common algorithms are MD5 and SHA, and two alternative hash functions are HMAC and RIPEMD. In this lesson, we'll look at these algorithms and discuss how they work.",
      "summary": "Hashing Algorithms: Hashing is the process of generating a fixed-length hexadecimal string value from any file type or data. That output is often referred to as the hash or message digest.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "Hashing Algorithms",
      "timestamp_range": "00:00-00:37"
    },
    {
      "chunk_id": "3.3.2_chunk_2",
      "content": "Message-Digest Algorithm version 5, commonly called MD5, was developed by Ron Rivest in 1991. This hash function generates a 128-bit message digest, but it can't be used for security purposes any longer. One of the key features of a proper hash function is that it's resistant to hash collisions, but the MD5 algorithm is extremely susceptible to collisions. Today, MD5 is mainly used to verify file integrity.",
      "summary": "MD5: Message-Digest Algorithm version 5, commonly called MD5, was developed by Ron Rivest in 1991. This hash function generates a 128-bit message digest, but it can't be used for security purposes any longer.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "MD5",
      "timestamp_range": "00:37-01:07"
    },
    {
      "chunk_id": "3.3.2_chunk_3",
      "content": "The Secure Hash Algorithm, or SHA, is a family of hashes that are government-standard algorithms and were published by NIST starting in 1993. SHA-2 was published in 2001 and has become one of the standard hash functions in use today. We see it implemented frequently in security communications protocols such as TLS and SSL, PGP, SSH, and IPSec. This algorithm can generate message digests that are 224, 256, 384, or 512 bits in size. SHA-3 was released in 2015, but it's not meant to replace SHA-2, as it's still a secure hashing method. Because SHA-2 is so heavily integrated in our standard online transactions and communications, it doesn't make sense to switch over yet. SHA-3 uses a completely different process than SHA-2, but the message digests are compatible with SHA-2. What this means for us is that when SHA-2 is inevitably compromised, SHA-3 will be available to take over immediately.",
      "summary": "Secure Hash Algorithm: The Secure Hash Algorithm, or SHA, is a family of hashes that are government-standard algorithms and were published by NIST starting in 1993. We see it implemented frequently in security communications protocols such as TLS and SSL, PGP, SSH, and IPSec.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "Secure Hash Algorithm",
      "timestamp_range": "01:07-02:10"
    },
    {
      "chunk_id": "3.3.2_chunk_4",
      "content": "Hash-Based Message Authentication Code, or HMAC, is a type of message authentication code. Like a digital signature, HMAC allows a user to verify that a file or message is legitimate. When using HMAC, the message sender provides a secret key that's used with a hash function, such as MD5 or SHA, to create a message authentication code. The recipient then uses the key to verify both the integrity and authenticity of the message.",
      "summary": "Hash-Based Message Authentication Code: Hash-Based Message Authentication Code, or HMAC, is a type of message authentication code. When using HMAC, the message sender provides a secret key that's used with a hash function, such as MD5 or SHA, to create a message authentication code.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "Hash-Based Message Authentication Code",
      "timestamp_range": "02:10-02:40"
    },
    {
      "chunk_id": "3.3.2_chunk_5",
      "content": "In 1992, a new hash function called RIPE Message Digest, or RIPEMD, was developed based on the MD4 algorithm. In 1996, due to security issues discovered in RIPEMD, a group of Belgian researchers published four updated algorithms. While it's not as popular as SHA-2, the 160-bit function is used frequently with Bitcoin and other cryptocurrencies.",
      "summary": "RIPE Message Digest: In 1992, a new hash function called RIPE Message Digest, or RIPEMD, was developed based on the MD4 algorithm. In 1996, due to security issues discovered in RIPEMD, a group of Belgian researchers published four updated algorithms.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "RIPE Message Digest",
      "timestamp_range": "02:40-03:06"
    },
    {
      "chunk_id": "3.3.2_chunk_6",
      "content": "That's it for this lesson. In this lesson, we discussed MD5 and SHA, the most popular hashing functions. MD5 is mostly used for file verification, while SHA-2 is widely used in many security communications protocols. We also discussed two alternative hashing functions, HMAC and RIPEMD. HMAC is used for message or file verification, and RIPEMD is mostly used with Bitcoin and other cryptocurrencies.",
      "summary": "In this lesson, we discussed MD5 and SHA, the most popular hashing functions. MD5 is mostly used for file verification, while SHA-2 is widely used in many security communications protocols.",
      "metadata": {
        "chapter_num": "3",
        "section_num": "3.3.2",
        "title": "Hashing Algorithms",
        "content_type": "video",
        "filename": "3.3.2_Hashing_Algorithms_[video].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/03_Cryptographic_Solutions/3.3.2_Hashing_Algorithms_[video].txt",
        "word_count": 527,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": "03:06-03:33"
    }
  ],
  "num_chunks": 6,
  "document_summary": "Hashing Algorithms (video): Hashing is the process of generating a fixed-length hexadecimal string value from any file type or data. This hash function generates a 128-bit message digest, but it can't be used for security purposes any longer. We see it implemented frequently in security communications protocols such as TLS and SSL, PGP, SSH, and IPSec."
}