{
  "metadata": {
    "chapter_num": "4",
    "section_num": "4.4.9",
    "title": "Group Policy Facts",
    "content_type": "text",
    "filename": "4.4.9_Group_Policy_Facts_[text].txt",
    "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.9_Group_Policy_Facts_[text].txt",
    "word_count": 728,
    "has_content": true
  },
  "full_content": "Security Pro 8.0 Group Policy is a feature of the Microsoft Windows operating system and provides centralized management and configuration of operating systems, applications, and user settings in an Active Directory environment. Group Policy GPO Application Order GPO structure Group Policy In Windows, configuration settings are stored in the registry. On a Windows domain network, each domain-joined computer will receive policy settings from one or more group policy objects (GPOs). A group policy object is a way to deploy per-user and per-computer settings in a Windows domain. These policy settings are applied to the registry each time a computer boots. Where hosts are centrally managed and running only authorized apps and services, there should be relatively little reason for security-relevant registry values to change. Rights to modify the registry should only be issued to user and service accounts on a least privilege basis. Examples of common Group Policy settings include password policies, user rights, account restrictions, Windows Firewall settings, system update settings, software installation restrictions, and many others. Applying settings centrally using Group Policy reduces potential issues related to misconfigurations or inconsistent settings. Group Policies allow the administrator to simultaneously use multiple settings for multiple objects within the Active Directory domain. Group Policies enforce security settings, such as those mandated in a baseline, by applying consistent settings across all systems linked to specific Group Policies. In general terms, Group Polices are linked to containers called Organizational Units (OUs) that normally contain user and computer objects. The Group Policies linked to the OU apply to all objects contained within it. Group Policies can also be applied to sites, domains, and local machines. A local GPO is stored on a local machine. It can define settings even if the computer is not connected to a network. Built-in containers (such as the Computers container) and folders cannot have GPOs linked to them. GPO Application Order The Local Group Policy on the computer. GPOs linked to the site. GPOs linked to the domain that contains the User or Computer object. GPOs linked to the organizational unit(s) that contain(s) the User or Computer object (from the highest-level OU to the lowest-level OU). Use the acronym LSDOU (Local, Site, Domain, and OU) to help you remember the order that GPOs are applied. The local policy is always applied. The order in which GPOs are processed is significant because when policy is applied, it overwrites policy that was applied earlier. Individual settings within all GPOs are combined to form the effective Group Policy setting as follows: If a setting is defined in one GPO and undefined in another, the defined setting is enforced (regardless of the position of the GPO in the application order). If a setting is configured in two GPOs, the setting in the last-applied GPO is used. GPO Structure Each GPO has a common structure with hundreds of configuration settings that can be enabled and configured. Settings are divided into two categories: GPO Category Description Computer Configuration Computer policies are enforced for the entire computer and are initially applied when the computer boots. Computer policies are in effect regardless of the user logging into the computer. Computer policies include: Software that should be installed on a specific computer Scripts that should run at startup or shutdown Password restrictions that must be met for all user accounts Network communication security settings Registry settings that apply to the computer (the HKEY_LOCAL_MACHINE subtree) Computer policies also include a special category of policies called user rights. User rights identify system maintenance tasks and the users or groups who can perform these actions. Actions include: Changing the system time Loading and unloading device drivers Removing a computer from a docking station Shutting down the system Computer policies are initially applied as the computer boots and are enforced before any user logs on. User Configuration User policies are enforced for specific users and are applied when the user logs on. User Policy settings include: Software that should be installed for a specific user Scripts that should run at logon or logoff Internet Explorer user settings (such as favorites and security settings) Registry settings that apply to the current user (the HKEY_CURRENT_USER subtree) User policies are initially applied as the user logs on and customizes Windows based on his or her preferences.",
  "chunks": [
    {
      "chunk_id": "4.4.9_chunk_1",
      "content": "Security Pro 8.0",
      "summary": "Security Pro 8.0",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.9",
        "title": "Group Policy Facts",
        "content_type": "text",
        "filename": "4.4.9_Group_Policy_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.9_Group_Policy_Facts_[text].txt",
        "word_count": 728,
        "has_content": true
      },
      "section_header": "Introduction",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.4.9_chunk_2",
      "content": "Group Policy is a feature of the Microsoft Windows operating system and provides centralized management and configuration of operating systems, applications, and user settings in an Active Directory environment.",
      "summary": "Group Policy is a feature of the Microsoft Windows operating system and provides centralized management and configuration of operating systems, applications, and user settings in an Active Directory environment.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.9",
        "title": "Group Policy Facts",
        "content_type": "text",
        "filename": "4.4.9_Group_Policy_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.9_Group_Policy_Facts_[text].txt",
        "word_count": 728,
        "has_content": true
      },
      "section_header": "4.4.9 Group Policy Facts",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.4.9_chunk_3",
      "content": "Group Policy GPO Application Order GPO structure Group Policy In Windows, configuration settings are stored in the registry. On a Windows domain network, each domain-joined computer will receive policy settings from one or more group policy objects (GPOs). A group policy object is a way to deploy per-user and per-computer settings in a Windows domain. These policy settings are applied to the registry each time a computer boots. Where hosts are centrally managed and running only authorized apps and services, there should be relatively little reason for security-relevant registry values to change. Rights to modify the registry should only be issued to user and service accounts on a least privilege basis. Examples of common Group Policy settings include password policies, user rights, account restrictions, Windows Firewall settings, system update settings, software installation restrictions, and many others. Applying settings centrally using Group Policy reduces potential issues related to misconfigurations or inconsistent settings. Group Policies allow the administrator to simultaneously use multiple settings for multiple objects within the Active Directory domain. Group Policies enforce security settings, such as those mandated in a baseline, by applying consistent settings across all systems linked to specific Group Policies. In general terms, Group Polices are linked to containers called Organizational Units (OUs) that normally contain user and computer objects. The Group Policies linked to the OU apply to all objects contained within it. Group Policies can also be applied to sites, domains, and local machines. A local GPO is stored on a local machine. It can define settings even if the computer is not connected to a network. Built-in containers (such as the Computers container) and folders cannot have GPOs linked to them. GPO Application Order",
      "summary": "This lesson covers the following topics:: On a Windows domain network, each domain-joined computer will receive policy settings from one or more group policy objects (GPOs). Examples of common Group Policy settings include password policies, user rights, account restrictions, Windows Firewall settings, system update settings, software installation restrictions, and many others.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.9",
        "title": "Group Policy Facts",
        "content_type": "text",
        "filename": "4.4.9_Group_Policy_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.9_Group_Policy_Facts_[text].txt",
        "word_count": 728,
        "has_content": true
      },
      "section_header": "This lesson covers the following topics:",
      "timestamp_range": null
    },
    {
      "chunk_id": "4.4.9_chunk_4",
      "content": "The Local Group Policy on the computer. GPOs linked to the site. GPOs linked to the domain that contains the User or Computer object. GPOs linked to the organizational unit(s) that contain(s) the User or Computer object (from the highest-level OU to the lowest-level OU). Use the acronym LSDOU (Local, Site, Domain, and OU) to help you remember the order that GPOs are applied. The local policy is always applied. The order in which GPOs are processed is significant because when policy is applied, it overwrites policy that was applied earlier. Individual settings within all GPOs are combined to form the effective Group Policy setting as follows: If a setting is defined in one GPO and undefined in another, the defined setting is enforced (regardless of the position of the GPO in the application order). If a setting is configured in two GPOs, the setting in the last-applied GPO is used. GPO Structure Each GPO has a common structure with hundreds of configuration settings that can be enabled and configured. Settings are divided into two categories: GPO Category Description Computer Configuration Computer policies are enforced for the entire computer and are initially applied when the computer boots. Computer policies are in effect regardless of the user logging into the computer. Computer policies include: Software that should be installed on a specific computer Scripts that should run at startup or shutdown Password restrictions that must be met for all user accounts Network communication security settings Registry settings that apply to the computer (the HKEY_LOCAL_MACHINE subtree) Computer policies also include a special category of policies called user rights. User rights identify system maintenance tasks and the users or groups who can perform these actions. Actions include: Changing the system time Loading and unloading device drivers Removing a computer from a docking station Shutting down the system Computer policies are initially applied as the computer boots and are enforced before any user logs on. User Configuration User policies are enforced for specific users and are applied when the user logs on. User Policy settings include: Software that should be installed for a specific user Scripts that should run at logon or logoff Internet Explorer user settings (such as favorites and security settings) Registry settings that apply to the current user (the HKEY_CURRENT_USER subtree) User policies are initially applied as the user logs on and customizes Windows based on his or her preferences.",
      "summary": "GPOs are applied in the following order:: The Local Group Policy on the computer. The order in which GPOs are processed is significant because when policy is applied, it overwrites policy that was applied earlier.",
      "metadata": {
        "chapter_num": "4",
        "section_num": "4.4.9",
        "title": "Group Policy Facts",
        "content_type": "text",
        "filename": "4.4.9_Group_Policy_Facts_[text].txt",
        "file_path": "/Users/basantabaral/CompTia/data_raw/04_Identity_and_Access_Management/4.4.9_Group_Policy_Facts_[text].txt",
        "word_count": 728,
        "has_content": true
      },
      "section_header": "GPOs are applied in the following order:",
      "timestamp_range": null
    }
  ],
  "num_chunks": 4,
  "document_summary": "Group Policy Facts (text): 0 Group Policy is a feature of the Microsoft Windows operating system and provides centralized management and configuration of operating systems, applications, and user settings in an Active Directory environment. On a Windows domain network, each domain-joined computer will receive policy settings from one or more group policy objects (GPOs). Examples of common Group Policy settings include password policies, user rights, account restrictions, Windows Firewall settings, system update settings, software installation restrictions, and many others."
}