{
  "metadata": {
    "chapter_num": "6",
    "section_num": "6.2.5",
    "title": "Perform Reconnaissance with Nmap",
    "content_type": "video",
    "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
    "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
    "word_count": 874,
    "has_content": true
  },
  "full_content": "Transcript close interactive script One of the very first things you do as a penetration tester or ethical hacker is gather information. There are a lot of tools that can help you to do this. Most ethical hackers start with some very basic command line tools. In this demo, we're going to perform some reconnaissance using some of these basic tools. Our target is a domain set up by the Nmap Security Scanner Project and insecure.org. They've set up scanme.nmap.org to help people learn about Nmap and other tools. They authorize students to do scans as long as they're done within reason. Let's close the web browser. To get started, we're going to go through some reconnaissance steps. First, I just want to make sure that the site is live, so let's ping it. I'll just type, 'ping scanme.nmap.org', press Enter, and I get a response. I'll hit Ctrl+C to stop the ping, and I can confirm that the site is live. Now let's find the path to our target by performing a traceroute. On Windows, you do that by typing tracert. But we're on our Kali Linux system, so we need to type in 'traceroute scanme.nmap.org' and then Enter. I get over a dozen hops between me and the target. These, down here, aren't responding to the request, but my traceroute still continues. This is normal behavior. Let's clear our screen. Now, I'm interested in finding the name server information for our target. I'm going to type in 'nslookup scanme.nmap.org' and press Enter. I get the IP addresses for both IP version 4 and version 6 along with the server names. You can perform a whois search from the command line in Linux. To do that, I'll type in 'whois nmap.org' and press Enter. I'll scroll up, and here, I can see all the information about nmap that's available from whois. I'll clear the screen again. Next, let's see what happens if we try to make a connection with the target. I know that port 80 is open because we were just at the website. Let's use Netcat to see if we can make a connection to the site on port 80. For that, I'll type in 'nc -v scanme.nmap.org 80' and press Enter. I get a response back, and it looks like I'm connected. Typically, if you want to make sure you're connected, you can type 'help', and you'll get a response. I do get a response. Not only that, I get some information about what sort of server they're running and even the version. Let's try another. I'll use my up arrow to get back to our last command. I'll change the 80 to a 22 and press Enter. I get a connection again and see that they're running SSH, and I get the version number along with some other information. All right, let's move on. I have to press Ctrl+C to get out of this, and I'll also clear the screen. You'll get a lot of use out of Nmap as a penetration tester and ethical hacker. We were just using Netcat to make connections to ports. But with 65,535 possible ports, that would take all day. We can use Nmap to do a scan to see what ports are open. To do a port scan, I'll type, 'nmap -sS scanme.nmap.org' and press Enter. The -sS parameter scans the 1,000 most common ports. I get some results back. I know what ports are open. I know the state of the port and what service is running. Now, if I want to continue working with Netcat, I have a list of ports I know are open. Earlier, we did a ping to see if the target was alive. Let's repeat that now to get the IP address. I'll type 'ping scanme.nmap.org' and press Enter. I'll press Ctrl+C to stop the ping. Now, I want to do a ping sweep to see what other IPs might be associated with scanme.nmap.org. To do a ping sweep, I'll type in 'nmap -sn 45.33.32.1-255' and press Enter. Now I can go through this list and see which other IPs might be associated with scanme.nmap.org. That's it for this demo. In this demo, we did some basic reconnaissance. First, we used some command line tools to find information about our target. Then we used Netcat to connect to open ports. Finally, we used nmap to perform a basic port scan and a ping sweep.",
  "chunks": [
    {
      "chunk_id": "6.2.5_chunk_1",
      "content": "One of the very first things you do as a penetration tester or ethical hacker is gather information. There are a lot of tools that can help you to do this. Most ethical hackers start with some very basic command line tools. In this demo, we're going to perform some reconnaissance using some of these basic tools. Our target is a domain set up by the Nmap Security Scanner Project and insecure.org. They've set up scanme.nmap.org to help people learn about Nmap and other tools. They authorize students to do scans as long as they're done within reason. Let's close the web browser.",
      "summary": "In the CompTIA Security+ course section on reconnaissance with Nmap, learners are introduced to the foundational practice of information gathering essential for penetration testing and ethical hacking. The focus is on utilizing basic command line tools, specifically Nmap, to perform scans on a designated target, scanme.nmap.org, which is set up for educational purposes. This hands-on approach emphasizes practical applications of reconnaissance techniques in cybersecurity.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.5",
        "title": "Perform Reconnaissance with Nmap",
        "content_type": "video",
        "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "word_count": 874,
        "has_content": true
      },
      "section_header": "Perform Reconnaissance with Nmap",
      "timestamp_range": ""
    },
    {
      "chunk_id": "6.2.5_chunk_2",
      "content": "To get started, we're going to go through some reconnaissance steps. First, I just want to make sure that the site is live, so let's ping it. I'll just type, 'ping scanme.nmap.org', press Enter, and I get a response. I'll hit Ctrl+C to stop the ping, and I can confirm that the site is live. Now let's find the path to our target by performing a traceroute. On Windows, you do that by typing tracert. But we're on our Kali Linux system, so we need to type in 'traceroute scanme.nmap.org' and then Enter. I get over a dozen hops between me and the target. These, down here, aren't responding to the request, but my traceroute still continues. This is normal behavior. Let's clear our screen. Now, I'm interested in finding the name server information for our target. I'm going to type in 'nslookup scanme.nmap.org' and press Enter. I get the IP addresses for both IP version 4 and version 6 along with the server names. You can perform a whois search from the command line in Linux. To do that, I'll type in 'whois nmap.org' and press Enter. I'll scroll up, and here, I can see all the information about nmap that's available from whois. I'll clear the screen again.",
      "summary": "The reconnaissance steps in the CompTIA Security+ course involve verifying the target's availability through ping and traceroute commands, which help determine the network path to the target. Additionally, participants learn to gather name server information using nslookup and perform whois searches to obtain detailed registration data about the target. These practical applications are essential for understanding the initial phases of network security assessments.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.5",
        "title": "Perform Reconnaissance with Nmap",
        "content_type": "video",
        "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "word_count": 874,
        "has_content": true
      },
      "section_header": "Reconnaissance Steps",
      "timestamp_range": ""
    },
    {
      "chunk_id": "6.2.5_chunk_3",
      "content": "Next, let's see what happens if we try to make a connection with the target. I know that port 80 is open because we were just at the website. Let's use Netcat to see if we can make a connection to the site on port 80. For that, I'll type in 'nc -v scanme.nmap.org 80' and press Enter. I get a response back, and it looks like I'm connected. Typically, if you want to make sure you're connected, you can type 'help', and you'll get a response. I do get a response. Not only that, I get some information about what sort of server they're running and even the version. Let's try another. I'll use my up arrow to get back to our last command. I'll change the 80 to a 22 and press Enter. I get a connection again and see that they're running SSH, and I get the version number along with some other information. All right, let's move on. I have to press Ctrl+C to get out of this, and I'll also clear the screen.",
      "summary": "In the \"Perform Basic Reconnaissance\" section of the CompTIA Security+ course, learners explore how to use Netcat for network reconnaissance by connecting to open ports on a target system, such as port 80 for HTTP and port 22 for SSH. This practical exercise demonstrates how to gather information about the server type and version, which is crucial for identifying potential vulnerabilities. Understanding these reconnaissance techniques is essential for effective cybersecurity assessments and threat analysis.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.5",
        "title": "Perform Reconnaissance with Nmap",
        "content_type": "video",
        "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "word_count": 874,
        "has_content": true
      },
      "section_header": "Perform Basic Reconnaissance",
      "timestamp_range": ""
    },
    {
      "chunk_id": "6.2.5_chunk_4",
      "content": "You'll get a lot of use out of Nmap as a penetration tester and ethical hacker. We were just using Netcat to make connections to ports. But with 65,535 possible ports, that would take all day. We can use Nmap to do a scan to see what ports are open. To do a port scan, I'll type, 'nmap -sS scanme.nmap.org' and press Enter. The -sS parameter scans the 1,000 most common ports. I get some results back. I know what ports are open. I know the state of the port and what service is running. Now, if I want to continue working with Netcat, I have a list of ports I know are open. Earlier, we did a ping to see if the target was alive. Let's repeat that now to get the IP address. I'll type 'ping scanme.nmap.org' and press Enter. I'll press Ctrl+C to stop the ping. Now, I want to do a ping sweep to see what other IPs might be associated with scanme.nmap.org. To do a ping sweep, I'll type in 'nmap -sn 45.33.32.1-255' and press Enter. Now I can go through this list and see which other IPs might be associated with scanme.nmap.org.",
      "summary": "In this section, learners explore the use of Nmap for basic reconnaissance in penetration testing and ethical hacking. The course demonstrates how to perform port scans to identify open ports and their associated services, as well as conducting ping sweeps to discover additional IP addresses linked to a target. These practical applications enhance the ability to gather critical information about network security and potential vulnerabilities.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.5",
        "title": "Perform Reconnaissance with Nmap",
        "content_type": "video",
        "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "word_count": 874,
        "has_content": true
      },
      "section_header": "Perform Basic Reconnaissance with Network Mapper",
      "timestamp_range": ""
    },
    {
      "chunk_id": "6.2.5_chunk_5",
      "content": "That's it for this demo. In this demo, we did some basic reconnaissance. First, we used some command line tools to find information about our target. Then we used Netcat to connect to open ports. Finally, we used nmap to perform a basic port scan and a ping sweep.",
      "summary": "In this demo, basic reconnaissance techniques were demonstrated using command line tools to gather information about a target. The session included connecting to open ports with Netcat and performing a port scan and ping sweep using nmap. These practical applications illustrate foundational skills in network security and vulnerability assessment.",
      "metadata": {
        "chapter_num": "6",
        "section_num": "6.2.5",
        "title": "Perform Reconnaissance with Nmap",
        "content_type": "video",
        "filename": "6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "file_path": "data_raw/06_Resiliency_and_Site_Security/6.2.5_Perform_Reconnaissance_with_Nmap_[video].txt",
        "word_count": 874,
        "has_content": true
      },
      "section_header": "Summary",
      "timestamp_range": ""
    }
  ],
  "num_chunks": 5
}